{
  "Topic": {
    "TopicId": "2453",
    "ForumId": "10",
    "Title": "Question about verbs",
    "LastUpdated": "2011-04-13T06:22:37+01:00",
    "ReplyCount": 1
  },
  "Posts": [
    {
      "PostId": "18002",
      "UserId": 0,
      "Username": "Saluki_princess",
      "UserAvatar": null,
      "UserGravatar": "3d659757d21e3d6042bcd0804bac2f80",
      "EditableText": "I'm completely new to both making and playing interactive fiction, so I was going through the tutorial, but I already have a problem I can't seem to figure out. \nFor some reason, the verbs I've applied to my objects don't work unless the object can be taken. The program just says, &quot;I can't see that here.&quot; \nBut it will say, &quot;there is Object here,&quot; so I know the object is in the room I placed it in. \nThanks so much for the help.",
      "EditableFormat": "bbcode",
      "HTML": "I'm completely new to both making and playing interactive fiction, so I was going through the tutorial, but I already have a problem I can't seem to figure out. <br/>For some reason, the verbs I've applied to my objects don't work unless the object can be taken. The program just says, &quot;I can't see that here.&quot; <br/>But it will say, &quot;there is Object here,&quot; so I know the object is in the room I placed it in. <br/>Thanks so much for the help.",
      "PostDate": "2011-04-13T05:44:20+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "18003",
      "UserId": 0,
      "Username": "RedTulip",
      "UserAvatar": null,
      "UserGravatar": "6d6ade23f085a9bcd2bfb10f5596d451",
      "EditableText": "What [i:in20sbe6]exactly[/i:in20sbe6] did you type on the player? Maybe you added a period to the end, and that doesn't really work, often.\nDid you type (example) 'open object.'?\nTry removing the period on the end.",
      "EditableFormat": "bbcode",
      "HTML": "What <span style=\"font-style:italic;\">exactly</span> did you type on the player? Maybe you added a period to the end, and that doesn't really work, often.<br/>Did you type (example) 'open object.'?<br/>Try removing the period on the end.",
      "PostDate": "2011-04-13T06:22:37+01:00",
      "LastEditDate": null
    }
  ]
}
