{
  "Topic": {
    "TopicId": "4xujoxy10kmlh5nrs8apaa",
    "ForumId": "10",
    "Title": "Hyperlinks not showing verbs when clicked (SOLVED)",
    "LastUpdated": "2018-09-01T17:21:40.3329015Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "8fd8204d-da11-42bb-a9b3-8b1c5799f7b3",
      "UserId": 233128,
      "Username": "kurto321",
      "AvatarUrl": "https://graph.facebook.com/100000792713037/picture?width=80&height=80",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "In the game i'm making, I'm only using hyperlinks for player navigation. I've quickly run into another roadblock - in one specific room, the object hyperlinks generated upon entering the room don't show the verbs associated with the objects when clicked. However, when I use FormatObjectList via a script on an inventory item, the newer hyperlinks generated _do_ show the verbs when clicked. Is there anything in particular that would cause this? I can give more information if needed. Thanks!\r\n\r\nEdit: It seems that performing any interaction using an inventory item makes the hyperlinks show their verbs when clicked...I'm quite perplexed...",
      "EditableFormat": "markdown",
      "HTML": "<p>In the game i'm making, I'm only using hyperlinks for player navigation. I've quickly run into another roadblock - in one specific room, the object hyperlinks generated upon entering the room don't show the verbs associated with the objects when clicked. However, when I use FormatObjectList via a script on an inventory item, the newer hyperlinks generated <em>do</em> show the verbs when clicked. Is there anything in particular that would cause this? I can give more information if needed. Thanks!</p>\n<p>Edit: It seems that performing any interaction using an inventory item makes the hyperlinks show their verbs when clicked...I'm quite perplexed...</p>\n\n",
      "PostDate": "2018-09-01T17:21:40.3329015Z",
      "LastEditDate": "2018-09-01T18:14:34.7761905Z",
      "link": null
    },
    {
      "PostId": "6d0c87e0-3639-4282-8da6-92cc087a716f",
      "UserId": 319917,
      "Username": "mrangel",
      "AvatarUrl": "https://secure.gravatar.com/avatar/?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Are you using a turnscript or a TurnTimeout to move the player into this room?\r\n\r\nBy default, all hyperlinks are sent to the browser as \"blank\" hyperlinks that don't do anything.\r\nThen, at the end of every turn a function `UpdateObjectLinks` sends out a list of the current displayverbs for every object reachable. Links to those objects are modified to have the correct menu loaded, and all other object links are disabled. (This is so that the player can't scroll back to the previous room and click on objects there)\r\n\r\nIf an object has a link, but clicking the link doesn't make a menu appear, that sounds to me like the links are being generated *after* UpdateObjectLinks is run, meaning that the menu doesn't work properly until next turn.\r\n\r\nI can't find anywhere this could happen; I'm not entirely sure about the order things are processed in the latest version. But it might be worth putting `UpdateObjectLinks()` in the room's enter script (after the links are displayed) to see if that helps.",
      "EditableFormat": "markdown",
      "HTML": "<p>Are you using a turnscript or a TurnTimeout to move the player into this room?</p>\n<p>By default, all hyperlinks are sent to the browser as \"blank\" hyperlinks that don't do anything.<br>\nThen, at the end of every turn a function <code>UpdateObjectLinks</code> sends out a list of the current displayverbs for every object reachable. Links to those objects are modified to have the correct menu loaded, and all other object links are disabled. (This is so that the player can't scroll back to the previous room and click on objects there)</p>\n<p>If an object has a link, but clicking the link doesn't make a menu appear, that sounds to me like the links are being generated <em>after</em> UpdateObjectLinks is run, meaning that the menu doesn't work properly until next turn.</p>\n<p>I can't find anywhere this could happen; I'm not entirely sure about the order things are processed in the latest version. But it might be worth putting <code>UpdateObjectLinks()</code> in the room's enter script (after the links are displayed) to see if that helps.</p>\n\n",
      "PostDate": "2018-09-01T17:56:34.7703279Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "05b3473b-e9d8-4fd6-9a25-a02b0d1efec2",
      "UserId": 233128,
      "Username": "kurto321",
      "AvatarUrl": "https://graph.facebook.com/100000792713037/picture?width=80&height=80",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Thanks, I'll try it! The only thing I can think of that could make the hyperlinks appear after something else is a few instances of 'run script after x seconds' that I'm using.",
      "EditableFormat": "markdown",
      "HTML": "<p>Thanks, I'll try it! The only thing I can think of that could make the hyperlinks appear after something else is a few instances of 'run script after x seconds' that I'm using.</p>\n\n",
      "PostDate": "2018-09-01T18:01:37.8996434Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "297c941b-2d02-4c9b-a305-740189c3b3a8",
      "UserId": 233128,
      "Username": "kurto321",
      "AvatarUrl": "https://graph.facebook.com/100000792713037/picture?width=80&height=80",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "It seems to have worked! Many thanks!",
      "EditableFormat": "markdown",
      "HTML": "<p>It seems to have worked! Many thanks!</p>\n\n",
      "PostDate": "2018-09-01T18:05:19.6680926Z",
      "LastEditDate": null,
      "link": null
    }
  ]
}
