{
  "Topic": {
    "TopicId": "5648",
    "ForumId": "10",
    "Title": "turning off all linked verbs to items",
    "LastUpdated": "2015-11-25T08:03:10+00:00",
    "ReplyCount": 2
  },
  "Posts": [
    {
      "PostId": "38848",
      "UserId": 0,
      "Username": "XanMag",
      "UserAvatar": "7161_1436827710.jpg",
      "UserGravatar": "4b45a3afd18077f76f6569225c422bdb",
      "EditableText": "So... 2 questions...\n\n1)  I've already created a LOT of objects.  I do not want to go through each individual object and remove the automatic built-in verbs for every single item (look at and take).  I also do not want to remove the 'places and items' window pane.  I like having it there but do not want the player to rely on those verbs.  Is there a universal 'turn off' option for all things that appear in that window and in the inventory window?  I'm sure that's an easy one, but I've never tried it.\n\n2)  X2 is massive.  I've always thought that supplying pop-up verbs for items you click on allows the player mild hints for what to do with an object when, as the creator, I want the players to read the text I've taken time to write and [i:1lb4t2el]respond and react to the story[/i:1lb4t2el] via typing - not just click-click-clicky-click their way through the game.  What is your opinion as a gamer?  It seems like a lot of people like to click instead of type, but not me... I'm old school.  Will this be a deterrent to playing the game especially considering the games length?  Keep in mind, I do have a built-in hints system ready for use if/when players get stuck.\n\nThanks for the input.  Happy gaming.\n\nXanMag",
      "EditableFormat": "bbcode",
      "HTML": "So... 2 questions...<br/><br/>1)  I've already created a LOT of objects.  I do not want to go through each individual object and remove the automatic built-in verbs for every single item (look at and take).  I also do not want to remove the 'places and items' window pane.  I like having it there but do not want the player to rely on those verbs.  Is there a universal 'turn off' option for all things that appear in that window and in the inventory window?  I'm sure that's an easy one, but I've never tried it.<br/><br/>2)  X2 is massive.  I've always thought that supplying pop-up verbs for items you click on allows the player mild hints for what to do with an object when, as the creator, I want the players to read the text I've taken time to write and <span style=\"font-style:italic;\">respond and react to the story</span> via typing - not just click-click-clicky-click their way through the game.  What is your opinion as a gamer?  It seems like a lot of people like to click instead of type, but not me... I'm old school.  Will this be a deterrent to playing the game especially considering the games length?  Keep in mind, I do have a built-in hints system ready for use if/when players get stuck.<br/><br/>Thanks for the input.  Happy gaming.<br/><br/>XanMag",
      "PostDate": "2015-11-25T01:01:20+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "38852",
      "UserId": 0,
      "Username": "Forgewright",
      "UserAvatar": "6526_1436782372.jpg",
      "UserGravatar": "7cd39eda147e41376a7192dbd0bb386e",
      "EditableText": "I have all objects as scenery. Some items are mentioned in the description and others are added after the description in italics if they are in the room. There is no clicking with options and no links. All discoveries are made through player input by looking or searching or interacting. This gives the game different levels of discovering and depends on the player's interactions to be found or used in some way. I don't care for displaying all the options and as you said, clicking their way through the game. It is too &quot;hand holding or leading&quot; for me.\n\n Even the exits are not shown. I only describe n, s, e, w in the description but a player can look and go in every direction allowed. I do allow options in the inventory pane...for now but I may change that as well.\n\nI have no advice on turning off the verbs globally. I'm sure someone will have the solution. \nGood luck on the game!",
      "EditableFormat": "bbcode",
      "HTML": "I have all objects as scenery. Some items are mentioned in the description and others are added after the description in italics if they are in the room. There is no clicking with options and no links. All discoveries are made through player input by looking or searching or interacting. This gives the game different levels of discovering and depends on the player's interactions to be found or used in some way. I don't care for displaying all the options and as you said, clicking their way through the game. It is too &quot;hand holding or leading&quot; for me.<br/><br/> Even the exits are not shown. I only describe n, s, e, w in the description but a player can look and go in every direction allowed. I do allow options in the inventory pane...for now but I may change that as well.<br/><br/>I have no advice on turning off the verbs globally. I'm sure someone will have the solution. <br/>Good luck on the game!",
      "PostDate": "2015-11-25T05:53:46+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "38856",
      "UserId": 0,
      "Username": "The Pixie",
      "UserAvatar": null,
      "UserGravatar": "cfa37e927f96177bcf6053ae8f108f77",
      "EditableText": "On the Room Descriptions tab of the game object there is an &quot;Automatically generate object display verbs list&quot; option you can turn off, but I think that is only for verbs, not the defaults. If that fails, you could override the defaultobject type from CoreTypes.aslx, though I have to say I would be a little wary of that.\n\nWith regards to making players type, I think that that is the only way for most adventure game authoring systems. Take a look at IFComp and see what was popular. The top three at least require the player to type commands.",
      "EditableFormat": "bbcode",
      "HTML": "On the Room Descriptions tab of the game object there is an &quot;Automatically generate object display verbs list&quot; option you can turn off, but I think that is only for verbs, not the defaults. If that fails, you could override the defaultobject type from CoreTypes.aslx, though I have to say I would be a little wary of that.<br/><br/>With regards to making players type, I think that that is the only way for most adventure game authoring systems. Take a look at IFComp and see what was popular. The top three at least require the player to type commands.",
      "PostDate": "2015-11-25T08:03:10+00:00",
      "LastEditDate": null
    }
  ]
}
