{
  "Topic": {
    "TopicId": "6293",
    "ForumId": "10",
    "Title": "Pixie Combat Library",
    "LastUpdated": "2016-05-04T11:21:21+01:00",
    "ReplyCount": 2
  },
  "Posts": [
    {
      "PostId": "42611",
      "UserId": 0,
      "Username": "thierry_st_malo",
      "UserAvatar": null,
      "UserGravatar": "dd4d3ca1b00054d0f534c5a12491d74c",
      "EditableText": "I find this library so much interesting that I want to translate it into French. Being French myself I can do that, of course, making clear that the work is Pixie's, not mine.  But...\nA first attempt does show that it should be possible, but in order to be efficient I need to know what files don't need to be translated and also [i:30e1y5kt]in what order[/i:30e1y5kt] the other ones should be translated. This is to avoid as much as possible useless navigation from file to file and disappointing tests failing because a given word is translated in a file and not in another.\n\nCan you help? Thanks in advance,\n\nThierry",
      "EditableFormat": "bbcode",
      "HTML": "I find this library so much interesting that I want to translate it into French. Being French myself I can do that, of course, making clear that the work is Pixie's, not mine.  But...<br/>A first attempt does show that it should be possible, but in order to be efficient I need to know what files don't need to be translated and also <span style=\"font-style:italic;\">in what order</span> the other ones should be translated. This is to avoid as much as possible useless navigation from file to file and disappointing tests failing because a given word is translated in a file and not in another.<br/><br/>Can you help? Thanks in advance,<br/><br/>Thierry",
      "PostDate": "2016-05-04T09:30:27+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "42613",
      "UserId": 0,
      "Username": "The Pixie",
      "UserAvatar": null,
      "UserGravatar": "cfa37e927f96177bcf6053ae8f108f77",
      "EditableText": "Cool.\n\nHow much are you planning to translate? All the editor text is in CombatTabs, so that would be a good starting point. Text the player will see is scattered about a bit. I would do a search across all the files for [i:vps8jts4]msg[/i:vps8jts4] and go from there. As far as I know, that is as far as Quest goes in translations. Would you want to translate attribute, function and type names too? That is where you will be breaking tests.",
      "EditableFormat": "bbcode",
      "HTML": "Cool.<br/><br/>How much are you planning to translate? All the editor text is in CombatTabs, so that would be a good starting point. Text the player will see is scattered about a bit. I would do a search across all the files for <span style=\"font-style:italic;\">msg</span> and go from there. As far as I know, that is as far as Quest goes in translations. Would you want to translate attribute, function and type names too? That is where you will be breaking tests.",
      "PostDate": "2016-05-04T10:33:16+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "42614",
      "UserId": 0,
      "Username": "thierry_st_malo",
      "UserAvatar": null,
      "UserGravatar": "dd4d3ca1b00054d0f534c5a12491d74c",
      "EditableText": "What am I planning to translate ? What is necessary to play a game, but nothing else. Being lazy, I am not very much interested in your library's inner logic. So, to figure out what I need to do, I am creating a first game, a very simple duel between the player and his mortal enemy. I'll try to translate whatever English text appears on the screen during the game. That should give me a good starting point, I think. If you don't mind I'll keep you aware.\nThanks for your help,\nThierry",
      "EditableFormat": "bbcode",
      "HTML": "What am I planning to translate ? What is necessary to play a game, but nothing else. Being lazy, I am not very much interested in your library's inner logic. So, to figure out what I need to do, I am creating a first game, a very simple duel between the player and his mortal enemy. I'll try to translate whatever English text appears on the screen during the game. That should give me a good starting point, I think. If you don't mind I'll keep you aware.<br/>Thanks for your help,<br/>Thierry",
      "PostDate": "2016-05-04T11:21:21+01:00",
      "LastEditDate": null
    }
  ]
}
