{
  "Topic": {
    "TopicId": "cwhoxie-hu2d9fq7ht_rya",
    "ForumId": "10",
    "Title": "Functions",
    "LastUpdated": "2020-06-24T11:12:35.6459879Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "c3fcebbb-d77c-4e34-881c-7ea82267f202",
      "UserId": 340011,
      "Username": "wooterslw",
      "AvatarUrl": "https://secure.gravatar.com/avatar/7d20dd39301d8b9be2be0abaf005968d?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "How do you exit a function prematurely? ",
      "EditableFormat": "markdown",
      "HTML": "<p>How do you exit a function prematurely?</p>\n\n",
      "PostDate": "2020-06-24T11:12:35.6459879Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "e09c621e-cf4c-470e-b487-c28cf21f41b1",
      "UserId": 319917,
      "Username": "mrangel",
      "AvatarUrl": "https://secure.gravatar.com/avatar/?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Either enclose the rest of the function in an `if` block to skip over it, or use a `return`.\r\n\r\nIf I have a function that doesn't actually return anything, I've got into the habit of making its type boolean; put in a `return (true)` at the end and `return (false)` if it exits prematurely. Just in case a circumstance comes up later where I want to know which happened.\r\n\r\nIf the function does have a return value, then it often makes sense to return it as soon as you know it. If you want to break out of a function without knowing the return value (for example, if the function fails for some reason), then you could return `null` or `\"\"` or `-1` depending on the type of the function. An out-of-band value that the code calling the function can check for.",
      "EditableFormat": "markdown",
      "HTML": "<p>Either enclose the rest of the function in an <code>if</code> block to skip over it, or use a <code>return</code>.</p>\n<p>If I have a function that doesn't actually return anything, I've got into the habit of making its type boolean; put in a <code>return (true)</code> at the end and <code>return (false)</code> if it exits prematurely. Just in case a circumstance comes up later where I want to know which happened.</p>\n<p>If the function does have a return value, then it often makes sense to return it as soon as you know it. If you want to break out of a function without knowing the return value (for example, if the function fails for some reason), then you could return <code>null</code> or <code>\"\"</code> or <code>-1</code> depending on the type of the function. An out-of-band value that the code calling the function can check for.</p>\n\n",
      "PostDate": "2020-06-24T11:36:23.7040962Z",
      "LastEditDate": null,
      "link": null
    }
  ]
}
