{
  "Topic": {
    "TopicId": "fgvrpspccuoysn5ifrpdjq",
    "ForumId": "10",
    "Title": "Change description",
    "LastUpdated": "2020-07-09T05:20:34.8122646Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "20b076bb-e826-4a52-8d87-38606f160058",
      "UserId": 491072,
      "Username": "LenaLoyd",
      "AvatarUrl": "https://secure.gravatar.com/avatar/56e83e3b0e10803e25d08a574d773e66?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "**Most Frequently Asked Questions About the Best Vacuum Cleaners: 2020 Revisit**\r\n\r\n**Even though everyone knows how to use vacuum cleaners, the fact that a good vacuum cleaner is so simple to use for a lot of people can easily make us forget that they are sophisticated machines. Here at the editorial, we have received a lot of questions from the readership regarding some details about the best vacuum cleaners.**\r\n\r\nIn this article, we will be discussing all of these questions in detail with the hope that the article will help you understand your machine a little bit better.\r\n\r\n**✿✿✿ Selected For You:** [**Best Vacuum Cleaners Reviews**](https://subscribe.ru/group/steve-blog/17497548/)\r\n\r\n**Which Type of Vacuum Cleaner is Better for Allergy Sufferers?**\r\n\r\nIf your household has **allergy sufferers**, we highly recommend you to look into **bagged vacuums**. The bags will keep all of the dust and the allergens from leaking out into the air, unlike bagless vacuums which could leak all of these harmful materials out into the atmosphere if were improperly sealed.\r\n\r\n![](https://imgur.com/WNw5xkj.jpg)\r\n\r\nHowever, do keep in mind that not all of the bags are the same as one another. Paper bags in older-style vacuums have pores that microscopic dusts and allergens could leak out from. You should look into brands with high level filtration systems like **HEPA filters** such as **Black Decker**, Miele, Electrolux etc.\r\n\r\nBut while **bagged vacuums** certainly are an obvious solution, they can be expensive to operate since you have to replace the bags every once in a while. This is where the [**best vacuum cleaners in the world**](https://www.bmwmotos.com/foro/threads/best-vacuum-cleaners-on-the-market.530960/) that are bagless come in. Great vacuums such as **Shark Navigator Lift** and Dyson offer allergen seals and **HEPA filters**, which allow you to cleanly dispose of all of the dirt that was sucked up hygienic and safe. Of course, there is still a smidgen of risk involved, so if you get a bagless vacuum we recommend wearing an allergy mask while disposing of the dust cup’s contents.\r\n\r\n**Is It True That the More Powerful the Motor, the Higher the Suction Power?**\r\n\r\nIt’s common sense, after all, right? The more amperage the vacuum’s motor has, the more **suction power** it can generate.\r\n\r\nWell … not really. **Suction power** isn’t really determined by the motor’s power. Rather it is the design of the vacuum, the filtration system, and the air flow. The latter is especially important. Air flow is measured by cubic feet per minute (CFM). The higher the CFM of the vacuum, the greater its **suction power**. This is the measurement that you should be looking out for on the specification sheet, not your motor’s amperage.\r\n\r\nIf you’re looking into a Dyson vacuum, however, the company uses a different measurement called airwatts, which is a traditional unit that’s used to calculate fluid flow. A couple other manufacturers have also taken up the measurement unit, as well.\r\n\r\n![](https://imgur.com/s4zKM0X.jpg)\r\n\r\n**Turbobrush vs Powerbrush?**\r\n\r\nWhile both of these **brush rolls** may sound similar, they are actually not. A turbobrush is powered by air while the powerbrush often has an independent motor integrated within to drive the brush (or it can just draw power from the vacuum’s motor.) Powerbrush is a tad bit stronger in **suction power** and is generally less efficient to use on carpets.\r\n\r\n**۞۞۞ Check This Out:** [**Top 10 vacuum cleaners**](https://www.linkedin.com/showcase/best-vacuum-cleaner-in-the-world-reviews/)\r\n\r\n**Conclusion**\r\n\r\nEnding this short FAQ article, we hope that you have discovered a few new things about your **best rated vacuum**! If you have any other questions that you would like us to answer, the editorial team’s inbox is always open to you and we will publish it in the next issue in our FAQ series.\r\n\r\nHappy shopping!",
      "EditableFormat": "markdown",
      "HTML": "<p><strong>Most Frequently Asked Questions About the Best Vacuum Cleaners: 2020 Revisit</strong></p>\n<p><strong>Even though everyone knows how to use vacuum cleaners, the fact that a good vacuum cleaner is so simple to use for a lot of people can easily make us forget that they are sophisticated machines. Here at the editorial, we have received a lot of questions from the readership regarding some details about the best vacuum cleaners.</strong></p>\n<p>In this article, we will be discussing all of these questions in detail with the hope that the article will help you understand your machine a little bit better.</p>\n<p><strong>✿✿✿ Selected For You:</strong>&nbsp;<a href=\"https://subscribe.ru/group/steve-blog/17497548/\"><strong>Best Vacuum Cleaners Reviews</strong></a></p>\n<p><strong>Which Type of Vacuum Cleaner is Better for Allergy Sufferers?</strong></p>\n<p>If your household has <strong>allergy sufferers</strong>, we highly recommend you to look into <strong>bagged vacuums</strong>. The bags will keep all of the dust and the allergens from leaking out into the air, unlike bagless vacuums which could leak all of these harmful materials out into the atmosphere if were improperly sealed.</p>\n<p><img src=\"https://imgur.com/WNw5xkj.jpg\" alt=\"\"></p>\n<p>However, do keep in mind that not all of the bags are the same as one another. Paper bags in older-style vacuums have pores that microscopic dusts and allergens could leak out from. You should look into brands with high level filtration systems like <strong>HEPA filters</strong> such as <strong>Black Decker</strong>, Miele, Electrolux etc.</p>\n<p>But while <strong>bagged vacuums</strong> certainly are an obvious solution, they can be expensive to operate since you have to replace the bags every once in a while. This is where the <a href=\"https://www.bmwmotos.com/foro/threads/best-vacuum-cleaners-on-the-market.530960/\"><strong>best vacuum cleaners in the world</strong></a>&nbsp;that are bagless come in. Great vacuums such as <strong>Shark Navigator Lift</strong> and Dyson offer allergen seals and <strong>HEPA filters</strong>, which allow you to cleanly dispose of all of the dirt that was sucked up hygienic and safe. Of course, there is still a smidgen of risk involved, so if you get a bagless vacuum we recommend wearing an allergy mask while disposing of the dust cup’s contents.</p>\n<p><strong>Is It True That the More Powerful the Motor, the Higher the Suction Power?</strong></p>\n<p>It’s common sense, after all, right? The more amperage the vacuum’s motor has, the more <strong>suction power</strong> it can generate.</p>\n<p>Well … not really. <strong>Suction power</strong> isn’t really determined by the motor’s power. Rather it is the design of the vacuum, the filtration system, and the air flow. The latter is especially important. Air flow is measured by cubic feet per minute (CFM). The higher the CFM of the vacuum, the greater its <strong>suction power</strong>. This is the measurement that you should be looking out for on the specification sheet, not your motor’s amperage.</p>\n<p>If you’re looking into a Dyson vacuum, however, the company uses a different measurement called airwatts, which is a traditional unit that’s used to calculate fluid flow. A couple other manufacturers have also taken up the measurement unit, as well.</p>\n<p><img src=\"https://imgur.com/s4zKM0X.jpg\" alt=\"\"></p>\n<p><strong>Turbobrush vs Powerbrush?</strong></p>\n<p>While both of these <strong>brush rolls</strong> may sound similar, they are actually not. A turbobrush is powered by air while the powerbrush often has an independent motor integrated within to drive the brush (or it can just draw power from the vacuum’s motor.) Powerbrush is a tad bit stronger in <strong>suction power</strong> and is generally less efficient to use on carpets.</p>\n<p><strong>۞۞۞ Check This Out:</strong>&nbsp;<a href=\"https://www.linkedin.com/showcase/best-vacuum-cleaner-in-the-world-reviews/\"><strong>Top 10 vacuum cleaners</strong></a></p>\n<p><strong>Conclusion</strong></p>\n<p>Ending this short FAQ article, we hope that you have discovered a few new things about your <strong>best rated vacuum</strong>! If you have any other questions that you would like us to answer, the editorial team’s inbox is always open to you and we will publish it in the next issue in our FAQ series.</p>\n<p>Happy shopping!</p>\n\n",
      "PostDate": "2020-07-09T05:20:34.8122646Z",
      "LastEditDate": "2023-05-25T08:41:07.7523955Z",
      "link": null
    },
    {
      "PostId": "38f9215a-26a6-4d7c-ad0d-722135db57dd",
      "UserId": 319917,
      "Username": "mrangel",
      "AvatarUrl": "https://secure.gravatar.com/avatar/?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "In this case you don't need to change the description. You can set a description that displays different text the first time it is shown using text processor directives.\r\n\r\nWithin any text that is sent to the output, you can include something like `{once:This text will only appear the first time}{notfirst:This text won't appear the first time}`\r\n\r\nFor example, an NPC's description might be:\r\n```\r\n{once:A skinny old man leans against the fence. }He's chewing a piece of straw. He {notfirst:still }looks angry.\r\n```\r\n\r\nThe first time you look at him, it would say \"A skinny old man leans against the fence. He's chewing a piece of straw. He looks angry.\", and the second and subsequent times you look, it will say \"He's chewing a piece of straw. He still looks angry.\"\r\n\r\n<hr />\r\n\r\nIf you decide that you do want to change someone's description after a certain event, you would use a command something like:\r\n```\r\njohn.look = \"John has a bandage wrapped around his head where you hit him, and he looks even angrier than before.\"\r\n```\r\nThe `look` attribute stores the description for when you look at an object, and you can set it to either a script or a string. You can also include text processor directives inside the description.\r\n\r\nThis method is more efficient than using text processor commands, but if you want to change a description based on more than one condition, the text processor can make your code a lot easier to manage.",
      "EditableFormat": "markdown",
      "HTML": "<p>In this case you don't need to change the description. You can set a description that displays different text the first time it is shown using text processor directives.</p>\n<p>Within any text that is sent to the output, you can include something like <code>{once:This text will only appear the first time}{notfirst:This text won't appear the first time}</code></p>\n<p>For example, an NPC's description might be:</p>\n<pre><code>{once:A skinny old man leans against the fence. }He's chewing a piece of straw. He {notfirst:still }looks angry.\n</code></pre>\n<p>The first time you look at him, it would say \"A skinny old man leans against the fence. He's chewing a piece of straw. He looks angry.\", and the second and subsequent times you look, it will say \"He's chewing a piece of straw. He still looks angry.\"</p>\n<hr>\n<p>If you decide that you do want to change someone's description after a certain event, you would use a command something like:</p>\n<pre><code>john.look = \"John has a bandage wrapped around his head where you hit him, and he looks even angrier than before.\"\n</code></pre>\n<p>The <code>look</code> attribute stores the description for when you look at an object, and you can set it to either a script or a string. You can also include text processor directives inside the description.</p>\n<p>This method is more efficient than using text processor commands, but if you want to change a description based on more than one condition, the text processor can make your code a lot easier to manage.</p>\n\n",
      "PostDate": "2020-07-09T09:36:56.1537818Z",
      "LastEditDate": null,
      "link": null
    }
  ]
}
