{
  "Topic": {
    "TopicId": "mifjphpcrk_kgey5abts2g",
    "ForumId": "10",
    "Title": "Any Limits of the desktop version of Quest",
    "LastUpdated": "2020-02-04T05:42:54.3266709Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "a1d7ba12-3eca-425b-85da-a30edb1912c6",
      "UserId": 454326,
      "Username": "Brian5757",
      "AvatarUrl": "https://secure.gravatar.com/avatar/411c3e8cd4782d4a996f292940a61069?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "In the past for some text adventure creators there has been limits to the number of rooms, locations etc that can be created, so I'm wondering if Quest has any limitation. For example can you create an adventure with 500 rooms, you could end out with this many rooms if you were in a maze or explored 20 building with each building  containing 25 rooms.  Also you could have a lot of objects if some objects were an alternative to the main object (caveman, angry caveman, sleeping caveman, book, partly  burnt book, etc.\r\n\r\nBrian",
      "EditableFormat": "markdown",
      "HTML": "<p>In the past for some text adventure creators there has been limits to the number of rooms, locations etc that can be created, so I'm wondering if Quest has any limitation. For example can you create an adventure with 500 rooms, you could end out with this many rooms if you were in a maze or explored 20 building with each building  containing 25 rooms.  Also you could have a lot of objects if some objects were an alternative to the main object (caveman, angry caveman, sleeping caveman, book, partly  burnt book, etc.</p>\n<p>Brian</p>\n\n",
      "PostDate": "2020-02-04T05:42:54.3266709Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "e349ecca-e0ec-45ba-a524-18e257c426f5",
      "UserId": 319917,
      "Username": "mrangel",
      "AvatarUrl": "https://secure.gravatar.com/avatar/?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "I don't think there's an actual limit, but maintaining the object list could theoretically slow a ghame down.\r\n\r\nA lot of functions (including those used in the core) work by looping over the list of all objects and checking if they're in the room we're interested in. Even just a command like \"north\" involves looping over *every* exit in the game, until one is found that's both in the current room and whose alias matches what the player typed. This could become slow with large numbers of objects (although I would expect to have tens of thousands of objects in a game before this becomes noticeable).\r\n\r\nThere may also be a limit on the memory available to the Quest interpreter. \"Out of memory\" errors are less common on a modern computer, but still theoretically possible. I'm not sure if there's some arbitrary limit to the number of objects, or to the memory allocated for them. But if there isn't, there would come a point where your computer starts relying on virtual memory, which given the way Quest is designed would be incredibly slow.\r\n\r\nSo… there might be a limit, but it's certainly not on a scale of hundreds of objects. I suspect the editor might start running slow sooner than a game being played does, bit I'd still expect it to be thousands of objects, if not tens of thousands.",
      "EditableFormat": "markdown",
      "HTML": "<p>I don't think there's an actual limit, but maintaining the object list could theoretically slow a ghame down.</p>\n<p>A lot of functions (including those used in the core) work by looping over the list of all objects and checking if they're in the room we're interested in. Even just a command like \"north\" involves looping over <em>every</em> exit in the game, until one is found that's both in the current room and whose alias matches what the player typed. This could become slow with large numbers of objects (although I would expect to have tens of thousands of objects in a game before this becomes noticeable).</p>\n<p>There may also be a limit on the memory available to the Quest interpreter. \"Out of memory\" errors are less common on a modern computer, but still theoretically possible. I'm not sure if there's some arbitrary limit to the number of objects, or to the memory allocated for them. But if there isn't, there would come a point where your computer starts relying on virtual memory, which given the way Quest is designed would be incredibly slow.</p>\n<p>So… there might be a limit, but it's certainly not on a scale of hundreds of objects. I suspect the editor might start running slow sooner than a game being played does, bit I'd still expect it to be thousands of objects, if not tens of thousands.</p>\n\n",
      "PostDate": "2020-02-04T09:27:27.1860798Z",
      "LastEditDate": null,
      "link": null
    }
  ]
}
