{
  "Topic": {
    "TopicId": "u1vup8i1ke_o2crmp72gna",
    "ForumId": "10",
    "Title": "beta-Testing Quest 5.7",
    "LastUpdated": "2017-06-14T11:52:54.069164Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "afad77e6-5446-4521-b355-346190db28b0",
      "UserId": 1346,
      "Username": "The Pixie",
      "AvatarUrl": "https://secure.gravatar.com/avatar/cfa37e927f96177bcf6053ae8f108f77?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "If anyone is interested in beta-testing the next version of Quest, please PM me, and I will give you a link you can download it from. This is only for users of the desktop version (ultimately t will be available for all).\r\n\r\nGames created with Quest 5.6 will work fine in Quest 5.7. Games created in Quest 5.7 will work fine on the existing 5.6 web player, with the exception of the new user interface features on the _Display_ and _Interface_ tabs (please look at the features to see what will be possible eventually, just do not use them in a game you plan to release any time soon).\r\n\r\nI am hoping Quest 5.7 will be out properly soon, but I am waiting for the guys running the web site and web player to work out what they need to do. We might as well use this time to find bugs!\r\n",
      "EditableFormat": "markdown",
      "HTML": "<p>If anyone is interested in beta-testing the next version of Quest, please PM me, and I will give you a link you can download it from. This is only for users of the desktop version (ultimately t will be available for all).</p>\n<p>Games created with Quest 5.6 will work fine in Quest 5.7. Games created in Quest 5.7 will work fine on the existing 5.6 web player, with the exception of the new user interface features on the <em>Display</em> and <em>Interface</em> tabs (please look at the features to see what will be possible eventually, just do not use them in a game you plan to release any time soon).</p>\n<p>I am hoping Quest 5.7 will be out properly soon, but I am waiting for the guys running the web site and web player to work out what they need to do. We might as well use this time to find bugs!</p>\n\n",
      "PostDate": "2017-06-14T11:52:54.069164Z",
      "LastEditDate": null,
      "link": null
    }
  ]
}
