{
  "Topic": {
    "TopicId": "0saufc0vpe6w3dktfsvkeg",
    "ForumId": "24",
    "Title": "Custom CSS Persistance Problem",
    "LastUpdated": "2016-07-20T21:47:25.7922467Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "40cef719-3b3a-47eb-912d-943c704dee3b",
      "UserId": 253656,
      "Username": "thomasjacobjr",
      "AvatarUrl": "https://secure.gravatar.com/avatar/021307c3d6c5ba510b44f5e073af81ad?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Greetings all! I am new to Squiffy and programming in general, and I am attempting to create my first Squiffy story using the command line on my Mac. I am using the Atom editor and have a small directory containing my `index.html`,  `story.js`, `style.css`,  `jquery.min.js`, and main squiffy text file. \r\n\r\nMy issue is this -- every time I restart my server to update the changes I have made to my main squiffy text file, my CSS file reverts back to its default state. I would like to integrate some styling to my game, including new background colors, different text fonts, etc.., but it has become cumbersome to update my `style.css` file constantly. \r\n\r\nHow do I persist my changes to the main `style.css` file so I can continue to edit and update my main squiffy text file without losing my style changes? \r\n\r\nMuch appreciated!\r\n\r\n~TJ ",
      "EditableFormat": "markdown",
      "HTML": "<p>Greetings all! I am new to Squiffy and programming in general, and I am attempting to create my first Squiffy story using the command line on my Mac. I am using the Atom editor and have a small directory containing my <code>index.html</code>,  <code>story.js</code>, <code>style.css</code>,  <code>jquery.min.js</code>, and main squiffy text file.</p>\n<p>My issue is this -- every time I restart my server to update the changes I have made to my main squiffy text file, my CSS file reverts back to its default state. I would like to integrate some styling to my game, including new background colors, different text fonts, etc.., but it has become cumbersome to update my <code>style.css</code> file constantly.</p>\n<p>How do I persist my changes to the main <code>style.css</code> file so I can continue to edit and update my main squiffy text file without losing my style changes?</p>\n<p>Much appreciated!</p>\n<p>~TJ</p>\n\n",
      "PostDate": "2016-07-20T21:47:25.7922467Z",
      "LastEditDate": null
    },
    {
      "PostId": "3c5366f7-c0c6-4884-8d78-86db4e5ef94a",
      "UserId": 176750,
      "Username": "alice-blue",
      "AvatarUrl": "https://secure.gravatar.com/avatar/4499e85f6b9744622fe437b185b6fba6?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "There may be a \"proper\" way to do this and if so, hopefully someone will chime in, but what I've been doing to save time is this:\r\n\r\n1. Rename the **style.css** file (for instance, change it to **customstyle.css**).\r\n2. Open the **index.html** file in a text editor, search for **style.css** and replace it with **customstyle.css** (or whatever name you've used for the css file).\r\n3. Rename **index.html** to something else (for instance, **newindex.html**).\r\n\r\nNow when you release a new version of your Squiffy story, new default **style.css** and **index.html** files will appear in your folder, but **customstyle.css** and **newindex.html** should remain untouched. You can just ignore **style.css** and **index.html** and use your custom files instead while you are working on the game.\r\n\r\nWhen you're finished your game, you can--if you want--delete the default **style.css** and **index.html** files, and then change the names of your custom files back to the original names.",
      "EditableFormat": "markdown",
      "HTML": "<p>There may be a \"proper\" way to do this and if so, hopefully someone will chime in, but what I've been doing to save time is this:</p>\n<ol>\n<li>Rename the <strong>style.css</strong> file (for instance, change it to <strong>customstyle.css</strong>).</li>\n<li>Open the <strong>index.html</strong> file in a text editor, search for <strong>style.css</strong> and replace it with <strong>customstyle.css</strong> (or whatever name you've used for the css file).</li>\n<li>Rename <strong>index.html</strong> to something else (for instance, <strong>newindex.html</strong>).</li>\n</ol>\n<p>Now when you release a new version of your Squiffy story, new default <strong>style.css</strong> and <strong>index.html</strong> files will appear in your folder, but <strong>customstyle.css</strong> and <strong>newindex.html</strong> should remain untouched. You can just ignore <strong>style.css</strong> and <strong>index.html</strong> and use your custom files instead while you are working on the game.</p>\n<p>When you're finished your game, you can--if you want--delete the default <strong>style.css</strong> and <strong>index.html</strong> files, and then change the names of your custom files back to the original names.</p>\n\n",
      "PostDate": "2016-07-21T00:26:58.3430204Z",
      "LastEditDate": "2016-07-21T00:30:50.013673Z"
    },
    {
      "PostId": "7d9d4039-157f-44f1-8dd7-af03b8c0c6bc",
      "UserId": 238189,
      "Username": "birddeckz",
      "AvatarUrl": "https://graph.facebook.com/10209338403484969/picture?width=80&height=80",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "i think you need to create copy of ```index.html``` and ```styles.css``` and rename it into ```index.template.html``` and ```styles.template.css``` keep it in the game folder , so every time you build it will create the css file from the template files, you only need to edit the ```styles.template.css```  and all the changes you made there will be made into the ```styles.css``` when you build automatically. ",
      "EditableFormat": "markdown",
      "HTML": "<p>i think you need to create copy of <code>index.html</code> and <code>styles.css</code> and rename it into <code>index.template.html</code> and <code>styles.template.css</code> keep it in the game folder , so every time you build it will create the css file from the template files, you only need to edit the <code>styles.template.css</code>  and all the changes you made there will be made into the <code>styles.css</code> when you build automatically.</p>\n\n",
      "PostDate": "2016-07-22T06:40:25.5273362Z",
      "LastEditDate": null
    },
    {
      "PostId": "d5356aab-6d7d-499e-aff6-762f17f48c72",
      "UserId": 253656,
      "Username": "thomasjacobjr",
      "AvatarUrl": "https://secure.gravatar.com/avatar/021307c3d6c5ba510b44f5e073af81ad?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Thank you both for your input! I will experiment with both methods :-) \r\n\r\nEdit: For others wondering the same thing, it appears that both methods work. I have duplicated my `style.css`in the same directory and renamed the copy `style.template.css`, and it now seems that any changes I make to the CSS (for example I have included a neat background gradient and a new font) are persisted while I make changes to my master squiffy file using the app itself.",
      "EditableFormat": "markdown",
      "HTML": "<p>Thank you both for your input! I will experiment with both methods :-)</p>\n<p>Edit: For others wondering the same thing, it appears that both methods work. I have duplicated my <code>style.css</code>in the same directory and renamed the copy <code>style.template.css</code>, and it now seems that any changes I make to the CSS (for example I have included a neat background gradient and a new font) are persisted while I make changes to my master squiffy file using the app itself.</p>\n\n",
      "PostDate": "2016-07-26T02:15:19.13715Z",
      "LastEditDate": "2016-07-26T02:35:52.7709798Z"
    }
  ]
}
