{
  "Topic": {
    "TopicId": "tfzxn49axuixpkekqfftgq",
    "ForumId": "24",
    "Title": "SyntaxError: Expected ';'",
    "LastUpdated": "2017-12-31T16:33:41.2021456Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "3ea1676a-902f-4527-bd21-921519a72a6b",
      "UserId": 275370,
      "Username": "Tom_Clement",
      "AvatarUrl": "https://secure.gravatar.com/avatar/a9cc03629c2eca096b46a086cca03734?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "I have recently completed writing a text game using Squiffy, but every time I try and run the game it appears with the phrase, \"SyntaxError: Expected ';'\". Whenever I try and preview the game I just get a blank page. I'm running off the browser version of Squiffy i.e. have not downloaded any version. My three other Squiffy games still work fine even after editing them today, just not this most recent one. Does anyone know why? Should I supply my code in another post?",
      "EditableFormat": "markdown",
      "HTML": "<p>I have recently completed writing a text game using Squiffy, but every time I try and run the game it appears with the phrase, \"SyntaxError: Expected ';'\". Whenever I try and preview the game I just get a blank page. I'm running off the browser version of Squiffy i.e. have not downloaded any version. My three other Squiffy games still work fine even after editing them today, just not this most recent one. Does anyone know why? Should I supply my code in another post?</p>\n\n",
      "PostDate": "2017-12-31T16:33:41.2021456Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "b4a089b7-917a-426f-a1b5-c6f13c5c9cfb",
      "UserId": 318253,
      "Username": "K.V.",
      "AvatarUrl": "https://i.imgur.com/3s3Ekp2b.png",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Sounds like you're missing a ```;```.\r\n\r\nPost the code, and we'll check it out and get you going.",
      "EditableFormat": "markdown",
      "HTML": "<p>Sounds like you're missing a <code>;</code>.</p>\n<p>Post the code, and we'll check it out and get you going.</p>\n\n",
      "PostDate": "2017-12-31T16:42:27.7076797Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "0b719e8f-d49d-4def-ab87-bfb51ab79f37",
      "UserId": 275370,
      "Username": "Tom_Clement",
      "AvatarUrl": "https://secure.gravatar.com/avatar/a9cc03629c2eca096b46a086cca03734?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "I tried posting my code but it keeps saying \"Sorry, you can't post that here.\" Is there meant to be a ; used now in some part of the code? I've written the game like all the other ones so I don't know why this one isn't working. Thanks for helping me solve this :)",
      "EditableFormat": "markdown",
      "HTML": "<p>I tried posting my code but it keeps saying \"Sorry, you can't post that here.\" Is there meant to be a ; used now in some part of the code? I've written the game like all the other ones so I don't know why this one isn't working. Thanks for helping me solve this :)</p>\n\n",
      "PostDate": "2017-12-31T23:36:46.3812566Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "937b37b7-4274-435b-a731-39dd7e5da226",
      "UserId": 275370,
      "Username": "Tom_Clement",
      "AvatarUrl": "https://secure.gravatar.com/avatar/a9cc03629c2eca096b46a086cca03734?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "@title Heroes and Monsters: Perseus and Medusa\r\n\r\nWelcome young heroes and heroines to the world of Ancient Greece! Together, we shall explore the land of Greece and it's many islands and cities, searching for the most extraordinary of stories, featuring both triumphs of gods and men. From the frenzied deserts of Troy to the shores of Crete, to the woodlands of Thrace and the blinding white marble of Athens, we shall experience some of greatest folk tales ever told! \r\n\r\n[[We await your commands]].\r\n\r\n[[We await your commands]]:\r\n\r\nThen let us begin!\r\n\r\nWhile our story today concerns Perseus, fabled prince of [Argos], our story does not start with him. Instead, we must look to his grandfather, King Acrisius, to start this tale.\r\n\r\nKing Acrisius had offended the gods by being stern and cold, and in turn the gods had placed a curse on him, that one day he would be killed by his own grandson. Fearful of this prophecy, Acrisius locked his only daughter, Danae, in a tower in their palace, to stop her from ever presenting an heir.\r\n\r\nThe gods, angry that Acrisius was trying to meddle in their plans, hatched a scheme. They sent [Zeus], king of all the gods, to visit Danae, and make her pregnant, producing an heir to kill Acrisius.\r\n\r\n[[Continue]].\r\n\r\n[Argos]:\r\n\r\nGeography: Argos is a city in Argolis in the Peloponnese region in southern Greece. It is not to be confused with Argos, the shipwright of the Argo in the story of Jason and the Argonauts.\r\n\r\n[Zues]:\r\n\r\nMythology: Zeus is the king of all the gods and resides on Mount Olympus with his wife Hera. He is well known for fathering several children with mortal women, much to Hera's annoyance. He is represented by lightning bolts.\r\n\r\n[[Continue]]:\r\n\r\nOnce Acrisius found out that Danae had produced a son that in time would kill him, he tried to get rid of the child. He could not bring himself to kill his own family, so instead he dragged his daughter and baby grandson to the harbour and threw them onto a boat, before pushing it out onto the waves, letting it drift away into the raging sea.\r\n\r\nDanae held onto her baby, praying to the gods to save her. The gods, not wanting to be out-played by a mortal king, combined their efforts to save Danae and Perseus.\r\n\r\nThe [Anemoi] blew incoming storms away and [Poseidon] calmed the sea, guiding the boat safely to a far away kingdom, where Acrisius could not be tempted to send a solider to finish the job.\r\n\r\n[[Continue.]]\r\n\r\n[Anemoi]:\r\n\r\nMythology: The Anemoi are the wind gods, each one a particular direction. They were Boreas, the north and winter wind, Zephyrus, the west and spring wind, Notus, the south and summer wind and finally, Eurus, the east and autumn wind.\r\n\r\n[Poseidon]:\r\n\r\nMythology: Poseidon is the god of the seas, earthquakes and the creator of horses. He does not live on Mount Olympus like the other gods, rather he lives under the sea, keeping an eye on his domain. His Roman form in called Neptune.\r\n\r\n[[Continue.]]:\r\n\r\n",
      "EditableFormat": "markdown",
      "HTML": "<p>@title Heroes and Monsters: Perseus and Medusa</p>\n<p>Welcome young heroes and heroines to the world of Ancient Greece! Together, we shall explore the land of Greece and it's many islands and cities, searching for the most extraordinary of stories, featuring both triumphs of gods and men. From the frenzied deserts of Troy to the shores of Crete, to the woodlands of Thrace and the blinding white marble of Athens, we shall experience some of greatest folk tales ever told!</p>\n<p>[[We await your commands]].</p>\n<p>[[We await your commands]]:</p>\n<p>Then let us begin!</p>\n<p>While our story today concerns Perseus, fabled prince of [Argos], our story does not start with him. Instead, we must look to his grandfather, King Acrisius, to start this tale.</p>\n<p>King Acrisius had offended the gods by being stern and cold, and in turn the gods had placed a curse on him, that one day he would be killed by his own grandson. Fearful of this prophecy, Acrisius locked his only daughter, Danae, in a tower in their palace, to stop her from ever presenting an heir.</p>\n<p>The gods, angry that Acrisius was trying to meddle in their plans, hatched a scheme. They sent [Zeus], king of all the gods, to visit Danae, and make her pregnant, producing an heir to kill Acrisius.</p>\n<p>[[Continue]].</p>\n<p>[Argos]:</p>\n<p>Geography: Argos is a city in Argolis in the Peloponnese region in southern Greece. It is not to be confused with Argos, the shipwright of the Argo in the story of Jason and the Argonauts.</p>\n<p>[Zues]:</p>\n<p>Mythology: Zeus is the king of all the gods and resides on Mount Olympus with his wife Hera. He is well known for fathering several children with mortal women, much to Hera's annoyance. He is represented by lightning bolts.</p>\n<p>[[Continue]]:</p>\n<p>Once Acrisius found out that Danae had produced a son that in time would kill him, he tried to get rid of the child. He could not bring himself to kill his own family, so instead he dragged his daughter and baby grandson to the harbour and threw them onto a boat, before pushing it out onto the waves, letting it drift away into the raging sea.</p>\n<p>Danae held onto her baby, praying to the gods to save her. The gods, not wanting to be out-played by a mortal king, combined their efforts to save Danae and Perseus.</p>\n<p>The [Anemoi] blew incoming storms away and [Poseidon] calmed the sea, guiding the boat safely to a far away kingdom, where Acrisius could not be tempted to send a solider to finish the job.</p>\n<p>[[Continue.]]</p>\n<p>[Anemoi]:</p>\n<p>Mythology: The Anemoi are the wind gods, each one a particular direction. They were Boreas, the north and winter wind, Zephyrus, the west and spring wind, Notus, the south and summer wind and finally, Eurus, the east and autumn wind.</p>\n<p>[Poseidon]:</p>\n<p>Mythology: Poseidon is the god of the seas, earthquakes and the creator of horses. He does not live on Mount Olympus like the other gods, rather he lives under the sea, keeping an eye on his domain. His Roman form in called Neptune.</p>\n<p>[[Continue.]]:</p>\n\n",
      "PostDate": "2018-01-01T14:44:35.8651525Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "127e2913-9206-49f3-b88e-b18a0195f1a2",
      "UserId": 275370,
      "Username": "Tom_Clement",
      "AvatarUrl": "https://secure.gravatar.com/avatar/a9cc03629c2eca096b46a086cca03734?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "The boat carrying Danae and Perseus soon landed safely on the shores of [Seriphos]. A local fishermen, Dictys, could not believe his eyes when the rowing boat gently floated onto the sand. He grabbed the bow and dragged the boat further onto the beach, before helping the woman and her baby out onto land.\r\n\r\nDictys took care of Danae and her son, and soon Perseus grew to be a strong and smart young man. Dictys taught him how to fish both with net and spear, his mother taught him the etiquette of the royal court and he practiced [sports and wrestling] with the other men of the island, honing his fighting skills.\r\n\r\nThe king of Seriphos, Polydectes, eventually heard about the mysterious arrivals to his kingdom; the woman more beautiful than he could imagine and her son, a fearsome athlete. He sent for them to be brought to his palace at once.\r\n\r\n[[Continue...]]\r\n\r\n[Seriphos]:\r\n\r\nGeography: Seriphos (also written as Serifos) is a Greek island in the middle of the Aegean Sea and was ruled over by King Polydectes (also written as Polydektes).\r\n\r\n[sports and wrestling]:\r\n\r\nCulture: Greek culture was heavily steeped in sports, creating such events as the Olympics where men would compete their skills in track and field events. The Greeks also liked to wrestle in a style called Pankration, which translates to \"all powers\", because the sport is no-holds-barred.\r\n\r\n[[Continue...]]:\r\n\r\nDanae and Perseus were brought to Polydectes' palace and were presented to the king. As soon as he set eyes on her, Polydectes fell in love with Danae and made plans to marry her. There was just one problem; Perseus.\r\n\r\nPolydectes knew Perseus was well-known and loved by the islanders and if he killed him the citizens would be in uproar. So Polydectes hatched a plan. He had to rid Perseus if he was to marry Danae.\r\n\r\n\"Perseus, I hear you are an exceptional athlete,\" Polydectes spoke. \"I wish for you to claim a prize for me, to pay for my generosity for allowing you stay in my lands.\"\r\n\r\n\"Anything your majesty,\" Perseus declared.\r\n\r\nPolydectes smiled cruelly before stating, \"I wish for you to collect the head of the [Gorgon Medusa]!\"\r\n\r\n[[Next]].\r\n\r\n[Gorgon Medusa]:\r\n\r\nMythology: The Gorgons were female creatures that had venomous snakes for hair. They could turn anyone who looked directly at their face into stone. Their names comes from the Greek word \"gorgos\", which means dreadful.\r\n\r\n[[Next]]:\r\n\r\nThe royal court gasped in shock. The Gorgons were feared throughout all of Greece and were thought to be immortal. Polydectes was setting Perseus an almost impossible task.\r\n\r\n\"And if I refuse?\" Perseus asked.\r\n\r\n\"Then you will be thrown back into the [sea] from where you came from and I will marry your mother!\" Polydectes roared.\r\n\r\n\"Very well your majesty, I will set off tomorrow to find the Gorgon's head,\" Perseus replied, before turning on his heel and heading back to house to prepare.\r\n\r\n[[Next.]]\r\n\r\n[sea]:\r\n\r\nGeography: The Aegean Sea is the main water mass around the islands of Greece. It is named after King Aegeus, who threw himself into the sea when he thought his son, Theseus, had died. The Aegean was originally known as the Archipelago (which means \"chief sea\"), but the word now means a collection of islands.\r\n\r\n[[Next.]]:\r\n\r\nPerseus was unsure of what he would need for his journey, so he visited the temple to ask the gods for their help. As he prayed, [Athena] appeared before him.\r\n\r\n\"Polydectes has set an impossible task for a mortal,\" Athena said, \"But he does not know you are Zeus' son, and as your siblings, the gods shall help you.\"\r\n\r\nMore of the [pantheon] appeared before Perseus, each offering their services. Ares offered his sword, the strongest of all blades. Hermes offered his winged sandals, so that Perseus may fly with speed to the Gorgon's lair. Apollo gave his shield to protect Perseus and Athena gave her helmet of invisibility, to aid in getting close to the Gorgon.\r\n\r\nPerseus thanked them for their gifts and asked them to watch over his mother while he was away. They agreed, so Perseus sprang into the air on Hermes' sandals and onto Medusa's lair.\r\n\r\n[[Next...]]\r\n\r\n[Athena]:\r\n\r\nAthena is the goddess of Wisdom and War. She sprang already grown and in full battle armour from the top of Zeus' head. She gave the olive tree to the citizens of Athens, hence why the city bears her name.\r\n\r\n[pantheon]:\r\n\r\nMythology: The Pantheon was the council of the Twelve Greek Gods; Zeus, Hera, Poseidon, Ares, Athena, Dionysus, Aphrodite, Apollo, Artemis, Hermes, Hephaestus and Demeter. Between the twelve gods and goddesses, they controlled nearly every facet of human life.\r\n\r\n[[Next...]]:\r\n\r\nHermes' sandals guided themselves towards Medusa's lair, far away from civilization. As he sped on, an [owl] flew next to him. It opened its beak, and from it, the voice of Athena spoke.\r\n\r\n\"Remember Perseus,\" Athena called, \"Never look directly into Medusa's eyes. She has the power to turn men to stone with her gaze. Apollo's shield is reflective, use this to safely see where the Gorgon is. When you attack, aim for her head. She is a strong creature, anything less will not defeat her.\"\r\n\r\nPerseus thanked her for her wisdom and the owl flew away, leaving Perseus alone again. As the sun set and the night drew in, Hermes' sandals began to slow down, until they softly landed Perseus outside a dark cave. Perseus summoned up all of his courage, before pacing one foot in front of the other and...\r\n\r\n...[[entered the cave]].\r\n\r\n[owl]:\r\n\r\nWildlife/Mythology: Owls were the patron animal of the goddess Athena. She is the goddess of Wisdom, hence why owls are sometimes thought of as being wise.\r\n\r\n[[entered the cave]]:\r\n\r\nPerseus stole through the cave, trying to keep his footsteps as quiet as he could. The cave soon became smaller and smaller, until Perseus was crawling on his hands and knees just to fit through the passageway. He continued on until finally, the small passage opened up into an expansive cavern.\r\n\r\nPerseus gasped at the sight before him. Beautiful wall murals, stone columns that reached higher than he could see, a manner of jewels and gold coins strewn across the floor, and many brave warriors, still in their suits of armour, frozen forever in stone. It looked to have been a temple before the hellspawn had made it its home. The Gorgon Medusa lay in the middle of the cavern, sleeping silently surrounded by her horde.\r\n\r\nPerseus began to make his way to her, but did not see a large chest overflowing with coins. As he moved past it, his sandal caught the edge and knocked it over, scattering coins all over the floor. The Gorgon's eyes flickered open, sensing an intrusion in her lair. Perseus hid behind the nearest stone pillar as the Gorgon stood up and began exploring her cave, searching for the intruder.\r\n\r\n[[Tutorial to fight Medusa]].\r\n\r\n[[Tutorial to fight Medusa]]:\r\n\r\n1. Perseus has three objects; his reflective shield to find where Medusa is, his Helmet of Invisibility to move around her, and his sword to deal the killing blow.\r\n\r\n2. Use each one at the correct time to defeat Medusa.\r\n\r\n3. Remember the advice Athena gave Perseus on how to kill Medusa. The Gorgon is dangerous and could easily kill Perseus in one strike.\r\n\r\nGood luck!\r\n\r\n[[Begin the fight]].\r\n\r\n[[Begin the fight]]:\r\n\r\nPerseus could not see Medusa, but could hear her moving around close to the pillar where he hid. What should he do?\r\n\r\n[[Attack with his sword?]]\r\n\r\n[[Use his shield?]]\r\n\r\n[[Put on his helmet?]]\r\n\r\n[[Attack with his sword?]]:\r\n\r\nPerseus drew his sword and turned around the pillar to face the Gorgon. He raised his sword but was immediately stopped in his place by her hideous face. Her grey flabby skin, serpent hair and long, pointed teeth filled Perseus with fear.\r\n\r\nMedusa rounded on Perseus, her eyes locked on his. Perseus tried to move but his legs would not carry him. He looked down to see stone creeping its way up his legs. He cried out in terror as his arms turned to stone, then his eyes, and finally is heart, forever keeping him within Medusa's lair.\r\n\r\n                                YOU DIED\r\n\r\nClick the Restart button at the top of the page and see if you can help Perseus defeat Medusa.\r\n\r\n[[Put on his helmet?]]:\r\n\r\nPerseus decided the best plan was to gain some distance between himself and Medusa, so placed the helmet Athena gave him on his head. As soon as it touched his hair, he became invisible. \r\n\r\nHe turned around the pillar and almost bumped into Medusa, who had heard his fumbling with the helmet and came to investigate. Perseus jumped back, momentarily frightened by the Gorgon, and lost his footing.\r\n\r\nPerseus landed hard on the floor, inadvertently knocking his helmet off. Medusa was surprised at the sudden appearance of the young man in front of her and charged him. Perseus tried to grab the helmet but it was too far out of his reach. He made one last attempt but he was thwarted by Medusa, who leapt on him like a lion and tore him to shreds with her sharp talons.\r\n\r\n                                YOU DIED\r\n\r\nClick the Restart button at the top of the page and see if you can help Perseus defeat Medusa.\r\n\r\n[[Use his shield?]]:\r\n\r\nPerseus readied his shield, but instead of rush the Gorgon, he held it up to reflect what was behind the pillar. He saw the Gorgon, shaking her head from left to right, trying to find the intruder. She hadn't found him yet! Medusa started to make her way towards Perseus' pillar, but as he could see her well in advance, he was able to shift around the pillar and away from her line of sight.\r\n\r\nPerseus moved further away to give him time to plan his next move. What should he do?\r\n\r\n[[Attack with the sword?]]\r\n\r\n[[Sneak up with his Helmet of Invisibility?]]\r\n\r\n[[Attack with the sword?]]:\r\n\r\nPerseus drew his sword and tried to move through the cavern. He was too busy fixated on Medusa, ready to jump away if she turned around, that he bumped into a gold statue holding rare jewels, knocking it over. Perseus tried to fix his error, but the statue came clattering down, the jewels smashing as they hit the floor.\r\n\r\nMedusa wheeled around at the sound, and fixated her gaze upon Perseus. Perseus tried to move but his legs would not carry him. He looked down to see stone creeping its way up his legs. He cried out in terror as his arms turned to stone, then his eyes, and finally is heart, forever keeping him within Medusa's lair.\r\n\r\n                                    YOU DIED\r\n\r\nClick the Restart button at the top of the page and see if you can help Perseus defeat Medusa.",
      "EditableFormat": "markdown",
      "HTML": "<p>The boat carrying Danae and Perseus soon landed safely on the shores of [Seriphos]. A local fishermen, Dictys, could not believe his eyes when the rowing boat gently floated onto the sand. He grabbed the bow and dragged the boat further onto the beach, before helping the woman and her baby out onto land.</p>\n<p>Dictys took care of Danae and her son, and soon Perseus grew to be a strong and smart young man. Dictys taught him how to fish both with net and spear, his mother taught him the etiquette of the royal court and he practiced [sports and wrestling] with the other men of the island, honing his fighting skills.</p>\n<p>The king of Seriphos, Polydectes, eventually heard about the mysterious arrivals to his kingdom; the woman more beautiful than he could imagine and her son, a fearsome athlete. He sent for them to be brought to his palace at once.</p>\n<p>[[Continue...]]</p>\n<p>[Seriphos]:</p>\n<p>Geography: Seriphos (also written as Serifos) is a Greek island in the middle of the Aegean Sea and was ruled over by King Polydectes (also written as Polydektes).</p>\n<p>[sports and wrestling]:</p>\n<p>Culture: Greek culture was heavily steeped in sports, creating such events as the Olympics where men would compete their skills in track and field events. The Greeks also liked to wrestle in a style called Pankration, which translates to \"all powers\", because the sport is no-holds-barred.</p>\n<p>[[Continue...]]:</p>\n<p>Danae and Perseus were brought to Polydectes' palace and were presented to the king. As soon as he set eyes on her, Polydectes fell in love with Danae and made plans to marry her. There was just one problem; Perseus.</p>\n<p>Polydectes knew Perseus was well-known and loved by the islanders and if he killed him the citizens would be in uproar. So Polydectes hatched a plan. He had to rid Perseus if he was to marry Danae.</p>\n<p>\"Perseus, I hear you are an exceptional athlete,\" Polydectes spoke. \"I wish for you to claim a prize for me, to pay for my generosity for allowing you stay in my lands.\"</p>\n<p>\"Anything your majesty,\" Perseus declared.</p>\n<p>Polydectes smiled cruelly before stating, \"I wish for you to collect the head of the [Gorgon Medusa]!\"</p>\n<p>[[Next]].</p>\n<p>[Gorgon Medusa]:</p>\n<p>Mythology: The Gorgons were female creatures that had venomous snakes for hair. They could turn anyone who looked directly at their face into stone. Their names comes from the Greek word \"gorgos\", which means dreadful.</p>\n<p>[[Next]]:</p>\n<p>The royal court gasped in shock. The Gorgons were feared throughout all of Greece and were thought to be immortal. Polydectes was setting Perseus an almost impossible task.</p>\n<p>\"And if I refuse?\" Perseus asked.</p>\n<p>\"Then you will be thrown back into the [sea] from where you came from and I will marry your mother!\" Polydectes roared.</p>\n<p>\"Very well your majesty, I will set off tomorrow to find the Gorgon's head,\" Perseus replied, before turning on his heel and heading back to house to prepare.</p>\n<p>[[Next.]]</p>\n<p>[sea]:</p>\n<p>Geography: The Aegean Sea is the main water mass around the islands of Greece. It is named after King Aegeus, who threw himself into the sea when he thought his son, Theseus, had died. The Aegean was originally known as the Archipelago (which means \"chief sea\"), but the word now means a collection of islands.</p>\n<p>[[Next.]]:</p>\n<p>Perseus was unsure of what he would need for his journey, so he visited the temple to ask the gods for their help. As he prayed, [Athena] appeared before him.</p>\n<p>\"Polydectes has set an impossible task for a mortal,\" Athena said, \"But he does not know you are Zeus' son, and as your siblings, the gods shall help you.\"</p>\n<p>More of the [pantheon] appeared before Perseus, each offering their services. Ares offered his sword, the strongest of all blades. Hermes offered his winged sandals, so that Perseus may fly with speed to the Gorgon's lair. Apollo gave his shield to protect Perseus and Athena gave her helmet of invisibility, to aid in getting close to the Gorgon.</p>\n<p>Perseus thanked them for their gifts and asked them to watch over his mother while he was away. They agreed, so Perseus sprang into the air on Hermes' sandals and onto Medusa's lair.</p>\n<p>[[Next...]]</p>\n<p>[Athena]:</p>\n<p>Athena is the goddess of Wisdom and War. She sprang already grown and in full battle armour from the top of Zeus' head. She gave the olive tree to the citizens of Athens, hence why the city bears her name.</p>\n<p>[pantheon]:</p>\n<p>Mythology: The Pantheon was the council of the Twelve Greek Gods; Zeus, Hera, Poseidon, Ares, Athena, Dionysus, Aphrodite, Apollo, Artemis, Hermes, Hephaestus and Demeter. Between the twelve gods and goddesses, they controlled nearly every facet of human life.</p>\n<p>[[Next...]]:</p>\n<p>Hermes' sandals guided themselves towards Medusa's lair, far away from civilization. As he sped on, an [owl] flew next to him. It opened its beak, and from it, the voice of Athena spoke.</p>\n<p>\"Remember Perseus,\" Athena called, \"Never look directly into Medusa's eyes. She has the power to turn men to stone with her gaze. Apollo's shield is reflective, use this to safely see where the Gorgon is. When you attack, aim for her head. She is a strong creature, anything less will not defeat her.\"</p>\n<p>Perseus thanked her for her wisdom and the owl flew away, leaving Perseus alone again. As the sun set and the night drew in, Hermes' sandals began to slow down, until they softly landed Perseus outside a dark cave. Perseus summoned up all of his courage, before pacing one foot in front of the other and...</p>\n<p>...[[entered the cave]].</p>\n<p>[owl]:</p>\n<p>Wildlife/Mythology: Owls were the patron animal of the goddess Athena. She is the goddess of Wisdom, hence why owls are sometimes thought of as being wise.</p>\n<p>[[entered the cave]]:</p>\n<p>Perseus stole through the cave, trying to keep his footsteps as quiet as he could. The cave soon became smaller and smaller, until Perseus was crawling on his hands and knees just to fit through the passageway. He continued on until finally, the small passage opened up into an expansive cavern.</p>\n<p>Perseus gasped at the sight before him. Beautiful wall murals, stone columns that reached higher than he could see, a manner of jewels and gold coins strewn across the floor, and many brave warriors, still in their suits of armour, frozen forever in stone. It looked to have been a temple before the hellspawn had made it its home. The Gorgon Medusa lay in the middle of the cavern, sleeping silently surrounded by her horde.</p>\n<p>Perseus began to make his way to her, but did not see a large chest overflowing with coins. As he moved past it, his sandal caught the edge and knocked it over, scattering coins all over the floor. The Gorgon's eyes flickered open, sensing an intrusion in her lair. Perseus hid behind the nearest stone pillar as the Gorgon stood up and began exploring her cave, searching for the intruder.</p>\n<p>[[Tutorial to fight Medusa]].</p>\n<p>[[Tutorial to fight Medusa]]:</p>\n<ol>\n<li>\n<p>Perseus has three objects; his reflective shield to find where Medusa is, his Helmet of Invisibility to move around her, and his sword to deal the killing blow.</p>\n</li>\n<li>\n<p>Use each one at the correct time to defeat Medusa.</p>\n</li>\n<li>\n<p>Remember the advice Athena gave Perseus on how to kill Medusa. The Gorgon is dangerous and could easily kill Perseus in one strike.</p>\n</li>\n</ol>\n<p>Good luck!</p>\n<p>[[Begin the fight]].</p>\n<p>[[Begin the fight]]:</p>\n<p>Perseus could not see Medusa, but could hear her moving around close to the pillar where he hid. What should he do?</p>\n<p>[[Attack with his sword?]]</p>\n<p>[[Use his shield?]]</p>\n<p>[[Put on his helmet?]]</p>\n<p>[[Attack with his sword?]]:</p>\n<p>Perseus drew his sword and turned around the pillar to face the Gorgon. He raised his sword but was immediately stopped in his place by her hideous face. Her grey flabby skin, serpent hair and long, pointed teeth filled Perseus with fear.</p>\n<p>Medusa rounded on Perseus, her eyes locked on his. Perseus tried to move but his legs would not carry him. He looked down to see stone creeping its way up his legs. He cried out in terror as his arms turned to stone, then his eyes, and finally is heart, forever keeping him within Medusa's lair.</p>\n<pre><code>                            YOU DIED\n</code></pre>\n<p>Click the Restart button at the top of the page and see if you can help Perseus defeat Medusa.</p>\n<p>[[Put on his helmet?]]:</p>\n<p>Perseus decided the best plan was to gain some distance between himself and Medusa, so placed the helmet Athena gave him on his head. As soon as it touched his hair, he became invisible.</p>\n<p>He turned around the pillar and almost bumped into Medusa, who had heard his fumbling with the helmet and came to investigate. Perseus jumped back, momentarily frightened by the Gorgon, and lost his footing.</p>\n<p>Perseus landed hard on the floor, inadvertently knocking his helmet off. Medusa was surprised at the sudden appearance of the young man in front of her and charged him. Perseus tried to grab the helmet but it was too far out of his reach. He made one last attempt but he was thwarted by Medusa, who leapt on him like a lion and tore him to shreds with her sharp talons.</p>\n<pre><code>                            YOU DIED\n</code></pre>\n<p>Click the Restart button at the top of the page and see if you can help Perseus defeat Medusa.</p>\n<p>[[Use his shield?]]:</p>\n<p>Perseus readied his shield, but instead of rush the Gorgon, he held it up to reflect what was behind the pillar. He saw the Gorgon, shaking her head from left to right, trying to find the intruder. She hadn't found him yet! Medusa started to make her way towards Perseus' pillar, but as he could see her well in advance, he was able to shift around the pillar and away from her line of sight.</p>\n<p>Perseus moved further away to give him time to plan his next move. What should he do?</p>\n<p>[[Attack with the sword?]]</p>\n<p>[[Sneak up with his Helmet of Invisibility?]]</p>\n<p>[[Attack with the sword?]]:</p>\n<p>Perseus drew his sword and tried to move through the cavern. He was too busy fixated on Medusa, ready to jump away if she turned around, that he bumped into a gold statue holding rare jewels, knocking it over. Perseus tried to fix his error, but the statue came clattering down, the jewels smashing as they hit the floor.</p>\n<p>Medusa wheeled around at the sound, and fixated her gaze upon Perseus. Perseus tried to move but his legs would not carry him. He looked down to see stone creeping its way up his legs. He cried out in terror as his arms turned to stone, then his eyes, and finally is heart, forever keeping him within Medusa's lair.</p>\n<pre><code>                                YOU DIED\n</code></pre>\n<p>Click the Restart button at the top of the page and see if you can help Perseus defeat Medusa.</p>\n\n",
      "PostDate": "2018-01-01T14:45:12.342067Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "5bff429f-9cf2-49e9-87a8-969ab004c169",
      "UserId": 275370,
      "Username": "Tom_Clement",
      "AvatarUrl": "https://secure.gravatar.com/avatar/a9cc03629c2eca096b46a086cca03734?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "[[Sneak up with his Helmet of Invisibility?]]:\r\n\r\nPerseus needed to get closer to the Gorgon without her seeing him, so he placed Athena's helmet upon his head, turning him invisible in an instant. Now that he didn't have to watch Medusa at all times in case she turned around, Perseus could focus on making his way through the cavern without disturbing any of the items placed around the room.\r\n\r\nAfter a few tense minutes of crossing and re-crossing across the room, trying not to give his placement away, Perseus found himself at Medusa's back. He drew his sword, ready to strike, but where should he attack?\r\n\r\n[[Her head?]]\r\n\r\n[[Her back?]]\r\n\r\n[[Her leg?]]\r\n\r\n[[Her back]]:\r\n\r\nPerseus raised his sword high in the air, before swinging it down forcefully. Medusa screamed in pain as Perseus drove his sword into her back. She tumbled forwards, away from Perseus. Medusa looked wildly around, trying to find her foe. \r\n\r\nAs Perseus moved closer, Medusa leant down and scooped up a set of coins on the floor in front of her. She threw them hard, scattering them around the room. Perseus could not move out of the way in time and one hit him in the chest. It dropped to the floor, telling Medusa exactly where Perseus was.\r\n\r\nMedusa leapt at the air, swinging her claws, in an attempt to catch him. One swipe caught Perseus across the chest, dropping him to his knees. Even though he was still wearing the Helmet of Invisibility, Medusa had a straight blood trail to follow. Perseus tried to move, but Medusa attacked the pooling blood, killing Perseus within seconds with her powerful talons.\r\n\r\n                                YOU DIED\r\n\r\nClick the Restart button at the top of the page and see if you can help Perseus defeat Medusa.\r\n\r\n[[Her leg?]]:\r\n\r\nPerseus swung low with his sword. He thought if he could cripple the Gorgon, it would be easier to kill her. The sword cleaved Medusa's leg from her body, making her topple over and clatter into one of her stone statues, breaking it in two. She dropped onto her hands and her other leg.\r\n\r\nWhile Perseus thought he would have the advantage against a weaker opponent, Medusa became enraged at the loss of her leg. She moved on all fours like a lion, charging at where the attack came from. Perseus could not move in time and was knocked over by the Gorgon, his helmet flying off and into a dark corner.\r\n\r\nA little winded, Perseus managed to stand, but as he raised his head, he found himself face-to-face with Medusa. She fixated her gaze upon Perseus, slowly turning him into stone. Once his eyes had turned a cold grey, she took another swing at his body, destroying the statue with one swipe of her claw.\r\n\r\n                                YOU DIED\r\n\r\nClick the Restart button at the top of the page and see if you can help Perseus defeat Medusa.\r\n\r\n[[Her head?]]:\r\n\r\nPerseus remembered what Athena said to him before he entered the cave. He raised his sword high into the air, before bringing it down in one strong motion, cleaving Medusa's head from her body. Her torso remained standing for a few seconds, her arms swinging madly about in a vain attempt to kill whoever had beheaded her, but soon her knees gave way and her body fell to the ground.\r\n\r\nFrom the stump of her neck, a small creature arose. A winged horse, dazzlingly white, clambered out of Medusa's body. Its name was Pegasus. The horse stretched its wings, before rearing up onto its hind legs and crashing through the crawlspace Perseus had come through, flying away from the cave it had been birthed in.\r\n\r\nPerseus searched the cavern and found a small sack to place Medusa's head into. Even though her head was separated from her body, her stare could still turn men to stone. He hoisted the sack onto his back and prepared to fly back to Seriphos.\r\n\r\n[[Exit the cave]].\r\n\r\n[[Exit the cave]]:",
      "EditableFormat": "markdown",
      "HTML": "<p>[[Sneak up with his Helmet of Invisibility?]]:</p>\n<p>Perseus needed to get closer to the Gorgon without her seeing him, so he placed Athena's helmet upon his head, turning him invisible in an instant. Now that he didn't have to watch Medusa at all times in case she turned around, Perseus could focus on making his way through the cavern without disturbing any of the items placed around the room.</p>\n<p>After a few tense minutes of crossing and re-crossing across the room, trying not to give his placement away, Perseus found himself at Medusa's back. He drew his sword, ready to strike, but where should he attack?</p>\n<p>[[Her head?]]</p>\n<p>[[Her back?]]</p>\n<p>[[Her leg?]]</p>\n<p>[[Her back]]:</p>\n<p>Perseus raised his sword high in the air, before swinging it down forcefully. Medusa screamed in pain as Perseus drove his sword into her back. She tumbled forwards, away from Perseus. Medusa looked wildly around, trying to find her foe.</p>\n<p>As Perseus moved closer, Medusa leant down and scooped up a set of coins on the floor in front of her. She threw them hard, scattering them around the room. Perseus could not move out of the way in time and one hit him in the chest. It dropped to the floor, telling Medusa exactly where Perseus was.</p>\n<p>Medusa leapt at the air, swinging her claws, in an attempt to catch him. One swipe caught Perseus across the chest, dropping him to his knees. Even though he was still wearing the Helmet of Invisibility, Medusa had a straight blood trail to follow. Perseus tried to move, but Medusa attacked the pooling blood, killing Perseus within seconds with her powerful talons.</p>\n<pre><code>                            YOU DIED\n</code></pre>\n<p>Click the Restart button at the top of the page and see if you can help Perseus defeat Medusa.</p>\n<p>[[Her leg?]]:</p>\n<p>Perseus swung low with his sword. He thought if he could cripple the Gorgon, it would be easier to kill her. The sword cleaved Medusa's leg from her body, making her topple over and clatter into one of her stone statues, breaking it in two. She dropped onto her hands and her other leg.</p>\n<p>While Perseus thought he would have the advantage against a weaker opponent, Medusa became enraged at the loss of her leg. She moved on all fours like a lion, charging at where the attack came from. Perseus could not move in time and was knocked over by the Gorgon, his helmet flying off and into a dark corner.</p>\n<p>A little winded, Perseus managed to stand, but as he raised his head, he found himself face-to-face with Medusa. She fixated her gaze upon Perseus, slowly turning him into stone. Once his eyes had turned a cold grey, she took another swing at his body, destroying the statue with one swipe of her claw.</p>\n<pre><code>                            YOU DIED\n</code></pre>\n<p>Click the Restart button at the top of the page and see if you can help Perseus defeat Medusa.</p>\n<p>[[Her head?]]:</p>\n<p>Perseus remembered what Athena said to him before he entered the cave. He raised his sword high into the air, before bringing it down in one strong motion, cleaving Medusa's head from her body. Her torso remained standing for a few seconds, her arms swinging madly about in a vain attempt to kill whoever had beheaded her, but soon her knees gave way and her body fell to the ground.</p>\n<p>From the stump of her neck, a small creature arose. A winged horse, dazzlingly white, clambered out of Medusa's body. Its name was Pegasus. The horse stretched its wings, before rearing up onto its hind legs and crashing through the crawlspace Perseus had come through, flying away from the cave it had been birthed in.</p>\n<p>Perseus searched the cavern and found a small sack to place Medusa's head into. Even though her head was separated from her body, her stare could still turn men to stone. He hoisted the sack onto his back and prepared to fly back to Seriphos.</p>\n<p>[[Exit the cave]].</p>\n<p>[[Exit the cave]]:</p>\n\n",
      "PostDate": "2018-01-01T14:46:41.8042434Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "73cefb1b-fba2-4c9a-b248-0b04a55a83a6",
      "UserId": 275370,
      "Username": "Tom_Clement",
      "AvatarUrl": "https://secure.gravatar.com/avatar/a9cc03629c2eca096b46a086cca03734?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "As soon as Perseus clambered out of the cave, Hermes' sandals took flight once again, taking him across the mountains and forests, back towards home. As he flew on, he heard a small cry float in on the wind. At first he thought it was a trick on his mind, but then he heard it again, a cry of \"Help!\" followed by a scream.\r\n\r\nHe commanded Hermes' sandals to follow the cry, and soon saw a young woman, stranded on a cliff-face. Below her was the raging sea.\r\n\r\n\"How did you come to be here?\" Perseus called down to the girl.\r\n\r\n\"My father is sacrificing me to Posiedon,\" The girl responded, \"He offended the god of the sea, and he set a sea serpent on our kingdom.\"\r\n\r\nThe girl pointed out to the horizon, and [[Perseus followed her gaze]].\r\n\r\n[[Perseus followed her gaze]]:\r\n\r\nDue to the raging sea it was hard to see anything a first, but then Perseus saw the spinal fins of a sea serpent, heading straight for the girl. He knew he must defeat this creature and save her and her kingdom, wherever it might be.\r\n\r\nPerseus flew high and waited for the serpent to approach the rock. With a crash, the Serpent rose out of the sea, ready to strike at the girl. As soon as Perseus saw that the serpent was about to attack, he swooped down on his flying sandals, and slashed it across the neck with his sword. \r\n\r\nThe serpent hissed in pain, and moved away from the girl and focussed its attacks on Perseus, but every time it would try to bite him, Perseus would just fly higher than it could reach, before swooping down again to continue attacking it with his sword. After many blows, the creature finally fell back into the sea, leaving the kingdom forever.\r\n\r\nPerseus picked up the girl and brought her back [[to her kingdom]].\r\n\r\n[[to her kingdom]]:\r\n\r\nOn the journey back, Perseus found out that her name was Andromeda, and that she was the daughter of King Cepheus of [Aethiopia].\r\n\r\nWhen he returned their daughter, Perseus made an offer to the king.\r\n\r\n\"Your majesty, I am Perseus, son of Zeus and rightful heir to Kingdom of Argos. Please, my I take your daughter to be my bride?\"\r\n\r\nCepheus was glad that his kingdom was safe due to the brave actions of Perseus, so did not even give a moment's hesitation.  Perseus picked Andromeda up and together they took off into the air. After a short flight back, [[they landed in Seriphos]].\r\n\r\n[Aethiopia]:\r\n\r\nGeography: Aethiopia is an ancient region and refers to a section of land of the upper Nile region (where Egypt is situated today), as well as more general areas of the Sahara Desert and the continent of Africa. It is referred to in two other Greek poems, the Iliad and The Odyssey, both written by Homer.\r\n\r\n[[they landed in Seriphos]]:\r\n\r\nPerseus quickly reunited with his mother, and made offerings to the gods at the temple, before marching to the palace. Polydectes was already picking out wedding decorations when Perseus strode through the door, so convinced that the young man could not have completed his task.\r\n\r\n\"So then, young Perseus,\" King Polydectes called out. \"Have you returned with your gift for me?\"\r\n\r\n\"I have,\" shouted Perseus, \"Lay your eyes upon the head of the Gorgon Medusa!\"\r\n\r\nPerseus closed his eyes and ripped the head from the sack on his back, holding it aloft for Polydectes and his court to see. What started as shock and surprise at the reveal of the creatures head soon turned to terror as Polydectes and his aides were turned to stone within an instant. The cruel reign of King Polydectes had ended, and his people were free.\r\n\r\nBut our story does not end here, dear reader. For there is still one prophecy left to [[come true]].\r\n\r\n[[come true]]:\r\n\r\nPerseus, along with his mother, his step-father and his new bride Andromeda, set sail back to Argos, from where he had been cast out as a child, to claim his rightful place within the royal court.\r\n\r\nThe journey was a short one, and as the four departed their boat and set foot on Argos, they realised a sports tournament was being held that day within the city. Perseus, being a man of noble birth and deeds entered into the contest. There was only one field event left, [the discus throw]. Perseus was the last contestant of the day.\r\n\r\nPerseus had trained in the discus throw back on Seriphos, and he knew his throw was straight and true. Just as he predicted, his throw soon surpassed all the other contestants...but the gods had other plans. A gust of wind, one of the many that saved Perseus and his mother when they had been thrown to the sea, hoisted the discus far away from the playing fields.\r\n\r\nIt continued, soaring across the city, [[towards the palace]].\r\n\r\n[discus throw]:\r\n\r\nCulture: The discus throw is sport that was part of the Ancient Olympic Games, in which a competitor throws a heavy disc in an attempt to have thrown it the furthest out of all the competitors.\r\n\r\n[[towards the palace]]:\r\n\r\nKing Acrisius stood from his balcony in his palace, surveying his city from the highest point on the island. He did not see the discus, thrown from many miles away, heading straight towards him. One final breath of air guided the discus down, hitting Arcisius on his ankle, tripping him. He fell the floor, and the sudden shock killed him instantly.\r\n\r\nThe gods had finally come true on their promise that Acrisius' grandson, Perseus, would kill his grandfather. Perseus would only find out when he and his mother arrived at the palace looking for their kin. While he was saddened at his grandfather's death, Perseus soon took to the throne alongside his bride Andromeda, and ruled Argos for many years.\r\n\r\n[[End]].\r\n\r\n[[End]]:\r\n\r\n                                    GAME OVER\r\n\r\nIf you're reading this then well done, you made it! You successfully took on the Gorgon Medusa, defeating her and rightfully restored Perseus to his throne. \r\n\r\nThank you for playing this instalment of Heroes And Monsters. Check out our other stories inspired by Greek Mythology, as well as titles outside the Heroes and Monsters collection.\r\n\r\n",
      "EditableFormat": "markdown",
      "HTML": "<p>As soon as Perseus clambered out of the cave, Hermes' sandals took flight once again, taking him across the mountains and forests, back towards home. As he flew on, he heard a small cry float in on the wind. At first he thought it was a trick on his mind, but then he heard it again, a cry of \"Help!\" followed by a scream.</p>\n<p>He commanded Hermes' sandals to follow the cry, and soon saw a young woman, stranded on a cliff-face. Below her was the raging sea.</p>\n<p>\"How did you come to be here?\" Perseus called down to the girl.</p>\n<p>\"My father is sacrificing me to Posiedon,\" The girl responded, \"He offended the god of the sea, and he set a sea serpent on our kingdom.\"</p>\n<p>The girl pointed out to the horizon, and [[Perseus followed her gaze]].</p>\n<p>[[Perseus followed her gaze]]:</p>\n<p>Due to the raging sea it was hard to see anything a first, but then Perseus saw the spinal fins of a sea serpent, heading straight for the girl. He knew he must defeat this creature and save her and her kingdom, wherever it might be.</p>\n<p>Perseus flew high and waited for the serpent to approach the rock. With a crash, the Serpent rose out of the sea, ready to strike at the girl. As soon as Perseus saw that the serpent was about to attack, he swooped down on his flying sandals, and slashed it across the neck with his sword.</p>\n<p>The serpent hissed in pain, and moved away from the girl and focussed its attacks on Perseus, but every time it would try to bite him, Perseus would just fly higher than it could reach, before swooping down again to continue attacking it with his sword. After many blows, the creature finally fell back into the sea, leaving the kingdom forever.</p>\n<p>Perseus picked up the girl and brought her back [[to her kingdom]].</p>\n<p>[[to her kingdom]]:</p>\n<p>On the journey back, Perseus found out that her name was Andromeda, and that she was the daughter of King Cepheus of [Aethiopia].</p>\n<p>When he returned their daughter, Perseus made an offer to the king.</p>\n<p>\"Your majesty, I am Perseus, son of Zeus and rightful heir to Kingdom of Argos. Please, my I take your daughter to be my bride?\"</p>\n<p>Cepheus was glad that his kingdom was safe due to the brave actions of Perseus, so did not even give a moment's hesitation.  Perseus picked Andromeda up and together they took off into the air. After a short flight back, [[they landed in Seriphos]].</p>\n<p>[Aethiopia]:</p>\n<p>Geography: Aethiopia is an ancient region and refers to a section of land of the upper Nile region (where Egypt is situated today), as well as more general areas of the Sahara Desert and the continent of Africa. It is referred to in two other Greek poems, the Iliad and The Odyssey, both written by Homer.</p>\n<p>[[they landed in Seriphos]]:</p>\n<p>Perseus quickly reunited with his mother, and made offerings to the gods at the temple, before marching to the palace. Polydectes was already picking out wedding decorations when Perseus strode through the door, so convinced that the young man could not have completed his task.</p>\n<p>\"So then, young Perseus,\" King Polydectes called out. \"Have you returned with your gift for me?\"</p>\n<p>\"I have,\" shouted Perseus, \"Lay your eyes upon the head of the Gorgon Medusa!\"</p>\n<p>Perseus closed his eyes and ripped the head from the sack on his back, holding it aloft for Polydectes and his court to see. What started as shock and surprise at the reveal of the creatures head soon turned to terror as Polydectes and his aides were turned to stone within an instant. The cruel reign of King Polydectes had ended, and his people were free.</p>\n<p>But our story does not end here, dear reader. For there is still one prophecy left to [[come true]].</p>\n<p>[[come true]]:</p>\n<p>Perseus, along with his mother, his step-father and his new bride Andromeda, set sail back to Argos, from where he had been cast out as a child, to claim his rightful place within the royal court.</p>\n<p>The journey was a short one, and as the four departed their boat and set foot on Argos, they realised a sports tournament was being held that day within the city. Perseus, being a man of noble birth and deeds entered into the contest. There was only one field event left, [the discus throw]. Perseus was the last contestant of the day.</p>\n<p>Perseus had trained in the discus throw back on Seriphos, and he knew his throw was straight and true. Just as he predicted, his throw soon surpassed all the other contestants...but the gods had other plans. A gust of wind, one of the many that saved Perseus and his mother when they had been thrown to the sea, hoisted the discus far away from the playing fields.</p>\n<p>It continued, soaring across the city, [[towards the palace]].</p>\n<p>[discus throw]:</p>\n<p>Culture: The discus throw is sport that was part of the Ancient Olympic Games, in which a competitor throws a heavy disc in an attempt to have thrown it the furthest out of all the competitors.</p>\n<p>[[towards the palace]]:</p>\n<p>King Acrisius stood from his balcony in his palace, surveying his city from the highest point on the island. He did not see the discus, thrown from many miles away, heading straight towards him. One final breath of air guided the discus down, hitting Arcisius on his ankle, tripping him. He fell the floor, and the sudden shock killed him instantly.</p>\n<p>The gods had finally come true on their promise that Acrisius' grandson, Perseus, would kill his grandfather. Perseus would only find out when he and his mother arrived at the palace looking for their kin. While he was saddened at his grandfather's death, Perseus soon took to the throne alongside his bride Andromeda, and ruled Argos for many years.</p>\n<p>[[End]].</p>\n<p>[[End]]:</p>\n<pre><code>                                GAME OVER\n</code></pre>\n<p>If you're reading this then well done, you made it! You successfully took on the Gorgon Medusa, defeating her and rightfully restored Perseus to his throne.</p>\n<p>Thank you for playing this instalment of Heroes And Monsters. Check out our other stories inspired by Greek Mythology, as well as titles outside the Heroes and Monsters collection.</p>\n\n",
      "PostDate": "2018-01-01T14:47:07.7363292Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "e2befce1-9081-4845-9edb-498af4fd8088",
      "UserId": 275370,
      "Username": "Tom_Clement",
      "AvatarUrl": "https://secure.gravatar.com/avatar/a9cc03629c2eca096b46a086cca03734?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Sorry for doing so many posts, but this was the only way to get all the code posted. The posts should lead one from one another, with no duplications of text.",
      "EditableFormat": "markdown",
      "HTML": "<p>Sorry for doing so many posts, but this was the only way to get all the code posted. The posts should lead one from one another, with no duplications of text.</p>\n\n",
      "PostDate": "2018-01-01T14:48:12.5466721Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "85661320-9489-4dce-a675-9b8386270ccd",
      "UserId": 318253,
      "Username": "K.V.",
      "AvatarUrl": "https://i.imgur.com/3s3Ekp2b.png",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Are there 4 spaces in front of \"YOU DIED\" and \"GAME OVER\" by any chance?  \r\n\r\n(This is a guess, but it looks like that's what's happening.)\r\n\r\nIf so, Squiffy will probably think that's supposed to be Javascript, which is closed out with a ```;```.\r\n\r\nIf this is the case, adding semi-colons wouldn't help.\r\n\r\nYou'd need to remove the spaces before \"YOU DIED\" and \"GAME OVER\".",
      "EditableFormat": "markdown",
      "HTML": "<p>Are there 4 spaces in front of \"YOU DIED\" and \"GAME OVER\" by any chance?</p>\n<p>(This is a guess, but it looks like that's what's happening.)</p>\n<p>If so, Squiffy will probably think that's supposed to be Javascript, which is closed out with a <code>;</code>.</p>\n<p>If this is the case, adding semi-colons wouldn't help.</p>\n<p>You'd need to remove the spaces before \"YOU DIED\" and \"GAME OVER\".</p>\n\n",
      "PostDate": "2018-01-01T21:07:57.9035852Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "6c330eef-2fe3-4b69-9e5c-3319b7788cfa",
      "UserId": 318253,
      "Username": "K.V.",
      "AvatarUrl": "https://i.imgur.com/3s3Ekp2b.png",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "That looks like an enjoyable game, by the way!",
      "EditableFormat": "markdown",
      "HTML": "<p>That looks like an enjoyable game, by the way!</p>\n\n",
      "PostDate": "2018-01-01T23:30:54.0130183Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "a56d83df-3833-47e8-8790-1f1298e96cdc",
      "UserId": 275370,
      "Username": "Tom_Clement",
      "AvatarUrl": "https://secure.gravatar.com/avatar/a9cc03629c2eca096b46a086cca03734?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "I had used a combination of tabs and spaces to get them in the middle. Even after I took out the spaces I was still getting the message. I think it has something to do with the final Game Over. I've used it before in previous games, but had some text between the [[new section]] and the tabbed GAME OVER. In this game it went straight from the [[new section]] to the tabs. When I took the tabs out then the game works fine. I don't know why it wouldn't work beforehand but at least it's figured out. Thanks for your help!",
      "EditableFormat": "markdown",
      "HTML": "<p>I had used a combination of tabs and spaces to get them in the middle. Even after I took out the spaces I was still getting the message. I think it has something to do with the final Game Over. I've used it before in previous games, but had some text between the [[new section]] and the tabbed GAME OVER. In this game it went straight from the [[new section]] to the tabs. When I took the tabs out then the game works fine. I don't know why it wouldn't work beforehand but at least it's figured out. Thanks for your help!</p>\n\n",
      "PostDate": "2018-01-02T15:47:45.0187236Z",
      "LastEditDate": null,
      "link": null
    }
  ]
}
