{
  "Topic": {
    "TopicId": "4489",
    "ForumId": "16",
    "Title": "Changing how categorising games works",
    "LastUpdated": "2014-10-20T09:19:25+01:00",
    "ReplyCount": 26
  },
  "Posts": [
    {
      "PostId": "29562",
      "UserId": 0,
      "Username": "Alex",
      "UserAvatar": null,
      "UserGravatar": "188b72c5e13327f4fde3989dca7d7d53",
      "EditableText": "We're getting increasing numbers of game submissions to textadventures.co.uk, and I think the current categorisation system is showing its weakness.\n\nCurrently, when submitting a game, a game author chooses their desired category. However, the category is not actually set until the game has been reviewed by a moderator. The moderator decides, based on a reasonably quick look at the game, whether the game deserves to go into that category, or if it should be placed in the Sandpit. The Sandpit is basically a bucket for all the quick demo, tutorial, half-finished etc. games that get submitted.\n\nThere are only a small handful of moderators, and that means that games can get backed up in the Uncategorised queue.\n\nWhat are people's thoughts about how we could improve the system? Ideally, we want good games to be easily found, and for authors to get feedback on bad games so they can improve them (or submit better games next time).\n\nWhat do you think about having a system like Kongregate uses? Games are &quot;under judgement&quot; until they get a certain number of reviews.\n\nWe could implement a system like this on the site. This would mean that all games would be immediately assigned to the author's chosen category, but they would also get an &quot;under judgement&quot; tag. By default, category listings wouldn't show games that were under judgement - you'd have a tickbox to turn this on and off. After a game has got, say, 3 reviews, the &quot;under judgement&quot; tag disappears, and the game appears by default in its category listing.\n\nWe could still have &quot;Sandpit&quot; as an open category - people with test or tutorial games could feel free to submit them there, and it would be exempt from the &quot;under judgement&quot; rules. Games that failed to get good ratings during their &quot;under judgement&quot; phase would be reassigned to the Sandpit.\n\nThis system would mean that we wouldn't need separate moderators with a duty to police all new submissions - that power would be democratically distributed instead.\n\nWhat do you think?",
      "EditableFormat": "bbcode",
      "HTML": "We're getting increasing numbers of game submissions to textadventures.co.uk, and I think the current categorisation system is showing its weakness.<br/><br/>Currently, when submitting a game, a game author chooses their desired category. However, the category is not actually set until the game has been reviewed by a moderator. The moderator decides, based on a reasonably quick look at the game, whether the game deserves to go into that category, or if it should be placed in the Sandpit. The Sandpit is basically a bucket for all the quick demo, tutorial, half-finished etc. games that get submitted.<br/><br/>There are only a small handful of moderators, and that means that games can get backed up in the Uncategorised queue.<br/><br/>What are people's thoughts about how we could improve the system? Ideally, we want good games to be easily found, and for authors to get feedback on bad games so they can improve them (or submit better games next time).<br/><br/>What do you think about having a system like Kongregate uses? Games are &quot;under judgement&quot; until they get a certain number of reviews.<br/><br/>We could implement a system like this on the site. This would mean that all games would be immediately assigned to the author's chosen category, but they would also get an &quot;under judgement&quot; tag. By default, category listings wouldn't show games that were under judgement - you'd have a tickbox to turn this on and off. After a game has got, say, 3 reviews, the &quot;under judgement&quot; tag disappears, and the game appears by default in its category listing.<br/><br/>We could still have &quot;Sandpit&quot; as an open category - people with test or tutorial games could feel free to submit them there, and it would be exempt from the &quot;under judgement&quot; rules. Games that failed to get good ratings during their &quot;under judgement&quot; phase would be reassigned to the Sandpit.<br/><br/>This system would mean that we wouldn't need separate moderators with a duty to police all new submissions - that power would be democratically distributed instead.<br/><br/>What do you think?",
      "PostDate": "2014-07-17T19:32:40+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "29565",
      "UserId": 0,
      "Username": "george",
      "UserAvatar": null,
      "UserGravatar": "dc6fe8e6172303d85249a13c9a49c1ff",
      "EditableText": "I like the idea of more filtering options, but it seems like this proposal combines a few different things, moderating, categorizing, and highlighting good games. What's wrong with letting people pick their own categories? Then it's unambiguous. The under judgement tag can still be a function of how many good reviews you get, but separate from categories. That seems cleaner to me.",
      "EditableFormat": "bbcode",
      "HTML": "I like the idea of more filtering options, but it seems like this proposal combines a few different things, moderating, categorizing, and highlighting good games. What's wrong with letting people pick their own categories? Then it's unambiguous. The under judgement tag can still be a function of how many good reviews you get, but separate from categories. That seems cleaner to me.",
      "PostDate": "2014-07-18T02:43:50+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "29566",
      "UserId": 0,
      "Username": "R2T1",
      "UserAvatar": "6472_1452827095.jpg",
      "UserGravatar": "56c07d47bfdd86fca900f3e8474ef80f",
      "EditableText": "This would definitely assist the moderators but then it begs the next question -What will constitute a good review? \nWill getting a few of my mates to 'vote me up' get my game untagged as 'Under Judgement' despite how good or finished the game is?\n\nThere's never going to be an easy answer to this no matter how it is done.",
      "EditableFormat": "bbcode",
      "HTML": "This would definitely assist the moderators but then it begs the next question -What will constitute a good review? <br/>Will getting a few of my mates to 'vote me up' get my game untagged as 'Under Judgement' despite how good or finished the game is?<br/><br/>There's never going to be an easy answer to this no matter how it is done.",
      "PostDate": "2014-07-18T03:03:51+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "29573",
      "UserId": 0,
      "Username": "Pertex",
      "UserAvatar": "5940_1369854251.gif",
      "UserGravatar": "4cc1e52f99452e841ecf4cbee9eadde9",
      "EditableText": "I don't understand this system. If a terrible game has no reviews or stars it will not shown in the game list. If 3 people rate  a terrible game with one star or a bad review it will shown in the game list??? But if bad games are shown in the game list, you don't need to introduce a  &quot;under judgement&quot; system, just show all games.",
      "EditableFormat": "bbcode",
      "HTML": "I don't understand this system. If a terrible game has no reviews or stars it will not shown in the game list. If 3 people rate  a terrible game with one star or a bad review it will shown in the game list??? But if bad games are shown in the game list, you don't need to introduce a  &quot;under judgement&quot; system, just show all games.",
      "PostDate": "2014-07-18T13:24:50+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "29574",
      "UserId": 0,
      "Username": "Alex",
      "UserAvatar": null,
      "UserGravatar": "188b72c5e13327f4fde3989dca7d7d53",
      "EditableText": "Not quite...\n\n[quote:35t7jp6f]\nGames that failed to get good ratings during their &quot;under judgement&quot; phase would be reassigned to the Sandpit.\n[/quote:35t7jp6f]",
      "EditableFormat": "bbcode",
      "HTML": "Not quite...<br/><br/><blockquote><p><br/>Games that failed to get good ratings during their &quot;under judgement&quot; phase would be reassigned to the Sandpit.<br/></p></blockquote>",
      "PostDate": "2014-07-18T13:40:07+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "29575",
      "UserId": 0,
      "Username": "Pertex",
      "UserAvatar": "5940_1369854251.gif",
      "UserGravatar": "4cc1e52f99452e841ecf4cbee9eadde9",
      "EditableText": "[quote:1axuo2f4]\nGames that failed to get good ratings during their &quot;under judgement&quot; phase would be reassigned to the Sandpit.\n[/quote:1axuo2f4][/quote]\n\nOK, and games with 3 stars will then be assigned to the Sandpit? It's hard to decide if a rating is really fair. As a moderator I find games with just a start page and rated with 5 stars.\n\nWhat about the other way? The player can mark a game as Sandpit game (like mods can to with reason) and if it get 5 &quot;dark stars&quot; it's moved to the &quot;black whole&quot; category and is not shown in the game list any more. Moderators then could decide to move it to sandpit or back to the game lists.",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><p><br/>Games that failed to get good ratings during their &quot;under judgement&quot; phase would be reassigned to the Sandpit.<br/></p></blockquote>[/quote]<br/><br/>OK, and games with 3 stars will then be assigned to the Sandpit? It's hard to decide if a rating is really fair. As a moderator I find games with just a start page and rated with 5 stars.<br/><br/>What about the other way? The player can mark a game as Sandpit game (like mods can to with reason) and if it get 5 &quot;dark stars&quot; it's moved to the &quot;black whole&quot; category and is not shown in the game list any more. Moderators then could decide to move it to sandpit or back to the game lists.",
      "PostDate": "2014-07-18T14:27:01+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "29576",
      "UserId": 0,
      "Username": "Alex",
      "UserAvatar": null,
      "UserGravatar": "188b72c5e13327f4fde3989dca7d7d53",
      "EditableText": "Yes, that might be a better idea. We could have a simple thumbs up, thumbs down system, rather than require people to write a full review. This makes sense to me as you can generally make a quick decision about whether a game is Sandpit-worthy, but a full review would take much longer - you'd only want to review a game when you'd finished it.",
      "EditableFormat": "bbcode",
      "HTML": "Yes, that might be a better idea. We could have a simple thumbs up, thumbs down system, rather than require people to write a full review. This makes sense to me as you can generally make a quick decision about whether a game is Sandpit-worthy, but a full review would take much longer - you'd only want to review a game when you'd finished it.",
      "PostDate": "2014-07-18T15:11:19+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "29739",
      "UserId": 0,
      "Username": "cdutton184",
      "UserAvatar": null,
      "UserGravatar": "61656e8ea5cb37d98f7308f4f3b9c814",
      "EditableText": "I think it's a good idea to have us judge new games. If there aren't many moderators to do it then a simple [b:3pk4rymk]Likes/Dislikes[/b:3pk4rymk]  or [b:3pk4rymk]Thumbs Up/Down[/b:3pk4rymk] system should be introduced.\n\nTherefore, the [b:3pk4rymk]Latest Games[/b:3pk4rymk] page will have these new games placed there [b:3pk4rymk]Under Judgement/Review[/b:3pk4rymk] until the game gets, say, a certain number of [b:3pk4rymk]Likes[/b:3pk4rymk] (against the difference of [b:3pk4rymk]Dislikes[/b:3pk4rymk]?) and will not appear in any of the other [b:3pk4rymk]Category[/b:3pk4rymk] or [b:3pk4rymk]Top Rated[/b:3pk4rymk] pages. Then, when they are rated highly (within a time scale?) a game will be removed from the [b:3pk4rymk]Latest Games[/b:3pk4rymk] section and placed in their proper [b:3pk4rymk]Category[/b:3pk4rymk] and eventually in the [b:3pk4rymk]Top Rated[/b:3pk4rymk] sections. I presume that's what is being suggested?\n\nWhat happens to the games that don't get the grade and what if the [b:3pk4rymk]Thumbs up/down[/b:3pk4rymk] numbers are tied?  Are they placed as a [b:3pk4rymk]Sandpit [/b:3pk4rymk]game automatically? \n\nAlso, would these [b:3pk4rymk]Latest Games[/b:3pk4rymk] have a shelf-life before a game is put in the [b:3pk4rymk]Sandpit[/b:3pk4rymk] section, like a month? This would help prevent a backlog in the [b:3pk4rymk]Latest Games[/b:3pk4rymk] pages!",
      "EditableFormat": "bbcode",
      "HTML": "I think it's a good idea to have us judge new games. If there aren't many moderators to do it then a simple <span style=\"font-weight:bold;\">Likes/Dislikes</span>  or <span style=\"font-weight:bold;\">Thumbs Up/Down</span> system should be introduced.<br/><br/>Therefore, the <span style=\"font-weight:bold;\">Latest Games</span> page will have these new games placed there <span style=\"font-weight:bold;\">Under Judgement/Review</span> until the game gets, say, a certain number of <span style=\"font-weight:bold;\">Likes</span> (against the difference of <span style=\"font-weight:bold;\">Dislikes</span>?) and will not appear in any of the other <span style=\"font-weight:bold;\">Category</span> or <span style=\"font-weight:bold;\">Top Rated</span> pages. Then, when they are rated highly (within a time scale?) a game will be removed from the <span style=\"font-weight:bold;\">Latest Games</span> section and placed in their proper <span style=\"font-weight:bold;\">Category</span> and eventually in the <span style=\"font-weight:bold;\">Top Rated</span> sections. I presume that's what is being suggested?<br/><br/>What happens to the games that don't get the grade and what if the <span style=\"font-weight:bold;\">Thumbs up/down</span> numbers are tied?  Are they placed as a <span style=\"font-weight:bold;\">Sandpit </span>game automatically? <br/><br/>Also, would these <span style=\"font-weight:bold;\">Latest Games</span> have a shelf-life before a game is put in the <span style=\"font-weight:bold;\">Sandpit</span> section, like a month? This would help prevent a backlog in the <span style=\"font-weight:bold;\">Latest Games</span> pages!",
      "PostDate": "2014-08-10T12:33:49+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "29818",
      "UserId": 0,
      "Username": "Silver",
      "UserAvatar": null,
      "UserGravatar": "13024be5ccbb463906b024d5bd3cb5e8",
      "EditableText": "I think this has been raised in another thread too but would it at all possible to implement a parent/sub category for text adventure or game book? People tend to like one more than the other (for me I prefer the former over the latter).",
      "EditableFormat": "bbcode",
      "HTML": "I think this has been raised in another thread too but would it at all possible to implement a parent/sub category for text adventure or game book? People tend to like one more than the other (for me I prefer the former over the latter).",
      "PostDate": "2014-08-22T10:37:15+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30186",
      "UserId": 0,
      "Username": "TextStories",
      "UserAvatar": null,
      "UserGravatar": "ec4fb09a0b797424dd59ffabd1a1b788",
      "EditableText": "[size=150:3qm01xdy][b:3qm01xdy][i:3qm01xdy][u:3qm01xdy]NOTE[/i:3qm01xdy][/u:3qm01xdy]:Prepare for massive wall of text...  <!-- s:lol: --><img src=\"{SMILIES_PATH}/icon_lol.gif\" alt=\":lol:\" title=\"Laughing\" /><!-- s:lol: --> [/b:3qm01xdy][/size:3qm01xdy]\n\nI was going to post a new thread for this, but glad I found this one already in the works with active comments.  I am finding it overly difficult to find a game I want to play, when it should be made plainly obvious what it is about before I try it or even before I click on any additional links.  As in if it is a Text Adventure or a Choose Your Own Adventure or a hybrid of the two.  Many times I see a game title I think I would love to try and find it was not what I was looking for.  Granted, I discovered I can click on a game title for further details, but a simple “heading” would be much easier to cut down on the clicking and searching.\n\nAlso I see games have five stars or less in ratings with parenthesis for the actual score.  I would assume if something was four stars and a half, the last star would in fact be a “half of a star”, not four full stars showing.  I also see games that is in the higher range say 3.7 or 4.8 and the games have a full four stars or five stars respectively, instead of three stars or four.  But this in it self is nothing major.\n\nI would like to see a feature, much like my first suggestion, that a game will show how many reviews a game has from the start.  For instance [4.5 based on 22 reviews] type of heading.  That way a gamer can see how many reviews a game had to warrant such a score.  The reason being is, if this game has five stars, but only has three reviews, compared to a game that has four stars, but has fifty reviews.  To me, it shows the second game, even though it has a lower score over all, has been much more player tested and “weathered” so to speak.  You know what to expect from it.  Any group of “friends” as someone else mentioned, can bump a game up with a few good scores.  But it takes many reviews to show what the game is really like.\n\nAnd I am a little confused on what a moderator actually does...  Are they there to give ratings to games such as five or four stars or do they rate the content of a piece as if it is too offensive or in the wrong section and then take appropriate actions or denying a game to be allowed on the site or to move it to the proper category?\n\nIn saying that, an author should be able to choose what section to place the game under.  This should be no problem, unless there are people purposely having adult games in stuff such as sci-fi or fantasy or simply posting an elf fantasy type game into a sci-fi section, etc.  But then who is to say, a game that has adult situations can not also be in sci-fi or fantasy?  When I write, depending on the subject and the audience, I write for the “R” rating.  It has violence, gore, sexual themes, but not a straight porno and I think anyone who is of a relative age should be able to play it with no problem.  After all, it is no worse than a book found in a public library.  Perhaps something along the lines of Mass Effect or Bio Shock.  I would not consider it Adult per say, but it has all the terms listed above.\n\n“Adult” to me sounds like smut or “XXX”.  And although I see nothing wrong with it, most people deem it a dirty term/taboo and Mass Effect or Bio Shock certainly is not that.  And even if a game could potentially be Adult in nature, the sandbox area has no limits of who plays a game as in a child or those easily offended, so why not just let an author use his or her best discretion until a moderator has seen reason to move it.  Maybe allow users to “flag” a game for inappropriate content, either in the wrong section or a straight out piece of gutter trash that never should of seen the light of day.  The game itself would still be able to be played by others and no one else would know it has been flagged except for the moderators and then they could take a look at the game itself and judge it on merits.  Heck, I would assume a moderator could open up a game and just “glimpse” at it's contents.  Surely there are common decency rules not be be broken.  Although then again how far can one push the boundaries?  When does violence become too gory?  When does anime become hentai?  When does common sense, common dignity and legal issues come into their own?\n\nMaybe Adult games should have it's own section with a warning or a sign in feature for proof of age to play on line or to even download.  (Although there are obvious ways to circumnavigate such a feature online.)  And then a drop down box of what categories such as fantasy or sci-fi, etc.\n\nLastly, I see a lot of games in all sections with no ratings at all.  As in no one has reviewed them.  It makes me not want to play them, because I of course would like to play a game I know is relatively good with most if not all kinks worked out.  And yet, I can not help but feel that between all the crap in there, because undoubtedly there are a bunch, there has to be a few gems, polished or not, hiding among the mucky muck.  I know of another website, and although the authors of said pieces deserve the top or first page, it seems it is almost always the same people posting a damn hamster with a party hat or a poem that, although is good, was not any better than someone else's.  There are tons of pieces that are half assed, but there are literally hundreds if not thousands that truly garner a second look, but they will hardly ever get that chance.  I would hate for there to be great or even just good pieces of gaming to be had here, but no one has taken the time to actually play one and look it over.  But then again, I do not want to play a stinker either... that is the conundrum.  But does having a catchy preview picture and a snazzy music intro promise of a good game?  No of course not.  So any suggestions on how to fix that?  It seems there are only a handful of the games, out of the many, that have a better than four star rating and many that have not been rated at all.\n\n  And on a rather side note, sorry I know this has already been long, but it was either this or a whole separate thread, how come I can not download Hitchhikers Guide to the Galaxy, but I can play it online?  I do not wish to play online, I like offline better.  I mean it is on the actual website of this forum, why can it not be downloaded?  Just curious.  Thanks.",
      "EditableFormat": "bbcode",
      "HTML": "<span style=\"font-size:150\"><span style=\"font-weight:bold;\"><span style=\"font-style:italic;\"><span style=\"text-decoration:underline;\">NOTE</span></span>:Prepare for massive wall of text...  <!-- s:lol: --><img src=\"{SMILIES_PATH}/icon_lol.gif\" alt=\":lol:\" title=\"Laughing\" /><!-- s:lol: --> </span></span><br/><br/>I was going to post a new thread for this, but glad I found this one already in the works with active comments.  I am finding it overly difficult to find a game I want to play, when it should be made plainly obvious what it is about before I try it or even before I click on any additional links.  As in if it is a Text Adventure or a Choose Your Own Adventure or a hybrid of the two.  Many times I see a game title I think I would love to try and find it was not what I was looking for.  Granted, I discovered I can click on a game title for further details, but a simple “heading” would be much easier to cut down on the clicking and searching.<br/><br/>Also I see games have five stars or less in ratings with parenthesis for the actual score.  I would assume if something was four stars and a half, the last star would in fact be a “half of a star”, not four full stars showing.  I also see games that is in the higher range say 3.7 or 4.8 and the games have a full four stars or five stars respectively, instead of three stars or four.  But this in it self is nothing major.<br/><br/>I would like to see a feature, much like my first suggestion, that a game will show how many reviews a game has from the start.  For instance [4.5 based on 22 reviews] type of heading.  That way a gamer can see how many reviews a game had to warrant such a score.  The reason being is, if this game has five stars, but only has three reviews, compared to a game that has four stars, but has fifty reviews.  To me, it shows the second game, even though it has a lower score over all, has been much more player tested and “weathered” so to speak.  You know what to expect from it.  Any group of “friends” as someone else mentioned, can bump a game up with a few good scores.  But it takes many reviews to show what the game is really like.<br/><br/>And I am a little confused on what a moderator actually does...  Are they there to give ratings to games such as five or four stars or do they rate the content of a piece as if it is too offensive or in the wrong section and then take appropriate actions or denying a game to be allowed on the site or to move it to the proper category?<br/><br/>In saying that, an author should be able to choose what section to place the game under.  This should be no problem, unless there are people purposely having adult games in stuff such as sci-fi or fantasy or simply posting an elf fantasy type game into a sci-fi section, etc.  But then who is to say, a game that has adult situations can not also be in sci-fi or fantasy?  When I write, depending on the subject and the audience, I write for the “R” rating.  It has violence, gore, sexual themes, but not a straight porno and I think anyone who is of a relative age should be able to play it with no problem.  After all, it is no worse than a book found in a public library.  Perhaps something along the lines of Mass Effect or Bio Shock.  I would not consider it Adult per say, but it has all the terms listed above.<br/><br/>“Adult” to me sounds like smut or “XXX”.  And although I see nothing wrong with it, most people deem it a dirty term/taboo and Mass Effect or Bio Shock certainly is not that.  And even if a game could potentially be Adult in nature, the sandbox area has no limits of who plays a game as in a child or those easily offended, so why not just let an author use his or her best discretion until a moderator has seen reason to move it.  Maybe allow users to “flag” a game for inappropriate content, either in the wrong section or a straight out piece of gutter trash that never should of seen the light of day.  The game itself would still be able to be played by others and no one else would know it has been flagged except for the moderators and then they could take a look at the game itself and judge it on merits.  Heck, I would assume a moderator could open up a game and just “glimpse” at it's contents.  Surely there are common decency rules not be be broken.  Although then again how far can one push the boundaries?  When does violence become too gory?  When does anime become hentai?  When does common sense, common dignity and legal issues come into their own?<br/><br/>Maybe Adult games should have it's own section with a warning or a sign in feature for proof of age to play on line or to even download.  (Although there are obvious ways to circumnavigate such a feature online.)  And then a drop down box of what categories such as fantasy or sci-fi, etc.<br/><br/>Lastly, I see a lot of games in all sections with no ratings at all.  As in no one has reviewed them.  It makes me not want to play them, because I of course would like to play a game I know is relatively good with most if not all kinks worked out.  And yet, I can not help but feel that between all the crap in there, because undoubtedly there are a bunch, there has to be a few gems, polished or not, hiding among the mucky muck.  I know of another website, and although the authors of said pieces deserve the top or first page, it seems it is almost always the same people posting a damn hamster with a party hat or a poem that, although is good, was not any better than someone else's.  There are tons of pieces that are half assed, but there are literally hundreds if not thousands that truly garner a second look, but they will hardly ever get that chance.  I would hate for there to be great or even just good pieces of gaming to be had here, but no one has taken the time to actually play one and look it over.  But then again, I do not want to play a stinker either... that is the conundrum.  But does having a catchy preview picture and a snazzy music intro promise of a good game?  No of course not.  So any suggestions on how to fix that?  It seems there are only a handful of the games, out of the many, that have a better than four star rating and many that have not been rated at all.<br/><br/>  And on a rather side note, sorry I know this has already been long, but it was either this or a whole separate thread, how come I can not download Hitchhikers Guide to the Galaxy, but I can play it online?  I do not wish to play online, I like offline better.  I mean it is on the actual website of this forum, why can it not be downloaded?  Just curious.  Thanks.",
      "PostDate": "2014-09-22T07:58:51+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30202",
      "UserId": 0,
      "Username": "Silver",
      "UserAvatar": null,
      "UserGravatar": "13024be5ccbb463906b024d5bd3cb5e8",
      "EditableText": "[quote=&quot;TextStories&quot;:x0g44c47]\nAnd I am a little confused on what a moderator actually does...  Are they there to give ratings to games such as five or four stars or do they rate the content of a piece as if it is too offensive or in the wrong section and then take appropriate actions or denying a game to be allowed on the site or to move it to the proper category?[/quote:x0g44c47]\n\nThe game interface is really easy to understand. As such, people create games that they spend a few hours on and then submit as the finished article. The other group of people are those who play the games. It makes no sense to allow every game submitted to be published as it repels the second group of people if all they do is waste their time playing unfinished games. The moderators are supposed to make the distinction between finished and unfinished although there's a massive grey area between the two and the ones in that section that get through are purely based on that moderator's decision. It gets difficult to judge when you're looking at forty crap games one after the other and mistakes get made. Sometimes really bad ones will get through because they were a breath of fresh air compared to the rest or a good one might not make it because there isn't many others submitted to compare to but it still feels unfinished. It isn't an exact science. Alex is looking at coding all this in a different way that will help all involved.\n\nThe review system isn't controlled by moderators and, as you rightly point out, is open to abuse. The worst game in the world could somehow avoid the sand pit and get a few five star reviews from friends and make it onto the top of the front page. I think Alex is trying to address that too.\n\nAs for adult content, presently that is done in the moderation stage. You must remember that pre-pubescent children can access and use this site so if you don't want your game thrown into the adult category then don't swear or make it about smoking weed or getting your rocks off with your mate's girlfriend. It isn't rocket science and text adventures are usually good through good prose and clever puzzles, not because they're 'edgy'. If you want edgy, go form a band.",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><cite>TextStories wrote:</cite><br/>And I am a little confused on what a moderator actually does...  Are they there to give ratings to games such as five or four stars or do they rate the content of a piece as if it is too offensive or in the wrong section and then take appropriate actions or denying a game to be allowed on the site or to move it to the proper category?</blockquote><br/><br/>The game interface is really easy to understand. As such, people create games that they spend a few hours on and then submit as the finished article. The other group of people are those who play the games. It makes no sense to allow every game submitted to be published as it repels the second group of people if all they do is waste their time playing unfinished games. The moderators are supposed to make the distinction between finished and unfinished although there's a massive grey area between the two and the ones in that section that get through are purely based on that moderator's decision. It gets difficult to judge when you're looking at forty crap games one after the other and mistakes get made. Sometimes really bad ones will get through because they were a breath of fresh air compared to the rest or a good one might not make it because there isn't many others submitted to compare to but it still feels unfinished. It isn't an exact science. Alex is looking at coding all this in a different way that will help all involved.<br/><br/>The review system isn't controlled by moderators and, as you rightly point out, is open to abuse. The worst game in the world could somehow avoid the sand pit and get a few five star reviews from friends and make it onto the top of the front page. I think Alex is trying to address that too.<br/><br/>As for adult content, presently that is done in the moderation stage. You must remember that pre-pubescent children can access and use this site so if you don't want your game thrown into the adult category then don't swear or make it about smoking weed or getting your rocks off with your mate's girlfriend. It isn't rocket science and text adventures are usually good through good prose and clever puzzles, not because they're 'edgy'. If you want edgy, go form a band.",
      "PostDate": "2014-09-23T22:18:27+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30209",
      "UserId": 0,
      "Username": "TextStories",
      "UserAvatar": null,
      "UserGravatar": "ec4fb09a0b797424dd59ffabd1a1b788",
      "EditableText": "<!-- s:lol: --><img src=\"{SMILIES_PATH}/icon_lol.gif\" alt=\":lol:\" title=\"Laughing\" /><!-- s:lol: --> [quote=&quot;Silver&quot;:1us44w77][quote=&quot;TextStories&quot;:1us44w77]\nAnd I am a little confused on what a moderator actually does...  Are they there to give ratings to games such as five or four stars or do they rate the content of a piece as if it is too offensive or in the wrong section and then take appropriate actions or denying a game to be allowed on the site or to move it to the proper category?[/quote:1us44w77]\n\nThe game interface is really easy to understand. As such, people create games that they spend a few hours on and then submit as the finished article. The other group of people are those who play the games. It makes no sense to allow every game submitted to be published as it repels the second group of people if all they do is waste their time playing unfinished games. The moderators are supposed to make the distinction between finished and unfinished although there's a massive grey area between the two and the ones in that section that get through are purely based on that moderator's decision. It gets difficult to judge when you're looking at forty crap games one after the other and mistakes get made. Sometimes really bad ones will get through because they were a breath of fresh air compared to the rest or a good one might not make it because there isn't many others submitted to compare to but it still feels unfinished. It isn't an exact science. Alex is looking at coding all this in a different way that will help all involved.\n\nThe review system isn't controlled by moderators and, as you rightly point out, is open to abuse. The worst game in the world could somehow avoid the sand pit and get a few five star reviews from friends and make it onto the top of the front page. I think Alex is trying to address that too.\n\nAs for adult content, presently that is done in the moderation stage. You must remember that pre-pubescent children can access and use this site so if you don't want your game thrown into the adult category then don't swear or make it about smoking weed or getting your rocks off with your mate's girlfriend. It isn't rocket science and text adventures are usually good through good prose and clever puzzles, not because they're 'edgy'. If you want edgy, go form a band.[/quote:1us44w77]\n\n\nI thought games were published regardless, they just automatically get put into sandpit until further notice.  And as far as adult is concerned- swearing, lite sexual situations and smoking weed should not be considered adult.  Even if it were, does that stop children from accessing the adult downloads and if not, that would be completely pointless.  Text Adventures do not have to be milk and cookies all the time.  Some times it is good to breath fresh air into a market of- locked in a room, need to find a way to escape, lets tear it apart before I find the key, type of games...  That was only one example and of course there are many other types of games and good ones.  But my point is, not everything has to be set to the same tune as it were.  And even it were, I am tone deaf so it really does not much matter.  You wouldn't like my band anyway.   <!-- s:lol: --><img src=\"{SMILIES_PATH}/icon_lol.gif\" alt=\":lol:\" title=\"Laughing\" /><!-- s:lol: -->  But if you mean edgy as in just sex and violence with no substance, that is exactly what I am trying to avoid and why I try to avoid the adult section, because that is all I find.  However, a good murder mystery shouldn't be vanilla either...  God forbid there would be crimes of passion, blood stains on the carpet and a severed head...   <!-- s:shock: --><img src=\"{SMILIES_PATH}/icon_eek.gif\" alt=\":shock:\" title=\"Shocked\" /><!-- s:shock: -->",
      "EditableFormat": "bbcode",
      "HTML": "<!-- s:lol: --><img src=\"{SMILIES_PATH}/icon_lol.gif\" alt=\":lol:\" title=\"Laughing\" /><!-- s:lol: --> <blockquote><cite>Silver wrote:</cite><blockquote><p><b>&quot;TextStories&quot;</b></p><p><br/>And I am a little confused on what a moderator actually does...  Are they there to give ratings to games such as five or four stars or do they rate the content of a piece as if it is too offensive or in the wrong section and then take appropriate actions or denying a game to be allowed on the site or to move it to the proper category?</blockquote><br/><br/>The game interface is really easy to understand. As such, people create games that they spend a few hours on and then submit as the finished article. The other group of people are those who play the games. It makes no sense to allow every game submitted to be published as it repels the second group of people if all they do is waste their time playing unfinished games. The moderators are supposed to make the distinction between finished and unfinished although there's a massive grey area between the two and the ones in that section that get through are purely based on that moderator's decision. It gets difficult to judge when you're looking at forty crap games one after the other and mistakes get made. Sometimes really bad ones will get through because they were a breath of fresh air compared to the rest or a good one might not make it because there isn't many others submitted to compare to but it still feels unfinished. It isn't an exact science. Alex is looking at coding all this in a different way that will help all involved.<br/><br/>The review system isn't controlled by moderators and, as you rightly point out, is open to abuse. The worst game in the world could somehow avoid the sand pit and get a few five star reviews from friends and make it onto the top of the front page. I think Alex is trying to address that too.<br/><br/>As for adult content, presently that is done in the moderation stage. You must remember that pre-pubescent children can access and use this site so if you don't want your game thrown into the adult category then don't swear or make it about smoking weed or getting your rocks off with your mate's girlfriend. It isn't rocket science and text adventures are usually good through good prose and clever puzzles, not because they're 'edgy'. If you want edgy, go form a band.</p></blockquote><br/><br/><br/>I thought games were published regardless, they just automatically get put into sandpit until further notice.  And as far as adult is concerned- swearing, lite sexual situations and smoking weed should not be considered adult.  Even if it were, does that stop children from accessing the adult downloads and if not, that would be completely pointless.  Text Adventures do not have to be milk and cookies all the time.  Some times it is good to breath fresh air into a market of- locked in a room, need to find a way to escape, lets tear it apart before I find the key, type of games...  That was only one example and of course there are many other types of games and good ones.  But my point is, not everything has to be set to the same tune as it were.  And even it were, I am tone deaf so it really does not much matter.  You wouldn't like my band anyway.   <!-- s:lol: --><img src=\"{SMILIES_PATH}/icon_lol.gif\" alt=\":lol:\" title=\"Laughing\" /><!-- s:lol: -->  But if you mean edgy as in just sex and violence with no substance, that is exactly what I am trying to avoid and why I try to avoid the adult section, because that is all I find.  However, a good murder mystery shouldn't be vanilla either...  God forbid there would be crimes of passion, blood stains on the carpet and a severed head...   <!-- s:shock: --><img src=\"{SMILIES_PATH}/icon_eek.gif\" alt=\":shock:\" title=\"Shocked\" /><!-- s:shock: -->",
      "PostDate": "2014-09-24T04:54:01+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30216",
      "UserId": 0,
      "Username": "Silver",
      "UserAvatar": null,
      "UserGravatar": "13024be5ccbb463906b024d5bd3cb5e8",
      "EditableText": "Strangely enough I don't consider horror text adventures as adult. I'm now trying to think of what the litmus test is in my head. I've concluded that if it is something illegal I'll take a closer look. So investigating a murder isn't illegal but committing one is. Smoking weed is fun if you're into that sort of thing but I don't see the point in normalising it for ten year olds. Erotica has always come under adult, perhaps not in literature but in film and photography. Again, I think it's fair to at least warn people of what to expect. But maybe killing someone in a game by poisoning them is ok. A gruesome well described rape scene might avoid adult all together and go straight in the sand pit. \n\nThe games aren't banned. And if a ten year old wants to play your gothic murder weed smoking sweary horror they could always lie about their age.",
      "EditableFormat": "bbcode",
      "HTML": "Strangely enough I don't consider horror text adventures as adult. I'm now trying to think of what the litmus test is in my head. I've concluded that if it is something illegal I'll take a closer look. So investigating a murder isn't illegal but committing one is. Smoking weed is fun if you're into that sort of thing but I don't see the point in normalising it for ten year olds. Erotica has always come under adult, perhaps not in literature but in film and photography. Again, I think it's fair to at least warn people of what to expect. But maybe killing someone in a game by poisoning them is ok. A gruesome well described rape scene might avoid adult all together and go straight in the sand pit. <br/><br/>The games aren't banned. And if a ten year old wants to play your gothic murder weed smoking sweary horror they could always lie about their age.",
      "PostDate": "2014-09-24T08:01:32+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30224",
      "UserId": 0,
      "Username": "TextStories",
      "UserAvatar": null,
      "UserGravatar": "ec4fb09a0b797424dd59ffabd1a1b788",
      "EditableText": "Yes, but I or others may not be making a game for a ten year old.  It is not my responsibilty to ensure all children under the age of 12 and under to stay off my game, nor would I want my game to be put into the Adult category when it would not deserve to be so.  I write usually any where in the range of teenagers to adults.  And writing for an adult does not [i:16vmkgc2]mean[/i:16vmkgc2] sex.\n\nAnd even if it was reasonable to be put into the Adult category, it would have more substance than a few pictures of scantly clad ladies and a sentence or two of what is going on.  I guess you could say when I write Adult I write in the HBO/Showtime/R rated category.  There might be adultish things in nature, but there is generally always a backbone story and conflict/suspence to make it some what interesting, other wise it would just be deluted to a porno flick or book.   <!-- s:roll: --><img src=\"{SMILIES_PATH}/icon_rolleyes.gif\" alt=\":roll:\" title=\"Rolling Eyes\" /><!-- s:roll: -->",
      "EditableFormat": "bbcode",
      "HTML": "Yes, but I or others may not be making a game for a ten year old.  It is not my responsibilty to ensure all children under the age of 12 and under to stay off my game, nor would I want my game to be put into the Adult category when it would not deserve to be so.  I write usually any where in the range of teenagers to adults.  And writing for an adult does not <span style=\"font-style:italic;\">mean</span> sex.<br/><br/>And even if it was reasonable to be put into the Adult category, it would have more substance than a few pictures of scantly clad ladies and a sentence or two of what is going on.  I guess you could say when I write Adult I write in the HBO/Showtime/R rated category.  There might be adultish things in nature, but there is generally always a backbone story and conflict/suspence to make it some what interesting, other wise it would just be deluted to a porno flick or book.   <!-- s:roll: --><img src=\"{SMILIES_PATH}/icon_rolleyes.gif\" alt=\":roll:\" title=\"Rolling Eyes\" /><!-- s:roll: -->",
      "PostDate": "2014-09-24T17:27:53+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30408",
      "UserId": 0,
      "Username": "Silver",
      "UserAvatar": null,
      "UserGravatar": "13024be5ccbb463906b024d5bd3cb5e8",
      "EditableText": "Games rarely get put into the adult section. I can only remember doing it once. Was that your game then? The one about smoking weed? <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D -->",
      "EditableFormat": "bbcode",
      "HTML": "Games rarely get put into the adult section. I can only remember doing it once. Was that your game then? The one about smoking weed? <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D -->",
      "PostDate": "2014-10-02T13:04:52+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30412",
      "UserId": 0,
      "Username": "TextStories",
      "UserAvatar": null,
      "UserGravatar": "ec4fb09a0b797424dd59ffabd1a1b788",
      "EditableText": "[quote=&quot;Silver&quot;:30sddczf]Games rarely get put into the adult section. I can only remember doing it once. Was that your game then? The one about smoking weed? <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D -->[/quote:30sddczf]\n\nNo, I have not published any games yet and I highly doubt mine would go to Adult anyway, for the same reasons already mentioned.",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><cite>Silver wrote:</cite>Games rarely get put into the adult section. I can only remember doing it once. Was that your game then? The one about smoking weed? <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D --></blockquote><br/><br/>No, I have not published any games yet and I highly doubt mine would go to Adult anyway, for the same reasons already mentioned.",
      "PostDate": "2014-10-02T17:08:45+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30413",
      "UserId": 0,
      "Username": "Silver",
      "UserAvatar": null,
      "UserGravatar": "13024be5ccbb463906b024d5bd3cb5e8",
      "EditableText": "I don't appear to be able to see the adult section despite me putting my DOB in my profile; I can't see it amongst the list of categories.  <!-- s:? --><img src=\"{SMILIES_PATH}/icon_confused.gif\" alt=\":?\" title=\"Confused\" /><!-- s:? -->",
      "EditableFormat": "bbcode",
      "HTML": "I don't appear to be able to see the adult section despite me putting my DOB in my profile; I can't see it amongst the list of categories.  <!-- s:? --><img src=\"{SMILIES_PATH}/icon_confused.gif\" alt=\":?\" title=\"Confused\" /><!-- s:? -->",
      "PostDate": "2014-10-02T17:31:09+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30421",
      "UserId": 0,
      "Username": "R2T1",
      "UserAvatar": "6472_1452827095.jpg",
      "UserGravatar": "56c07d47bfdd86fca900f3e8474ef80f",
      "EditableText": "If you are using the offline developer/player, then check to see if you have the options set for your game browser. Under Tools / options / browser tab",
      "EditableFormat": "bbcode",
      "HTML": "If you are using the offline developer/player, then check to see if you have the options set for your game browser. Under Tools / options / browser tab<div><img src=\"/attachment/1009\" alt=\"opt.jpg\" /></div>",
      "PostDate": "2014-10-03T00:28:14+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30427",
      "UserId": 0,
      "Username": "Silver",
      "UserAvatar": null,
      "UserGravatar": "13024be5ccbb463906b024d5bd3cb5e8",
      "EditableText": "[quote=&quot;R2T1&quot;:3b7kl1wk]If you are using the offline developer/player, then check to see if you have the options set for your game browser. Under Tools / options / browser tab[/quote:3b7kl1wk]\n\nOh right. I actually meant on the homepage. is it intentionally not displayed on there then?",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><cite>R2T1 wrote:</cite>If you are using the offline developer/player, then check to see if you have the options set for your game browser. Under Tools / options / browser tab</blockquote><br/><br/>Oh right. I actually meant on the homepage. is it intentionally not displayed on there then?",
      "PostDate": "2014-10-03T08:19:05+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30782",
      "UserId": 0,
      "Username": "TextStories",
      "UserAvatar": null,
      "UserGravatar": "ec4fb09a0b797424dd59ffabd1a1b788",
      "EditableText": "Ummm... has any one else counted how many games are currently in Sand Pit...  I just checked and although I did not do anything official and I am sure there was a much easier way to do this, like those who have mod powers can simply check a number some where... but I just counted by using a rule of thumb for 12 games to a screen and I went 62 screens half way down the list as accurately as possible and multiplied that by 2...  it came to 1488 games in Sand Pit.  (So maybe give or take a hundred or two...) Has it always been that large!?  If so what are we to do about it?  I would like to play more games and try to get come cleared out, but Quest isn't working as nicely for me as I would like at the moment.  I also understand some are just demos and or tests as some are clearly marked and perhaps some are wildly broken games or unfinished pieces, but that is still quite a bit of games or &quot;submissions&quot; of one kind or another there...\n\nThere should be category for demos, those that are tests and those that we know to be broken through play.  (Demo Room, Testing Lab and The Void or something like that.  The names are not important, the actual categories it would seem are.)  Perhaps that would free up some of the Sand Pit which should basically be a waiting line of games to be played, not everything under the sun...  But then again if everything goes to Sand Pit to begin with so it can be seen by a mod...  However, if a game is clearly marked as a demo or a test, that should help in moving it to the appropriate category.\n\nAnd to be perfectly honest... any video game that is called a &quot;sand pit&quot; game sounds like a really good one to me, like Grand Theft Auto or something.  In fact, the Sand Pit was one of the first places I looked besides RPG, Fantasy and Sci-Fi, although I took a look at Simulation as well.  I think the Sand Pit should be renamed the DMV Line or something, if the game is new and needs to be tested to go into the correct category.   <!-- s:lol: --><img src=\"{SMILIES_PATH}/icon_lol.gif\" alt=\":lol:\" title=\"Laughing\" /><!-- s:lol: -->",
      "EditableFormat": "bbcode",
      "HTML": "Ummm... has any one else counted how many games are currently in Sand Pit...  I just checked and although I did not do anything official and I am sure there was a much easier way to do this, like those who have mod powers can simply check a number some where... but I just counted by using a rule of thumb for 12 games to a screen and I went 62 screens half way down the list as accurately as possible and multiplied that by 2...  it came to 1488 games in Sand Pit.  (So maybe give or take a hundred or two...) Has it always been that large!?  If so what are we to do about it?  I would like to play more games and try to get come cleared out, but Quest isn't working as nicely for me as I would like at the moment.  I also understand some are just demos and or tests as some are clearly marked and perhaps some are wildly broken games or unfinished pieces, but that is still quite a bit of games or &quot;submissions&quot; of one kind or another there...<br/><br/>There should be category for demos, those that are tests and those that we know to be broken through play.  (Demo Room, Testing Lab and The Void or something like that.  The names are not important, the actual categories it would seem are.)  Perhaps that would free up some of the Sand Pit which should basically be a waiting line of games to be played, not everything under the sun...  But then again if everything goes to Sand Pit to begin with so it can be seen by a mod...  However, if a game is clearly marked as a demo or a test, that should help in moving it to the appropriate category.<br/><br/>And to be perfectly honest... any video game that is called a &quot;sand pit&quot; game sounds like a really good one to me, like Grand Theft Auto or something.  In fact, the Sand Pit was one of the first places I looked besides RPG, Fantasy and Sci-Fi, although I took a look at Simulation as well.  I think the Sand Pit should be renamed the DMV Line or something, if the game is new and needs to be tested to go into the correct category.   <!-- s:lol: --><img src=\"{SMILIES_PATH}/icon_lol.gif\" alt=\":lol:\" title=\"Laughing\" /><!-- s:lol: -->",
      "PostDate": "2014-10-19T06:26:42+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30783",
      "UserId": 0,
      "Username": "Silver",
      "UserAvatar": null,
      "UserGravatar": "13024be5ccbb463906b024d5bd3cb5e8",
      "EditableText": "You appear to be repeating the same questions over multiple threads. There's nothing stopping you from playing games in the sandpit. But there is a reason why they are in there. Previously every game would be submitted to their suggested categories. Players would complain about the sheer volume of unfinished games being submitted to the site so Alex decided to implement moderation. The reason why there's so many games in the sandpit isn't because they need 'clearing', it's because people submit unfinished games. They don't go in the sandpit by default btw, they go into 'uncategorised'. If you feel you can contribute to the process then ask Alex if you can be a moderator. Then you'll get to play every game submitted and see the situation revealed first hand.",
      "EditableFormat": "bbcode",
      "HTML": "You appear to be repeating the same questions over multiple threads. There's nothing stopping you from playing games in the sandpit. But there is a reason why they are in there. Previously every game would be submitted to their suggested categories. Players would complain about the sheer volume of unfinished games being submitted to the site so Alex decided to implement moderation. The reason why there's so many games in the sandpit isn't because they need 'clearing', it's because people submit unfinished games. They don't go in the sandpit by default btw, they go into 'uncategorised'. If you feel you can contribute to the process then ask Alex if you can be a moderator. Then you'll get to play every game submitted and see the situation revealed first hand.",
      "PostDate": "2014-10-19T12:50:43+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30784",
      "UserId": 0,
      "Username": "Silver",
      "UserAvatar": null,
      "UserGravatar": "13024be5ccbb463906b024d5bd3cb5e8",
      "EditableText": "[quote=&quot;TextStories&quot;:25mgkydl]And to be perfectly honest... any video game that is called a &quot;sand pit&quot; game sounds like a really good one to me, like Grand Theft Auto or something.  In fact, the Sand Pit was one of the first places I looked besides RPG, Fantasy and Sci-Fi, although I took a look at Simulation as well.  I think the Sand Pit should be renamed the DMV Line or something, if the game is new and needs to be tested to go into the correct category.   <!-- s:lol: --><img src=\"{SMILIES_PATH}/icon_lol.gif\" alt=\":lol:\" title=\"Laughing\" /><!-- s:lol: -->[/quote:25mgkydl]\n\nI think you're confusing sandpit with sandbox.Easily done I suppose.",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><cite>TextStories wrote:</cite>And to be perfectly honest... any video game that is called a &quot;sand pit&quot; game sounds like a really good one to me, like Grand Theft Auto or something.  In fact, the Sand Pit was one of the first places I looked besides RPG, Fantasy and Sci-Fi, although I took a look at Simulation as well.  I think the Sand Pit should be renamed the DMV Line or something, if the game is new and needs to be tested to go into the correct category.   <!-- s:lol: --><img src=\"{SMILIES_PATH}/icon_lol.gif\" alt=\":lol:\" title=\"Laughing\" /><!-- s:lol: --></blockquote><br/><br/>I think you're confusing sandpit with sandbox.Easily done I suppose.",
      "PostDate": "2014-10-19T12:51:49+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30785",
      "UserId": 0,
      "Username": "TextStories",
      "UserAvatar": null,
      "UserGravatar": "ec4fb09a0b797424dd59ffabd1a1b788",
      "EditableText": "Not sure of speaking of the same thing over multiple threads, but if you know games are demos and or tests only, because it is clearly stated as such, then making different categories for them alone would be a good idea as well.  At least with demos you would not call them unfinished works in the video game business, but demos.  Unless of course these demos are broken.  And tests should be in their own categories as well or over time even deleted.  Does online mode not let you play and try a game before it was published?  If so why bother with a test and if needed, why left to sit there?  Just trying to see a better alternative than having the Sandpit with 1488 games and growing.  Right now the Sandpit is the, “shuffle everything else” category.\n\nAnd yes I did in fact get Sand Pit and Sand Box confused.  I was seriously thinking that would be the place to find all the open ended game play at.  However, although I would not mind being a mod, I can not play that much of Quest, so having mod powers to simply try out games and test them for the public will be a waste, at least right now anyway.",
      "EditableFormat": "bbcode",
      "HTML": "Not sure of speaking of the same thing over multiple threads, but if you know games are demos and or tests only, because it is clearly stated as such, then making different categories for them alone would be a good idea as well.  At least with demos you would not call them unfinished works in the video game business, but demos.  Unless of course these demos are broken.  And tests should be in their own categories as well or over time even deleted.  Does online mode not let you play and try a game before it was published?  If so why bother with a test and if needed, why left to sit there?  Just trying to see a better alternative than having the Sandpit with 1488 games and growing.  Right now the Sandpit is the, “shuffle everything else” category.<br/><br/>And yes I did in fact get Sand Pit and Sand Box confused.  I was seriously thinking that would be the place to find all the open ended game play at.  However, although I would not mind being a mod, I can not play that much of Quest, so having mod powers to simply try out games and test them for the public will be a waste, at least right now anyway.",
      "PostDate": "2014-10-19T20:05:39+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30786",
      "UserId": 0,
      "Username": "Silver",
      "UserAvatar": null,
      "UserGravatar": "13024be5ccbb463906b024d5bd3cb5e8",
      "EditableText": "I'm not sure why you think demos should have their own category. What Alex is stipulating is he wants fully functioning games to be the ones that end up being categorised. Or at least a valiant attempt at it. Anyone and everyone is at liberty to promote the work and have it tested whilst it's in the sandpit on their own personal blog, the forum etc. Personally I keep my games as privately listed when they're in alpha or beta states but each to their own. Alex is working towards automating the process, hence this thread. I don't get your reasoning for wanting demos and test games publicly listed. Anyway, I doubt it was decided on a whim. I think Alex was getting flak over the abundance of half finished games on the site. Although you'd be better off asking him for his reasons. Actually IIRC it all came about when he set up all games submitted to text adventures to be submitted to the IFDB and people started having hissy fits over on intfiction.",
      "EditableFormat": "bbcode",
      "HTML": "I'm not sure why you think demos should have their own category. What Alex is stipulating is he wants fully functioning games to be the ones that end up being categorised. Or at least a valiant attempt at it. Anyone and everyone is at liberty to promote the work and have it tested whilst it's in the sandpit on their own personal blog, the forum etc. Personally I keep my games as privately listed when they're in alpha or beta states but each to their own. Alex is working towards automating the process, hence this thread. I don't get your reasoning for wanting demos and test games publicly listed. Anyway, I doubt it was decided on a whim. I think Alex was getting flak over the abundance of half finished games on the site. Although you'd be better off asking him for his reasons. Actually IIRC it all came about when he set up all games submitted to text adventures to be submitted to the IFDB and people started having hissy fits over on intfiction.",
      "PostDate": "2014-10-19T20:13:18+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30788",
      "UserId": 0,
      "Username": "TextStories",
      "UserAvatar": null,
      "UserGravatar": "ec4fb09a0b797424dd59ffabd1a1b788",
      "EditableText": "I have already given my reasons.  Sandpit is publicly listed one way or another anyway.  Also I just tried to play some games and finding most to be CYOA.  I am not much into those.  They should be totally two different categories to begin with or at least clearly marked somehow, with everything else as sub categories as they are now; Sci-Fi, RPG, Fantasy, etc.",
      "EditableFormat": "bbcode",
      "HTML": "I have already given my reasons.  Sandpit is publicly listed one way or another anyway.  Also I just tried to play some games and finding most to be CYOA.  I am not much into those.  They should be totally two different categories to begin with or at least clearly marked somehow, with everything else as sub categories as they are now; Sci-Fi, RPG, Fantasy, etc.",
      "PostDate": "2014-10-20T07:32:13+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30792",
      "UserId": 0,
      "Username": "Silver",
      "UserAvatar": null,
      "UserGravatar": "13024be5ccbb463906b024d5bd3cb5e8",
      "EditableText": "Yes I agree it would be useful to be able to differentiate between cyoa and text adventures.",
      "EditableFormat": "bbcode",
      "HTML": "Yes I agree it would be useful to be able to differentiate between cyoa and text adventures.",
      "PostDate": "2014-10-20T09:13:45+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30793",
      "UserId": 0,
      "Username": "Silver",
      "UserAvatar": null,
      "UserGravatar": "13024be5ccbb463906b024d5bd3cb5e8",
      "EditableText": "[quote=&quot;TextStories&quot;:36rp639g]I have already given my reasons.  Sandpit is publicly listed one way or another anyway.[/quote:36rp639g]\n\nThe problem is everything that doesn't end up in the sandpit gets listed under 'latest games'. If categories were made for demos and betas they would also show up under 'latest games' under the current system which would defeat the object and take us back to square one with people moaning about the volume of half finished content published as 'games'.",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><cite>TextStories wrote:</cite>I have already given my reasons.  Sandpit is publicly listed one way or another anyway.</blockquote><br/><br/>The problem is everything that doesn't end up in the sandpit gets listed under 'latest games'. If categories were made for demos and betas they would also show up under 'latest games' under the current system which would defeat the object and take us back to square one with people moaning about the volume of half finished content published as 'games'.",
      "PostDate": "2014-10-20T09:19:25+01:00",
      "LastEditDate": null
    }
  ]
}
