{
  "Topic": {
    "TopicId": "5953",
    "ForumId": "10",
    "Title": "Question on Mutually Exclusive Object pickups",
    "LastUpdated": "2016-02-13T00:38:53+00:00",
    "ReplyCount": 1
  },
  "Posts": [
    {
      "PostId": "41182",
      "UserId": 0,
      "Username": "Talon",
      "UserAvatar": null,
      "UserGravatar": "3b6191c9adc337e83fec8e293e3fc584",
      "EditableText": "I'm a very new person to the program and just really started exploring it  a few days ago, so be kind if this is a dumb question\n\nI have done very little programming in my time though I suppose I know a bit, in any case I've been alot of fun working with this program, it just has let my creativity soar. I've come up with a quandary..\n\nThe setting is this, I've hidden a number of &quot;Snap Bands&quot; of various colors around the location, I want to make it so the player can only get one. Once a person has a snap band they are treated differently by the various npcs (Ie one might attack if you had a red, but let you go if you had a green), The effect I'm aiming for is once one band is found all the rest become invisible and effectively out of the game \nI've Tried this by using &quot;If statements that are nested, so if player has Red, they can't grab Yellow It works, and is easy, however as I plan on having a half dozen bands the  number of IF's i'd have to use seems excessive..\n\nIs there a way in making one script where I can essentially have it checking for multiple items in an inventory?  The way mentioned seems pretty lacking in elegance.",
      "EditableFormat": "bbcode",
      "HTML": "I'm a very new person to the program and just really started exploring it  a few days ago, so be kind if this is a dumb question<br/><br/>I have done very little programming in my time though I suppose I know a bit, in any case I've been alot of fun working with this program, it just has let my creativity soar. I've come up with a quandary..<br/><br/>The setting is this, I've hidden a number of &quot;Snap Bands&quot; of various colors around the location, I want to make it so the player can only get one. Once a person has a snap band they are treated differently by the various npcs (Ie one might attack if you had a red, but let you go if you had a green), The effect I'm aiming for is once one band is found all the rest become invisible and effectively out of the game <br/>I've Tried this by using &quot;If statements that are nested, so if player has Red, they can't grab Yellow It works, and is easy, however as I plan on having a half dozen bands the  number of IF's i'd have to use seems excessive..<br/><br/>Is there a way in making one script where I can essentially have it checking for multiple items in an inventory?  The way mentioned seems pretty lacking in elegance.",
      "PostDate": "2016-02-13T00:34:25+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "41183",
      "UserId": 0,
      "Username": "Talon",
      "UserAvatar": null,
      "UserGravatar": "3b6191c9adc337e83fec8e293e3fc584",
      "EditableText": "...I feel like an idiot,i just decided to try making one of the bands turn all the others invisible and just copy the code there to the others, changing the names.. this should work",
      "EditableFormat": "bbcode",
      "HTML": "...I feel like an idiot,i just decided to try making one of the bands turn all the others invisible and just copy the code there to the others, changing the names.. this should work",
      "PostDate": "2016-02-13T00:38:53+00:00",
      "LastEditDate": null
    }
  ]
}
