{
  "Topic": {
    "TopicId": "m0d4cx0o6uiabb9xpmxgqw",
    "ForumId": "10",
    "Title": "Editor Interface Glitch?",
    "LastUpdated": "2021-11-06T12:08:27.3637802Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "cb69e4b4-407c-4dcc-8ea4-c241deeba877",
      "UserId": 545958,
      "Username": "Qball101",
      "AvatarUrl": "https://secure.gravatar.com/avatar/66697160a0d0c35b4ad85955406fbe48?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Hi. Has this been happening to anyone else? I'm experiencing a weird visual bug where after mousing over things (buttons, tabs, drop-down menus, basically anything you can click on) they'll freak out and become completely  illegible. Sometimes it looks like they disappear, other times it looks like they're just really, _really_ zoomed in, so you can see about 1/4 of one letter and nothing else.\r\n\r\nThe buttons are still there. You can still click on them, but it's difficult to keep track of what's where when you can't see them properly. Funnily enough though, _playing_ a game works fine, it's just the editor giving me problems. I've tried basic things like restarting my computer, reinstalling Quest, running it as administrator, and nothing has worked so far.\r\n\r\nHas anyone encountered something like this?",
      "EditableFormat": "markdown",
      "HTML": "<p>Hi. Has this been happening to anyone else? I'm experiencing a weird visual bug where after mousing over things (buttons, tabs, drop-down menus, basically anything you can click on) they'll freak out and become completely  illegible. Sometimes it looks like they disappear, other times it looks like they're just really, <em>really</em> zoomed in, so you can see about 1/4 of one letter and nothing else.</p>\n<p>The buttons are still there. You can still click on them, but it's difficult to keep track of what's where when you can't see them properly. Funnily enough though, <em>playing</em> a game works fine, it's just the editor giving me problems. I've tried basic things like restarting my computer, reinstalling Quest, running it as administrator, and nothing has worked so far.</p>\n<p>Has anyone encountered something like this?</p>\n\n",
      "PostDate": "2021-11-06T12:08:27.3637802Z",
      "LastEditDate": null,
      "link": null
    }
  ]
}
