{
  "Topic": {
    "TopicId": "skw4ofquykettagiwgadxa",
    "ForumId": "10",
    "Title": "Saving and loading files",
    "LastUpdated": "2019-02-14T03:36:19.2908501Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "4f8378a5-4513-4fe9-b050-cbab2f391020",
      "UserId": 402177,
      "Username": "meobeou",
      "AvatarUrl": "https://secure.gravatar.com/avatar/6e8e093071dc86348fd6bf89f6c2b71c?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "khi chọn rèm cửa cho ngôi nhà của bạn, nghĩ suy đầu tiên của bạn sở hữu thể là vẻ đẹp - bạn sẽ muốn các dòng rèm cuốn hút vừa thích hợp vừa tôn lên vẻ đẹp và cảm giác của căn phòng. Rèm vải lanh là sự tuyển lựa xuất sắc cho bất kỳ căn phòng nào, nhưng rèm cửa bằng vải lanh hữu cơ là một chọn lọc đặc trưng tốt vì phổ thông lý do. [các mẫu rèm vải đẹp](https://rembachduong.vn/rem-vai)\r\n\r\nBí quyết chọn các kiểu rèm cửa đẹp nhất hiện nay\r\n\r\nVải lanh là 1 chất liệu vải đẹp. từ vẻ ngoài của sợi dệt cho tới phương pháp ánh sáng truyền qua nó, nó nhắc lên sự sang trọng và truyền thống tôn vinh thời kì. Trên thực tiễn, truyền thống dệt vải lanh đã mang từ hàng ngàn năm trước, và sở hữu thể nhắc rằng khi mọi thứ không tốt, chúng sẽ chóng vánh bị thay thế bằng thứ tốt hơn.\r\n\r\nkhông sở hữu gì rẻ hơn vải lanh cho tuổi thọ. Vẻ đẹp của nó ko bị giảm đi bởi thực tại là nó là 1 loại vải khó mặc và trong tương lai. Nó rửa sạch và coi ngó nó rất dễ dàng.\r\n\r\ndù rằng vải lanh là 1 tuyển lựa phải chăng, nhưng vải lanh hữu cơ còn là một tuyển lựa phải chăng hơn. các hóa chất liên quan tới việc trồng lanh khiến cho vải lanh theo phương pháp thông thường với thể gây hại cho môi trường. Phân bón với thể gây ra sự vững mạnh quá mức của tảo trên phố nước và khiến xáo trộn sự cân bằng của những loài thực vật khác. [rèm cửa sổ đẹp](https://rembachduong.vn/rem-cua-dep.html)\r\n\r\nThuốc trừ sâu sở hữu thể giết thịt chết động vật ăn giết mổ thực vật, nhưng cũng sở hữu thể giết mổ động vật hữu dụng, trực tiếp hoặc gián tiếp. Thuốc trừ sâu mang thể gây xáo trộn sự cân bằng của chuỗi thức ăn bằng cách thức thịt chết gần như - thí dụ như đầy đủ côn trùng trong khu vực, làm một số loài động vật tiến xa hơn trong chuỗi thức ăn mà không sở hữu nguồn thức ăn chính của chúng. Nguy cơ ô nhiễm theo các phương pháp khác cũng rất lớn, do có phổ biến chất độc được sử dụng trong những phương pháp canh tác thường nhật lúc trồng lanh.\r\n\r\nTop 5 Địa chỉ bán rèm sáo gỗ đẹp nhất Hà Nội - Toplist.vn\r\n\r\nko sở hữu gì để mất bằng phương pháp chọn vải lanh hữu cơ, và số đông mọi thứ để đạt được. Nó cũng khó mặc và đẹp không kém ở dạng thiên nhiên khi so sánh mang vải lanh thông thường, nhưng không sở hữu phổ thông nhược điểm của vải thường nhật.\r\n\r\nSo mang những chất liệu vải khác, vải lanh hữu cơ là 1 sự tuyển lựa lý tưởng. Hóa chất thường được thêm vào các chất liệu vải khác để khiến chúng trông hấp dẫn nhất trong công đoạn bảo quản và lúc trưng bày trong cửa hàng. những hóa chất này bao gồm những chất gây ung thư như formaldehyde sở hữu thể tồn tại trên vải trong một thời gian dài, làm bạn xúc tiếp sở hữu chất này.\r\n\r\nVải lanh rất linh hoạt trong bí quyết tiêu dùng. Rèm vải lanh của bạn mang thể là một lớp, cho phép ánh sáng mặt trời đi qua, thành ra minh họa cho kiểu dệt đẹp. Chúng sở hữu thể được lót để tránh ánh sáng mặt trời, nhưng cũng để cách nhiệt chống nóng. Điều này hoạt động theo cả hai bí quyết - nó giữ ấm bên trong ngôi nhà vào ngày lạnh, nhưng cũng sở hữu thể tỏa ra nhiệt của mùa hè khi cần thiết. [rèm cuốn cầu vồng](https://rembachduong.vn/rem-cau-vong)\r\n\r\nRèm vải lanh của bạn sẽ là 1 khoản đầu cơ sẽ ở lại mang bạn và tiếp diễn nâng cao căn phòng và ngôi nhà của bạn trong 1 thời kì dài sau này. Vải lanh hữu cơ là sự lựa chọn thấp nhất mà bạn với thể khiến ngôi nhà của mình. Vải lanh cũng sở hữu phổ biến lợi ích và cứng cáp sẽ mang đến cảm giác ấm áp và thoả thích cho cuộc sống của bạn.",
      "EditableFormat": "markdown",
      "HTML": "<p>khi chọn rèm cửa cho ngôi nhà của bạn, nghĩ suy đầu tiên của bạn sở hữu thể là vẻ đẹp - bạn sẽ muốn các dòng rèm cuốn hút vừa thích hợp vừa tôn lên vẻ đẹp và cảm giác của căn phòng. Rèm vải lanh là sự tuyển lựa xuất sắc cho bất kỳ căn phòng nào, nhưng rèm cửa bằng vải lanh hữu cơ là một chọn lọc đặc trưng tốt vì phổ thông lý do. <a href=\"https://rembachduong.vn/rem-vai\">các mẫu rèm vải đẹp</a></p>\n<p>Bí quyết chọn các kiểu rèm cửa đẹp nhất hiện nay</p>\n<p>Vải lanh là 1 chất liệu vải đẹp. từ vẻ ngoài của sợi dệt cho tới phương pháp ánh sáng truyền qua nó, nó nhắc lên sự sang trọng và truyền thống tôn vinh thời kì. Trên thực tiễn, truyền thống dệt vải lanh đã mang từ hàng ngàn năm trước, và sở hữu thể nhắc rằng khi mọi thứ không tốt, chúng sẽ chóng vánh bị thay thế bằng thứ tốt hơn.</p>\n<p>không sở hữu gì rẻ hơn vải lanh cho tuổi thọ. Vẻ đẹp của nó ko bị giảm đi bởi thực tại là nó là 1 loại vải khó mặc và trong tương lai. Nó rửa sạch và coi ngó nó rất dễ dàng.</p>\n<p>dù rằng vải lanh là 1 tuyển lựa phải chăng, nhưng vải lanh hữu cơ còn là một tuyển lựa phải chăng hơn. các hóa chất liên quan tới việc trồng lanh khiến cho vải lanh theo phương pháp thông thường với thể gây hại cho môi trường. Phân bón với thể gây ra sự vững mạnh quá mức của tảo trên phố nước và khiến xáo trộn sự cân bằng của những loài thực vật khác. <a href=\"https://rembachduong.vn/rem-cua-dep.html\">rèm cửa sổ đẹp</a></p>\n<p>Thuốc trừ sâu sở hữu thể giết thịt chết động vật ăn giết mổ thực vật, nhưng cũng sở hữu thể giết mổ động vật hữu dụng, trực tiếp hoặc gián tiếp. Thuốc trừ sâu mang thể gây xáo trộn sự cân bằng của chuỗi thức ăn bằng cách thức thịt chết gần như - thí dụ như đầy đủ côn trùng trong khu vực, làm một số loài động vật tiến xa hơn trong chuỗi thức ăn mà không sở hữu nguồn thức ăn chính của chúng. Nguy cơ ô nhiễm theo các phương pháp khác cũng rất lớn, do có phổ biến chất độc được sử dụng trong những phương pháp canh tác thường nhật lúc trồng lanh.</p>\n<p>Top 5 Địa chỉ bán rèm sáo gỗ đẹp nhất Hà Nội - Toplist.vn</p>\n<p>ko sở hữu gì để mất bằng phương pháp chọn vải lanh hữu cơ, và số đông mọi thứ để đạt được. Nó cũng khó mặc và đẹp không kém ở dạng thiên nhiên khi so sánh mang vải lanh thông thường, nhưng không sở hữu phổ thông nhược điểm của vải thường nhật.</p>\n<p>So mang những chất liệu vải khác, vải lanh hữu cơ là 1 sự tuyển lựa lý tưởng. Hóa chất thường được thêm vào các chất liệu vải khác để khiến chúng trông hấp dẫn nhất trong công đoạn bảo quản và lúc trưng bày trong cửa hàng. những hóa chất này bao gồm những chất gây ung thư như formaldehyde sở hữu thể tồn tại trên vải trong một thời gian dài, làm bạn xúc tiếp sở hữu chất này.</p>\n<p>Vải lanh rất linh hoạt trong bí quyết tiêu dùng. Rèm vải lanh của bạn mang thể là một lớp, cho phép ánh sáng mặt trời đi qua, thành ra minh họa cho kiểu dệt đẹp. Chúng sở hữu thể được lót để tránh ánh sáng mặt trời, nhưng cũng để cách nhiệt chống nóng. Điều này hoạt động theo cả hai bí quyết - nó giữ ấm bên trong ngôi nhà vào ngày lạnh, nhưng cũng sở hữu thể tỏa ra nhiệt của mùa hè khi cần thiết. <a href=\"https://rembachduong.vn/rem-cau-vong\">rèm cuốn cầu vồng</a></p>\n<p>Rèm vải lanh của bạn sẽ là 1 khoản đầu cơ sẽ ở lại mang bạn và tiếp diễn nâng cao căn phòng và ngôi nhà của bạn trong 1 thời kì dài sau này. Vải lanh hữu cơ là sự lựa chọn thấp nhất mà bạn với thể khiến ngôi nhà của mình. Vải lanh cũng sở hữu phổ biến lợi ích và cứng cáp sẽ mang đến cảm giác ấm áp và thoả thích cho cuộc sống của bạn.</p>\n\n",
      "PostDate": "2019-02-14T03:36:19.2908501Z",
      "LastEditDate": "2020-09-08T08:39:27.4222531Z",
      "link": null
    },
    {
      "PostId": "70e6a2dc-b171-4511-99f5-159c07c4281f",
      "UserId": 260569,
      "Username": "DarkLizerd",
      "AvatarUrl": "https://i.imgur.com/vjdH3t6b.jpg",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "I don't think you can...\r\nThe on-line editor lets you create files on-line, then, if you want to download it and work on your own computer, you can do that, BUT, you can't go the other way around... but then again, why would you want to do that???\r\nAlso, working on a downloaded copy give you many more options than the on-line version.\r\n\r\nIt's kinda like have a home PC, with internet, but going to the library to use theirs for a school report.\r\n",
      "EditableFormat": "markdown",
      "HTML": "<p>I don't think you can...<br>\nThe on-line editor lets you create files on-line, then, if you want to download it and work on your own computer, you can do that, BUT, you can't go the other way around... but then again, why would you want to do that???<br>\nAlso, working on a downloaded copy give you many more options than the on-line version.</p>\n<p>It's kinda like have a home PC, with internet, but going to the library to use theirs for a school report.</p>\n\n",
      "PostDate": "2019-02-14T05:07:02.6733848Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "b07a7a35-b308-49c9-84c4-d72afd16ef1b",
      "UserId": 384955,
      "Username": "camike",
      "AvatarUrl": "https://secure.gravatar.com/avatar/517e449158ed18227d3d539d61614f15?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "This article is very detailed and meticulous, I read a lot of articles on this topic, but for this article, you leave me a deep impression and practical application to my life. Thank you for sharing.\r\n<a href=\"https://templerun3.co\">temple run 3</a>",
      "EditableFormat": "markdown",
      "HTML": "<p>This article is very detailed and meticulous, I read a lot of articles on this topic, but for this article, you leave me a deep impression and practical application to my life. Thank you for sharing.<br>\n<a href=\"https://templerun3.co/\">temple run 3</a></p>\n\n",
      "PostDate": "2019-02-16T02:20:05.2712588Z",
      "LastEditDate": null,
      "link": null
    }
  ]
}
