{
  "Topic": {
    "TopicId": "y9fxissgjuuc_jg9aqbkcw",
    "ForumId": "10",
    "Title": "Where should I start? ",
    "LastUpdated": "2019-09-18T21:58:36.0071978Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "37d51484-d3bd-46d7-977b-b4d449cb9f2d",
      "UserId": 35488,
      "Username": "Mr.spiderhands",
      "AvatarUrl": "https://secure.gravatar.com/avatar/f519a1fe7cf8bb3e430846c33f80b6b2?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Hello all, I've created a simple game, yet I wish to build it into an rpg and I was wondering where to start learning code and what everything means instead of simply copying and pasting blocks of text that I don't really understand, or simply following along mindlessly to a YouTube video.\r\nI am new to all of this - - wtf is a library, what is its purpose? To contain a certain set of actions or principles in the game which require huge chunks of text/code?\r\nHow should I go about learning what the heck I'm doing to create a simple game first, and then build my way up to understanding more code and what things mean?\r\n I'm sorry for my ignorance.\r\nThere's so many things I don't understand - - where should I learn the basics from? Thank you in advance for your patience with me, and for your time. ",
      "EditableFormat": "markdown",
      "HTML": "<p>Hello all, I've created a simple game, yet I wish to build it into an rpg and I was wondering where to start learning code and what everything means instead of simply copying and pasting blocks of text that I don't really understand, or simply following along mindlessly to a YouTube video.<br>\nI am new to all of this - - wtf is a library, what is its purpose? To contain a certain set of actions or principles in the game which require huge chunks of text/code?<br>\nHow should I go about learning what the heck I'm doing to create a simple game first, and then build my way up to understanding more code and what things mean?<br>\nI'm sorry for my ignorance.<br>\nThere's so many things I don't understand - - where should I learn the basics from? Thank you in advance for your patience with me, and for your time.</p>\n\n",
      "PostDate": "2019-09-18T21:58:36.0071978Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "ae074966-e03c-4bf8-be42-35521e686013",
      "UserId": 5574,
      "Username": "R2T1",
      "AvatarUrl": "http://i.imgur.com/32ogfqMb.jpg",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "So, how have you created your \"simple game\"? Using what tool? Is it available for us to look at / play/ critique/ suggest better?\r\n\r\nHave you read through the docs yet? ```(see link below in Resources)``` Then after you have tried all that, start asking **specific** questions here in the forums . There are myriad places on the WWW for learning. Look for JavaScript to start with **after** you have got your game up and running using the Quest IDE.\r\nAnd in order to be good at it, patience & persistence work wonders. Also don't forget to save your work as you go and create additional backups. Don't be afraid to try things and keep trying until they are right. \r\n",
      "EditableFormat": "markdown",
      "HTML": "<p>So, how have you created your \"simple game\"? Using what tool? Is it available for us to look at / play/ critique/ suggest better?</p>\n<p>Have you read through the docs yet? <code>(see link below in Resources)</code> Then after you have tried all that, start asking <strong>specific</strong> questions here in the forums . There are myriad places on the WWW for learning. Look for JavaScript to start with <strong>after</strong> you have got your game up and running using the Quest IDE.<br>\nAnd in order to be good at it, patience &amp; persistence work wonders. Also don't forget to save your work as you go and create additional backups. Don't be afraid to try things and keep trying until they are right.</p>\n\n",
      "PostDate": "2019-09-19T03:01:19.1717446Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "ba74425d-fe07-4eed-a97a-3f6755dee409",
      "UserId": 247325,
      "Username": "hegemonkhan",
      "AvatarUrl": "https://secure.gravatar.com/avatar/a96cf34d8d97c57de38f54ee22b1759b?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "(filler for getting my edited post, updated/posted)\r\n\r\n------------\r\n\r\nI'd be glad to help out!\r\n\r\nI found quest like 7 years ago (geez, where has the time gone, sighs), knowing absolutely nothing about programming/coding, and through quest (and its very helpful community, the site mods and the users), I'm now taking programming classes in college towards a degree in computer science (programming/coding)\r\n\r\nthe very first thing that you experience:\r\n\r\nOVERWHELMED\r\n\r\nas your post demonstrates, this is very normal\r\n\r\nyou can see me, trying to learn quest and its programming for my first time here:\r\n\r\nhttps://textadventures.co.uk/forum/quest/topic/3348/noobie-hks-help-me-thread\r\n\r\n-------\r\n\r\nI would personally start out with the very basics of learning to work directly in quest's code, as it'll make things so much easier and faster (the GUI/Editor is much more clunky, especially in trying to explain/walkthrough using it, as it's a lot more work for us/me, than in being able to use code directly to help out you)\r\n\r\nso... let's get started...\r\n\r\n(hopefully, you're using a PC, if you're using an Apple computer... hopefully you can figure out how to do the same stuff with it)\r\n\r\n-----------\r\n\r\n1. first and foremost for coding, we need a good text editor software, for reading/writing/editing/fixing-troubleshooting/etc your coding, for a PC (I don't think this text editor software works for Apple computers), I highly recommend downloading and installing this advanced and totally free text editor software: https://notepad-plus-plus.org\r\n\r\nfor notepad++, once its downloaded and installed, and when it's opened up, at the top menu bar, under 'languages', select 'XML' as this works fine for quest's own unique 'aslx' language, all the color coding will match up correctly for you, when writing code for your quest game files and/or library files\r\n\r\nif you're using an Apple computer, maybe you know of a free advanced text editor software you can get/use\r\n\r\nbut if worse comes to worse, you can always use the built-in text editor softwares that all computers have, but they don't have as fancy useful tools to use, so it'll be a bit more work in using them, but the built-in text editor programs/software:\r\n\r\nPC: notepad, wordpad, etc?\r\nApple: text editor / textedit.app / whatever it is, meh, lol, etc?\r\n\r\n----------\r\n\r\n2. just for a \"fun\" start, let's code in your own default new game!\r\n\r\n(hopefully, you won't have any issues... as I'm using an older version of quest... hopefully everything I tell you to do, will still work with the current version of quest)\r\n\r\nopen up your text editor, and start a new/blank text editor page\r\n\r\nand while you can just copy and paste, it'd be good practice to get used to typing/writing it in yourself, to get a feel for how you write/type/code in code! As it takes a bit of time-practice to get used to it.. so, instead of copy and pasting the below, type/write it in yourself to your new/blank text editor page, okay? (as, another reason, is to get you used to having to go back and check and fix it for typos/spelling/etc-mistakes... this is actually like 90% of a programmer's time, even professionals, laughs. As a single typo means that the code/program doesn't work, has errors, and/or crashes, lol. Programmers/Coders quickly become spelling/typo/mistake checking nazis, we can write stuff with usually ZERO typos, spelling, etc mistakes, we can write/type usually 100% free of any typos/spelling/etc-mistakes, lol)\r\n\r\nI just checked, okay the current version is '580' (so hopefully my code below will work for you, lol)\r\n\r\nso in your text edit new/blank page, type in the below:\r\n\r\n```\r\n<asl version=\"580\">\r\n</asl>\r\n```\r\n\r\nand name it as 'example_game_file' with the extension of: .aslx\r\n\r\n(if you need help with how to work with the extensions, let me know, as they can be hidden, the computer settings can toggle showing/hiding the extensions, so you may not realize you got something like this, for an example: example_game_file.aslx.txt)\r\n\r\nso the file should be:\r\n\r\nexample_game_file.aslx\r\n\r\nif everything was done right, you created your 'asl' GAME OBJECT within your 'example_game_file.aslx' game file\r\n\r\n-----\r\n\r\nabout the coding:\r\n\r\nfor both human languages and computer languages, we need 'markers/tags' for when a line-sentence/block-paragraph begins and ends, so:\r\n\r\n```\r\n// IMPORTANT: programing's/coding's syntax (form/format/pattern) is confusing... it just takes time... so don't worry if it confuses you and screws you up (we can easily fix it up for you, so don't worry about any \"scary\" errors or you game not even opening up, it's just a matter of fixing up the bad syntax, lol), so if the below confuses you, don't worry about it\r\n\r\n// usually code is done vertically (\"as a block\"), as it is human-friendly (human readable/understandable), but if its just a simple/small/short piece of coding, then it's done horizontally (\"as a line\")\r\n\r\n// so, for example, we could do it all horizontal, which the computer has no problem with at all, but WE do... so we don't do this... as WE are part of coding... lol (if not already happening, computers will write their own code all by themselves... which is quite scary...):\r\n\r\n<asl version=\"580\"></asl>\r\n\r\n// but we like this better (as there's a lot that we're going to put inside of it):\r\n\r\n// start of the 'asl' tag block, which is known as the HEADER/SIGNATURE, as it has special required parameters in it (version=\"580\"), see the line directly below:\r\n\r\n<asl version=\"580\">\r\n\r\n  // MASS OF CODE (you entire game content), as this 'asl' tag block is your GAME OBJECT, everything must be here, inside of it\r\n\r\n</asl>\r\n\r\n// end of the 'asl' tab block (see the line directly above)\r\n```\r\n\r\n------\r\n\r\nso, lets now continue... (open back up your 'example_game_file.aslx' game file, via for a pc, right click on it and choose 'open' and then select the text editor software you used, if using an Apple, hopefully you know how to do the same thing with it, lol)\r\n\r\n(you can NOT just double click on it to open it, as its a quest file, due to the '.aslx' extension on it, well, it may try to open up using your quest GUI/Editor software... which might work... but I think you'll get an error/failure... as we still got more to add into it to make it a working quest game file that the quest software GUI/Editor can open up... meh whatever, just don't try to open it via double clicking on it right now, lol, as we want to open it up into the text editor that we were using right now anyways)\r\n\r\n(I'm assuming you use the 'english' language... lol)\r\n\r\n```\r\n<asl version=\"580\">\r\n\r\n  <include ref=\"English.aslx\" />\r\n  <include ref=\"Core.aslx\" />\r\n\r\n</asl>\r\n```\r\n\r\nnotice how the 'include refs' are horizontal lines of code, as they're small/short, we're writing them horizontally (as a line), and we probably have to as well, as quest might not be set up to understand them as vertical blocks, lol\r\n\r\n```\r\n// IMPORTANT: programing's/coding's syntax (form/format/pattern) is confusing... it just takes time... so don't worry if it confuses you and screws you up (we can easily fix it up for you, so don't worry about any \"scary\" errors or you game not even opening up, it's just a matter of fixing up the bad syntax, lol), so if the below confuses you, don't worry about it\r\n\r\nbeginning of line and its beginning tag: <\r\nending of line and its ending tag: />\r\n\r\n[beginning of line and its beginning tag]<include ref=\"English.aslx\" />[ending of line and its ending tag]\r\n\r\nbut there's some other forms too, so there's jsut some differences that you got to memorize, for example, an String Attribute tag line:\r\n\r\n<attr name=\"shape\" type=\"string\">circle</attr> \r\nVS\r\n<include ref=\"English.aslx\" />\r\n\r\nsee how this is a bit different in its form/pattern/\"syntax\" than the 'include ref' tag line? it just takes time to get used to the differences and which goes to which, lol\r\n\r\nbeginning line and its begin and end tags: <attr name=\"shape\" type=\"string\">\r\nending line and its begin and end tags: </attr>\r\n\r\nVS\r\n\r\nbeginning line and its begin tag:<include ref=\"English.aslx\"\r\nending line and its end tag: />\r\n```\r\n\r\nnow, we've just added in the quest engine library files: the 'English.aslx' and the 'Core.aslx' library files (they have the same '.aslx' extension as game files, as they're just both (game files and library files) just quest files, which is the '.aslx' extension that the quest software uses)\r\n\r\nwhat these two code lines do:\r\n\r\n('include ref'): quest will search for these (quest engine) library files, open them up, and copy and paste their contents into the game file (your 'example_game_file.aslx' for this example/case)\r\n\r\nthat's all that a library file is, it hold code, which gets copy and pasted into the game or whatever software/program (.exe)\r\n\r\nalso, a game file, just holds code too, but usually it has some required specific coding that is needed for it to work as a game file, lol\r\n\r\nyou don't have to use library files at all, you can just have all of your code within the game or whatever software/program (.exe), but as your game/software gets bigger and bigger, you use library files to organize/compartmentalize it, making it much easier to work with and control, and/or edit/fix up.\r\n\r\nI'll explain more directly an detailedly about library files usage later on... so don't worry...\r\n\r\n------\r\n\r\nanyways... let's keep going... (continuing to add in more required coding for our game file to work)\r\n\r\n```\r\n<asl version=\"580\">\r\n\r\n  <include ref=\"English.aslx\" />\r\n  <include ref=\"Core.aslx\" />\r\n\r\n  <game name=\"NAME_OF_GAME\">\r\n  </game>\r\n\r\n</asl>\r\n```\r\n\r\nthe 'game' Object is a special and required Object, which holds the game-wide settings, the publishing info (author, firstpublished, 'gameid' for quest online servers, version, difficulty, cruelty, description, category, etc), the special 'start' Script, the 'pov' feature stuff, and maybe a few more types of stuff too, meh\r\n\r\nthis is the same 'game' Object that you see in the GUI/Editor's \"tree of stuff\" on the left side:\r\n\r\n```\r\nObjects\r\n-> game <------------------ HERE\r\n->-> verbs\r\n->-> Commands\r\n-> room\r\n->-> player\r\nFunctions\r\nTimers\r\nWalkthrough\r\nAdvanced\r\n-> Included Libraries\r\n->-> English.aslx <-------------------- ALSO, DO THESE LOOK FAMILIAR? (WINK)\r\n->-> Core.aslx <-------------------- ALSO, DO THESE LOOK FAMILIAR? (WINK)\r\n-> Templates\r\n-> Dynamic Templates\r\n-> Object Types\r\n-> JavaScript\r\n```\r\n\r\n-----\r\n\r\nI've been lazy, as I've still never tested if even if not working online... if you still need to put in a 'gameid' or not...\r\n\r\nbut, let's just do so, to be safe... along with a few other of the settings (Attributes) within the 'game' Object, okay?\r\n\r\nthe 'gameid' is just a randomly generated (if using the quest GUI/editor) hash-string (as it needs to be unique, hence the random generation), to ID one person's game from another person's game, mainly for the online servers, when you publish/upload your game to them\r\n\r\n(I just take a randomly generated 'gameid' from a game I've created through the GUI/Editor and retype them, very carefully, here, lol, just to be safe, as I'm not sure if they have any types of requirements, like length, pattern type, and whatever else, so that's why I just don't type in some random hash-string on my own)\r\n\r\n```\r\n<asl version=\"580\">\r\n\r\n  <include ref=\"English.aslx\" />\r\n  <include ref=\"Core.aslx\" />\r\n\r\n  <game name=\"NAME_OF_GAME\">\r\n\r\n    <attr name=\"gameid\" type=\"string\">2e475718-3650-42b4-8c7e-9f847834149d</attr>\r\n\r\n    <attr name=\"author\" type=\"string\">NAME_OF_AUTHOR</attr>\r\n\r\n    <attr name=\"version\" type=\"string\">1.0</attr>\r\n\r\n    <attr name=\"firstpublished\" type=\"string\">2019</attr>\r\n\r\n  </game>\r\n\r\n</asl>\r\n```\r\n\r\nguess what, you just added in some Attributes (\"settings/controls/options\") for the 'game' Object, which is the same thing as done through the GUI/Editor:\r\n\r\n'game' Object -> 'setup' Tab -> \"game name\", author, version, firstpublished, and gameid\r\n\r\nfor a challenge, see if you can code in the 'subtitle' Attribute yourself!\r\n\r\nanswer:\r\n\r\n(you can write it in, anywhere within the 'game' tag block)\r\n\r\n```\r\n<asl version=\"580\">\r\n\r\n  <include ref=\"English.aslx\" />\r\n  <include ref=\"Core.aslx\" />\r\n\r\n  <game name=\"NAME_OF_GAME\">\r\n\r\n    <attr name=\"gameid\" type=\"string\">2e475718-3650-42b4-8c7e-9f847834149d</attr>\r\n\r\n    <attr name=\"author\" type=\"string\">NAME_OF_AUTHOR</attr>\r\n\r\n    <attr name=\"version\" type=\"string\">1.0</attr>\r\n\r\n    <attr name=\"firstpublished\" type=\"string\">2019</attr>\r\n\r\n    <attr name=\"subtitle\" type=\"string\">SUBTITLE</attr>\r\n\r\n  </game>\r\n\r\n</asl>\r\n```\r\n\r\n(for example)\r\n\r\n```\r\n<asl version=\"580\">\r\n\r\n  <include ref=\"English.aslx\" />\r\n  <include ref=\"Core.aslx\" />\r\n\r\n  <game name=\"NAME_OF_GAME\">\r\n\r\n    <attr name=\"subtitle\" type=\"string\">SUBTITLE</attr>\r\n\r\n    <attr name=\"gameid\" type=\"string\">2e475718-3650-42b4-8c7e-9f847834149d</attr>\r\n\r\n    <attr name=\"author\" type=\"string\">NAME_OF_AUTHOR</attr>\r\n\r\n    <attr name=\"version\" type=\"string\">1.0</attr>\r\n\r\n    <attr name=\"firstpublished\" type=\"string\">2019</attr>\r\n\r\n  </game>\r\n\r\n</asl>\r\n```\r\n\r\n(another example)\r\n\r\n```\r\n<asl version=\"580\">\r\n\r\n  <include ref=\"English.aslx\" />\r\n  <include ref=\"Core.aslx\" />\r\n\r\n  <game name=\"NAME_OF_GAME\">\r\n\r\n    <attr name=\"gameid\" type=\"string\">2e475718-3650-42b4-8c7e-9f847834149d</attr>\r\n\r\n    <attr name=\"author\" type=\"string\">NAME_OF_AUTHOR</attr>\r\n\r\n    <attr name=\"subtitle\" type=\"string\">SUBTITLE</attr>\r\n\r\n    <attr name=\"version\" type=\"string\">1.0</attr>\r\n\r\n    <attr name=\"firstpublished\" type=\"string\">2019</attr>\r\n\r\n  </game>\r\n\r\n</asl>\r\n```\r\n\r\n-----------\r\n\r\nanyways... let's finish it up (as I'm getting tired... lol), the last remaining required stuff, for the default (well, nearly default, as we added in some Attributes already, lol) new game we're coding in directly ourselves:\r\n\r\n(no explanations, but hopefully you'll understand now a bit what we're doing, without me having to explain it)\r\n\r\n```\r\n<asl version=\"580\">\r\n\r\n  <include ref=\"English.aslx\" />\r\n  <include ref=\"Core.aslx\" />\r\n\r\n  <game name=\"NAME_OF_GAME\">\r\n\r\n    <attr name=\"gameid\" type=\"string\">2e475718-3650-42b4-8c7e-9f847834149d</attr>\r\n\r\n    <attr name=\"author\" type=\"string\">NAME_OF_AUTHOR</attr>\r\n\r\n    <attr name=\"subtitle\" type=\"string\">SUBTITLE</attr>\r\n\r\n    <attr name=\"version\" type=\"string\">1.0</attr>\r\n\r\n    <attr name=\"firstpublished\" type=\"string\">2019</attr>\r\n\r\n  </game>\r\n\r\n  <object name=\"room\">\r\n\r\n    <inherit name=\"editor_room\" />\r\n\r\n  </object>\r\n\r\n  <object name=\"player\">\r\n\r\n    <inherit name=\"editor_object\" />\r\n    <inherit name=\"editor_player\" />\r\n\r\n    <attr name=\"parent\" type=\"object\">room</attr>\r\n\r\n  </object>\r\n\r\n</asl>\r\n```\r\n\r\nand finally to wrap it up:\r\n\r\n1. save it\r\n\r\n2. close out of it\r\n\r\n3. double click on it (and hopefully, it will open up with/into quest and its GUI/Editor... if not, let me know, as there might be a mistake in your code, or might be other outside issues that I can see if I can figure out for you, for an example, the quest software may not be able to find your game file on the desktop and/or is blocked from doing so... we can try to move your game file into the same folder as your 'quest.exe' quest program/software as a fix to this issue)\r\n\r\n4. study what you've done in coding through the GUI/Editor, and see if you can learn and match up the coding to the GUI/Editor's controls/tabs/features/options/settings/etc\r\n\r\n5. try to play/run your game file too (not anything really to see/do though, aside from seeing some of the Attributes being displayed: game name, the subtitle, and whatever else might be displayed, meh)\r\n\r\n6. play around... go back and try to code in more stuff on your own, then check it in the GUI/Editor (assuming hopefully it'll open up... if not... see if you can find your mistake in coding... or let me/us know, and we'll find/fix your code up for you), or, do something in the GUI/Editor, and then see what it looks like in code (at the top menu bar, between the 'player' and '?-help' buttons, there should be a notepaper like button, this is a toggle between the GUI/Editor mode and the Code View mode (this is the full game code view), hopefully the current version hasn't changed any of this (unlikely, lol, I hope)\r\n\r\n7. don't worry if you get errors, if it won't play, if it won't even open into the GUI/Editor, if it crashes, etc etc etc. BECAUSE: you can ALWAYS open up your game file with a text editor software, and fix the code (usually it's some stupid small typos, spelling-mistakes, etc mess ups, lol), which is the cause of all of these \"scary\" things, lol\r\n\r\nsee if you can learn/research some stuff on your own through the quest doc resource page(s):\r\n\r\nhttps://docs.textadventures.co.uk/quest/\r\n\r\nhttps://docs.textadventures.co.uk/quest/elements/\r\n\r\nhttps://docs.textadventures.co.uk/quest/types/\r\n\r\nhttps://docs.textadventures.co.uk/quest/elements/game.html\r\n\r\nhttps://docs.textadventures.co.uk/quest/elements/object.html\r\n\r\nhttps://docs.textadventures.co.uk/quest/attributes.html\r\n\r\nhttps://docs.textadventures.co.uk/quest/scripts/\r\n\r\nhttps://docs.textadventures.co.uk/quest/functions/ (categorical order)\r\nhttps://docs.textadventures.co.uk/quest/functions/index_allfunctions.html (alphabetical order)\r\n\r\n------------\r\n\r\nthen you can move on to learning the next most important stuff:\r\n\r\n(\"scripting\"):\r\n1. Attribute usage\r\n2. the 'if' Script\r\n\r\nas when especially combined together, these two things enable 90% of EVERYTHING that you could/might-want to do for/within your game!\r\n\r\nas can be seen, we have very diminishing returns, after learning how to do scripting (Attribute usage and the 'if' Script)\r\n\r\nlearning the more advanced Attributes (Lists and Dictionaries) only gets us 5% more ability for game content, moving us to now 95% of being able to do for whatever within your game, lol\r\n\r\nlearning even more advanced coding stuff... has even more diminishing returns... on what it adds to what can be done with your game\r\n\r\nonce, you've learned how to do the lists and dictionaries (which are very important/useful/powerful, despite that I said that they only add 5% more, lol), you have everything you need to make a full on RPG of your own (excluding the graphics/etc, lol -- quest does have some capabilities for even graphics as well, but that's beyond my own coding ability, but others can help with that stuff, and there's lots of resources on it too, I've just not gotten around yet to learning it myself, laziness.. lol)\r\n\r\n--------\r\n\r\nhere's some more resources of others and my own (you can try using them, but I'm not the best at explaining stuff... this entire post, might very well have just confused you more, lol... I try though to help... meh, so if you try any of my resources/guides below and they don't have at all, then just get help from others, as they can explain and help much better than usually I can/do, lol, or you can ask me for help or explaining anything in my resources/guides below, but you're probably better off just getting others to help you, lol):\r\n\r\nhttp://textadventures.co.uk/forum/general/topic/ljjm32av4e2t9ot49k478g/help#710be61e-eae1-4af1-8363-520cc718ba1c\r\n\r\nhttp://textadventures.co.uk/forum/quest/topic/mu7itzjqv0yxrkdwgsbmzg/how-to-make-npc-confront-you-with-chioces#46cdb25b-4767-40a6-8bf4-3cd84e805781 (this goes into more detail of all this stuff we just did now in this post, along with going into library usage detail, so if you want to learn about libraries you can try this link of mine, or use the quest doc guide on using libraries, or get help on them from otehrs)\r\n\r\nhttp://textadventures.co.uk/forum/samples/topic/5559/attributes-and-if-script-guide-by-hk (this is my guide on \"scripting\": Attribute usage and the 'if' script, but I got a lot of more general stuff at the top... scroll down a bit to get to the scripting stuff: Attribute usage and the 'if' Script, again not the best at explaining, so if too confusing/convoluted, use the quest docs, as it covers this stuff, and/or get help from others)\r\n\r\nhttp://textadventures.co.uk/forum/samples/topic/5137/list-and-dictionary-extensive-guide-by-hk (and/if when you're ready, here's my guide on lists and dictionaries that you can try, again not the best at explaining stuff... or use the quest doc resources/guides on using lists/dictionaries, or get help from others)\r\n\r\nanyways, hope you keep at it, and learn to use quest and its coding... and maybe even going on to learning more coding... hehe :D\r\n\r\n------\r\n\r\noops... forgot one thing...\r\n\r\nhere's what it would look like horizontally:\r\n\r\n```\r\n<asl version=\"580\"><include ref=\"English.aslx\" /><include ref=\"Core.aslx\" /><game name=\"NAME_OF_GAME\"><attr name=\"gameid\" type=\"string\">2e475718-3650-42b4-8c7e-9f847834149d</attr><attr name=\"author\" type=\"string\">NAME_OF_AUTHOR</attr><attr name=\"subtitle\" type=\"string\">SUBTITLE</attr><attr name=\"version\" type=\"string\">1.0</attr><attr name=\"firstpublished\" type=\"string\">2019</attr></game><object name=\"room\"><inherit name=\"editor_room\" /></object><object name=\"player\"><inherit name=\"editor_object\" /><inherit name=\"editor_player\" /><attr name=\"parent\" type=\"object\">room</attr></object></asl>\r\n```\r\n\r\nthis should work fine... the computer has absolutely no problem with this... BUT WE HUMANS DO! YUCK! lol\r\n\r\nwe much prefer vertical blocks/lines of code like this:\r\n\r\n```\r\n<asl version=\"580\">\r\n\r\n  <include ref=\"English.aslx\" />\r\n\r\n  <include ref=\"Core.aslx\" />\r\n\r\n  <game name=\"NAME_OF_GAME\">\r\n\r\n    <attr name=\"gameid\" type=\"string\">2e475718-3650-42b4-8c7e-9f847834149d</attr>\r\n\r\n    <attr name=\"author\" type=\"string\">NAME_OF_AUTHOR</attr>\r\n\r\n    <attr name=\"subtitle\" type=\"string\">SUBTITLE</attr>\r\n\r\n    <attr name=\"version\" type=\"string\">1.0</attr>\r\n\r\n    <attr name=\"firstpublished\" type=\"string\">2019</attr>\r\n\r\n  </game>\r\n\r\n  <object name=\"room\">\r\n\r\n    <inherit name=\"editor_room\" />\r\n\r\n  </object>\r\n\r\n  <object name=\"player\">\r\n\r\n    <inherit name=\"editor_object\" />\r\n\r\n    <inherit name=\"editor_player\" />\r\n\r\n    <attr name=\"parent\" type=\"object\">room</attr>\r\n\r\n  </object>\r\n\r\n</asl>\r\n```",
      "EditableFormat": "markdown",
      "HTML": "<p>(filler for getting my edited post, updated/posted)</p>\n<hr>\n<p>I'd be glad to help out!</p>\n<p>I found quest like 7 years ago (geez, where has the time gone, sighs), knowing absolutely nothing about programming/coding, and through quest (and its very helpful community, the site mods and the users), I'm now taking programming classes in college towards a degree in computer science (programming/coding)</p>\n<p>the very first thing that you experience:</p>\n<p>OVERWHELMED</p>\n<p>as your post demonstrates, this is very normal</p>\n<p>you can see me, trying to learn quest and its programming for my first time here:</p>\n<p>https://textadventures.co.uk/forum/quest/topic/3348/noobie-hks-help-me-thread</p>\n<hr>\n<p>I would personally start out with the very basics of learning to work directly in quest's code, as it'll make things so much easier and faster (the GUI/Editor is much more clunky, especially in trying to explain/walkthrough using it, as it's a lot more work for us/me, than in being able to use code directly to help out you)</p>\n<p>so... let's get started...</p>\n<p>(hopefully, you're using a PC, if you're using an Apple computer... hopefully you can figure out how to do the same stuff with it)</p>\n<hr>\n<ol>\n<li>first and foremost for coding, we need a good text editor software, for reading/writing/editing/fixing-troubleshooting/etc your coding, for a PC (I don't think this text editor software works for Apple computers), I highly recommend downloading and installing this advanced and totally free text editor software: https://notepad-plus-plus.org</li>\n</ol>\n<p>for notepad++, once its downloaded and installed, and when it's opened up, at the top menu bar, under 'languages', select 'XML' as this works fine for quest's own unique 'aslx' language, all the color coding will match up correctly for you, when writing code for your quest game files and/or library files</p>\n<p>if you're using an Apple computer, maybe you know of a free advanced text editor software you can get/use</p>\n<p>but if worse comes to worse, you can always use the built-in text editor softwares that all computers have, but they don't have as fancy useful tools to use, so it'll be a bit more work in using them, but the built-in text editor programs/software:</p>\n<p>PC: notepad, wordpad, etc?<br>\nApple: text editor / textedit.app / whatever it is, meh, lol, etc?</p>\n<hr>\n<ol start=\"2\">\n<li>just for a \"fun\" start, let's code in your own default new game!</li>\n</ol>\n<p>(hopefully, you won't have any issues... as I'm using an older version of quest... hopefully everything I tell you to do, will still work with the current version of quest)</p>\n<p>open up your text editor, and start a new/blank text editor page</p>\n<p>and while you can just copy and paste, it'd be good practice to get used to typing/writing it in yourself, to get a feel for how you write/type/code in code! As it takes a bit of time-practice to get used to it.. so, instead of copy and pasting the below, type/write it in yourself to your new/blank text editor page, okay? (as, another reason, is to get you used to having to go back and check and fix it for typos/spelling/etc-mistakes... this is actually like 90% of a programmer's time, even professionals, laughs. As a single typo means that the code/program doesn't work, has errors, and/or crashes, lol. Programmers/Coders quickly become spelling/typo/mistake checking nazis, we can write stuff with usually ZERO typos, spelling, etc mistakes, we can write/type usually 100% free of any typos/spelling/etc-mistakes, lol)</p>\n<p>I just checked, okay the current version is '580' (so hopefully my code below will work for you, lol)</p>\n<p>so in your text edit new/blank page, type in the below:</p>\n<pre><code>&lt;asl version=\"580\"&gt;\n&lt;/asl&gt;\n</code></pre>\n<p>and name it as 'example_game_file' with the extension of: .aslx</p>\n<p>(if you need help with how to work with the extensions, let me know, as they can be hidden, the computer settings can toggle showing/hiding the extensions, so you may not realize you got something like this, for an example: example_game_file.aslx.txt)</p>\n<p>so the file should be:</p>\n<p>example_game_file.aslx</p>\n<p>if everything was done right, you created your 'asl' GAME OBJECT within your 'example_game_file.aslx' game file</p>\n<hr>\n<p>about the coding:</p>\n<p>for both human languages and computer languages, we need 'markers/tags' for when a line-sentence/block-paragraph begins and ends, so:</p>\n<pre><code>// IMPORTANT: programing's/coding's syntax (form/format/pattern) is confusing... it just takes time... so don't worry if it confuses you and screws you up (we can easily fix it up for you, so don't worry about any \"scary\" errors or you game not even opening up, it's just a matter of fixing up the bad syntax, lol), so if the below confuses you, don't worry about it\n\n// usually code is done vertically (\"as a block\"), as it is human-friendly (human readable/understandable), but if its just a simple/small/short piece of coding, then it's done horizontally (\"as a line\")\n\n// so, for example, we could do it all horizontal, which the computer has no problem with at all, but WE do... so we don't do this... as WE are part of coding... lol (if not already happening, computers will write their own code all by themselves... which is quite scary...):\n\n&lt;asl version=\"580\"&gt;&lt;/asl&gt;\n\n// but we like this better (as there's a lot that we're going to put inside of it):\n\n// start of the 'asl' tag block, which is known as the HEADER/SIGNATURE, as it has special required parameters in it (version=\"580\"), see the line directly below:\n\n&lt;asl version=\"580\"&gt;\n\n  // MASS OF CODE (you entire game content), as this 'asl' tag block is your GAME OBJECT, everything must be here, inside of it\n\n&lt;/asl&gt;\n\n// end of the 'asl' tab block (see the line directly above)\n</code></pre>\n<hr>\n<p>so, lets now continue... (open back up your 'example_game_file.aslx' game file, via for a pc, right click on it and choose 'open' and then select the text editor software you used, if using an Apple, hopefully you know how to do the same thing with it, lol)</p>\n<p>(you can NOT just double click on it to open it, as its a quest file, due to the '.aslx' extension on it, well, it may try to open up using your quest GUI/Editor software... which might work... but I think you'll get an error/failure... as we still got more to add into it to make it a working quest game file that the quest software GUI/Editor can open up... meh whatever, just don't try to open it via double clicking on it right now, lol, as we want to open it up into the text editor that we were using right now anyways)</p>\n<p>(I'm assuming you use the 'english' language... lol)</p>\n<pre><code>&lt;asl version=\"580\"&gt;\n\n  &lt;include ref=\"English.aslx\" /&gt;\n  &lt;include ref=\"Core.aslx\" /&gt;\n\n&lt;/asl&gt;\n</code></pre>\n<p>notice how the 'include refs' are horizontal lines of code, as they're small/short, we're writing them horizontally (as a line), and we probably have to as well, as quest might not be set up to understand them as vertical blocks, lol</p>\n<pre><code>// IMPORTANT: programing's/coding's syntax (form/format/pattern) is confusing... it just takes time... so don't worry if it confuses you and screws you up (we can easily fix it up for you, so don't worry about any \"scary\" errors or you game not even opening up, it's just a matter of fixing up the bad syntax, lol), so if the below confuses you, don't worry about it\n\nbeginning of line and its beginning tag: &lt;\nending of line and its ending tag: /&gt;\n\n[beginning of line and its beginning tag]&lt;include ref=\"English.aslx\" /&gt;[ending of line and its ending tag]\n\nbut there's some other forms too, so there's jsut some differences that you got to memorize, for example, an String Attribute tag line:\n\n&lt;attr name=\"shape\" type=\"string\"&gt;circle&lt;/attr&gt; \nVS\n&lt;include ref=\"English.aslx\" /&gt;\n\nsee how this is a bit different in its form/pattern/\"syntax\" than the 'include ref' tag line? it just takes time to get used to the differences and which goes to which, lol\n\nbeginning line and its begin and end tags: &lt;attr name=\"shape\" type=\"string\"&gt;\nending line and its begin and end tags: &lt;/attr&gt;\n\nVS\n\nbeginning line and its begin tag:&lt;include ref=\"English.aslx\"\nending line and its end tag: /&gt;\n</code></pre>\n<p>now, we've just added in the quest engine library files: the 'English.aslx' and the 'Core.aslx' library files (they have the same '.aslx' extension as game files, as they're just both (game files and library files) just quest files, which is the '.aslx' extension that the quest software uses)</p>\n<p>what these two code lines do:</p>\n<p>('include ref'): quest will search for these (quest engine) library files, open them up, and copy and paste their contents into the game file (your 'example_game_file.aslx' for this example/case)</p>\n<p>that's all that a library file is, it hold code, which gets copy and pasted into the game or whatever software/program (.exe)</p>\n<p>also, a game file, just holds code too, but usually it has some required specific coding that is needed for it to work as a game file, lol</p>\n<p>you don't have to use library files at all, you can just have all of your code within the game or whatever software/program (.exe), but as your game/software gets bigger and bigger, you use library files to organize/compartmentalize it, making it much easier to work with and control, and/or edit/fix up.</p>\n<p>I'll explain more directly an detailedly about library files usage later on... so don't worry...</p>\n<hr>\n<p>anyways... let's keep going... (continuing to add in more required coding for our game file to work)</p>\n<pre><code>&lt;asl version=\"580\"&gt;\n\n  &lt;include ref=\"English.aslx\" /&gt;\n  &lt;include ref=\"Core.aslx\" /&gt;\n\n  &lt;game name=\"NAME_OF_GAME\"&gt;\n  &lt;/game&gt;\n\n&lt;/asl&gt;\n</code></pre>\n<p>the 'game' Object is a special and required Object, which holds the game-wide settings, the publishing info (author, firstpublished, 'gameid' for quest online servers, version, difficulty, cruelty, description, category, etc), the special 'start' Script, the 'pov' feature stuff, and maybe a few more types of stuff too, meh</p>\n<p>this is the same 'game' Object that you see in the GUI/Editor's \"tree of stuff\" on the left side:</p>\n<pre><code>Objects\n-&gt; game &lt;------------------ HERE\n-&gt;-&gt; verbs\n-&gt;-&gt; Commands\n-&gt; room\n-&gt;-&gt; player\nFunctions\nTimers\nWalkthrough\nAdvanced\n-&gt; Included Libraries\n-&gt;-&gt; English.aslx &lt;-------------------- ALSO, DO THESE LOOK FAMILIAR? (WINK)\n-&gt;-&gt; Core.aslx &lt;-------------------- ALSO, DO THESE LOOK FAMILIAR? (WINK)\n-&gt; Templates\n-&gt; Dynamic Templates\n-&gt; Object Types\n-&gt; JavaScript\n</code></pre>\n<hr>\n<p>I've been lazy, as I've still never tested if even if not working online... if you still need to put in a 'gameid' or not...</p>\n<p>but, let's just do so, to be safe... along with a few other of the settings (Attributes) within the 'game' Object, okay?</p>\n<p>the 'gameid' is just a randomly generated (if using the quest GUI/editor) hash-string (as it needs to be unique, hence the random generation), to ID one person's game from another person's game, mainly for the online servers, when you publish/upload your game to them</p>\n<p>(I just take a randomly generated 'gameid' from a game I've created through the GUI/Editor and retype them, very carefully, here, lol, just to be safe, as I'm not sure if they have any types of requirements, like length, pattern type, and whatever else, so that's why I just don't type in some random hash-string on my own)</p>\n<pre><code>&lt;asl version=\"580\"&gt;\n\n  &lt;include ref=\"English.aslx\" /&gt;\n  &lt;include ref=\"Core.aslx\" /&gt;\n\n  &lt;game name=\"NAME_OF_GAME\"&gt;\n\n    &lt;attr name=\"gameid\" type=\"string\"&gt;2e475718-3650-42b4-8c7e-9f847834149d&lt;/attr&gt;\n\n    &lt;attr name=\"author\" type=\"string\"&gt;NAME_OF_AUTHOR&lt;/attr&gt;\n\n    &lt;attr name=\"version\" type=\"string\"&gt;1.0&lt;/attr&gt;\n\n    &lt;attr name=\"firstpublished\" type=\"string\"&gt;2019&lt;/attr&gt;\n\n  &lt;/game&gt;\n\n&lt;/asl&gt;\n</code></pre>\n<p>guess what, you just added in some Attributes (\"settings/controls/options\") for the 'game' Object, which is the same thing as done through the GUI/Editor:</p>\n<p>'game' Object -&gt; 'setup' Tab -&gt; \"game name\", author, version, firstpublished, and gameid</p>\n<p>for a challenge, see if you can code in the 'subtitle' Attribute yourself!</p>\n<p>answer:</p>\n<p>(you can write it in, anywhere within the 'game' tag block)</p>\n<pre><code>&lt;asl version=\"580\"&gt;\n\n  &lt;include ref=\"English.aslx\" /&gt;\n  &lt;include ref=\"Core.aslx\" /&gt;\n\n  &lt;game name=\"NAME_OF_GAME\"&gt;\n\n    &lt;attr name=\"gameid\" type=\"string\"&gt;2e475718-3650-42b4-8c7e-9f847834149d&lt;/attr&gt;\n\n    &lt;attr name=\"author\" type=\"string\"&gt;NAME_OF_AUTHOR&lt;/attr&gt;\n\n    &lt;attr name=\"version\" type=\"string\"&gt;1.0&lt;/attr&gt;\n\n    &lt;attr name=\"firstpublished\" type=\"string\"&gt;2019&lt;/attr&gt;\n\n    &lt;attr name=\"subtitle\" type=\"string\"&gt;SUBTITLE&lt;/attr&gt;\n\n  &lt;/game&gt;\n\n&lt;/asl&gt;\n</code></pre>\n<p>(for example)</p>\n<pre><code>&lt;asl version=\"580\"&gt;\n\n  &lt;include ref=\"English.aslx\" /&gt;\n  &lt;include ref=\"Core.aslx\" /&gt;\n\n  &lt;game name=\"NAME_OF_GAME\"&gt;\n\n    &lt;attr name=\"subtitle\" type=\"string\"&gt;SUBTITLE&lt;/attr&gt;\n\n    &lt;attr name=\"gameid\" type=\"string\"&gt;2e475718-3650-42b4-8c7e-9f847834149d&lt;/attr&gt;\n\n    &lt;attr name=\"author\" type=\"string\"&gt;NAME_OF_AUTHOR&lt;/attr&gt;\n\n    &lt;attr name=\"version\" type=\"string\"&gt;1.0&lt;/attr&gt;\n\n    &lt;attr name=\"firstpublished\" type=\"string\"&gt;2019&lt;/attr&gt;\n\n  &lt;/game&gt;\n\n&lt;/asl&gt;\n</code></pre>\n<p>(another example)</p>\n<pre><code>&lt;asl version=\"580\"&gt;\n\n  &lt;include ref=\"English.aslx\" /&gt;\n  &lt;include ref=\"Core.aslx\" /&gt;\n\n  &lt;game name=\"NAME_OF_GAME\"&gt;\n\n    &lt;attr name=\"gameid\" type=\"string\"&gt;2e475718-3650-42b4-8c7e-9f847834149d&lt;/attr&gt;\n\n    &lt;attr name=\"author\" type=\"string\"&gt;NAME_OF_AUTHOR&lt;/attr&gt;\n\n    &lt;attr name=\"subtitle\" type=\"string\"&gt;SUBTITLE&lt;/attr&gt;\n\n    &lt;attr name=\"version\" type=\"string\"&gt;1.0&lt;/attr&gt;\n\n    &lt;attr name=\"firstpublished\" type=\"string\"&gt;2019&lt;/attr&gt;\n\n  &lt;/game&gt;\n\n&lt;/asl&gt;\n</code></pre>\n<hr>\n<p>anyways... let's finish it up (as I'm getting tired... lol), the last remaining required stuff, for the default (well, nearly default, as we added in some Attributes already, lol) new game we're coding in directly ourselves:</p>\n<p>(no explanations, but hopefully you'll understand now a bit what we're doing, without me having to explain it)</p>\n<pre><code>&lt;asl version=\"580\"&gt;\n\n  &lt;include ref=\"English.aslx\" /&gt;\n  &lt;include ref=\"Core.aslx\" /&gt;\n\n  &lt;game name=\"NAME_OF_GAME\"&gt;\n\n    &lt;attr name=\"gameid\" type=\"string\"&gt;2e475718-3650-42b4-8c7e-9f847834149d&lt;/attr&gt;\n\n    &lt;attr name=\"author\" type=\"string\"&gt;NAME_OF_AUTHOR&lt;/attr&gt;\n\n    &lt;attr name=\"subtitle\" type=\"string\"&gt;SUBTITLE&lt;/attr&gt;\n\n    &lt;attr name=\"version\" type=\"string\"&gt;1.0&lt;/attr&gt;\n\n    &lt;attr name=\"firstpublished\" type=\"string\"&gt;2019&lt;/attr&gt;\n\n  &lt;/game&gt;\n\n  &lt;object name=\"room\"&gt;\n\n    &lt;inherit name=\"editor_room\" /&gt;\n\n  &lt;/object&gt;\n\n  &lt;object name=\"player\"&gt;\n\n    &lt;inherit name=\"editor_object\" /&gt;\n    &lt;inherit name=\"editor_player\" /&gt;\n\n    &lt;attr name=\"parent\" type=\"object\"&gt;room&lt;/attr&gt;\n\n  &lt;/object&gt;\n\n&lt;/asl&gt;\n</code></pre>\n<p>and finally to wrap it up:</p>\n<ol>\n<li>\n<p>save it</p>\n</li>\n<li>\n<p>close out of it</p>\n</li>\n<li>\n<p>double click on it (and hopefully, it will open up with/into quest and its GUI/Editor... if not, let me know, as there might be a mistake in your code, or might be other outside issues that I can see if I can figure out for you, for an example, the quest software may not be able to find your game file on the desktop and/or is blocked from doing so... we can try to move your game file into the same folder as your 'quest.exe' quest program/software as a fix to this issue)</p>\n</li>\n<li>\n<p>study what you've done in coding through the GUI/Editor, and see if you can learn and match up the coding to the GUI/Editor's controls/tabs/features/options/settings/etc</p>\n</li>\n<li>\n<p>try to play/run your game file too (not anything really to see/do though, aside from seeing some of the Attributes being displayed: game name, the subtitle, and whatever else might be displayed, meh)</p>\n</li>\n<li>\n<p>play around... go back and try to code in more stuff on your own, then check it in the GUI/Editor (assuming hopefully it'll open up... if not... see if you can find your mistake in coding... or let me/us know, and we'll find/fix your code up for you), or, do something in the GUI/Editor, and then see what it looks like in code (at the top menu bar, between the 'player' and '?-help' buttons, there should be a notepaper like button, this is a toggle between the GUI/Editor mode and the Code View mode (this is the full game code view), hopefully the current version hasn't changed any of this (unlikely, lol, I hope)</p>\n</li>\n<li>\n<p>don't worry if you get errors, if it won't play, if it won't even open into the GUI/Editor, if it crashes, etc etc etc. BECAUSE: you can ALWAYS open up your game file with a text editor software, and fix the code (usually it's some stupid small typos, spelling-mistakes, etc mess ups, lol), which is the cause of all of these \"scary\" things, lol</p>\n</li>\n</ol>\n<p>see if you can learn/research some stuff on your own through the quest doc resource page(s):</p>\n<p>https://docs.textadventures.co.uk/quest/</p>\n<p>https://docs.textadventures.co.uk/quest/elements/</p>\n<p>https://docs.textadventures.co.uk/quest/types/</p>\n<p>https://docs.textadventures.co.uk/quest/elements/game.html</p>\n<p>https://docs.textadventures.co.uk/quest/elements/object.html</p>\n<p>https://docs.textadventures.co.uk/quest/attributes.html</p>\n<p>https://docs.textadventures.co.uk/quest/scripts/</p>\n<p>https://docs.textadventures.co.uk/quest/functions/ (categorical order)<br>\nhttps://docs.textadventures.co.uk/quest/functions/index_allfunctions.html (alphabetical order)</p>\n<hr>\n<p>then you can move on to learning the next most important stuff:</p>\n<p>(\"scripting\"):</p>\n<ol>\n<li>Attribute usage</li>\n<li>the 'if' Script</li>\n</ol>\n<p>as when especially combined together, these two things enable 90% of EVERYTHING that you could/might-want to do for/within your game!</p>\n<p>as can be seen, we have very diminishing returns, after learning how to do scripting (Attribute usage and the 'if' Script)</p>\n<p>learning the more advanced Attributes (Lists and Dictionaries) only gets us 5% more ability for game content, moving us to now 95% of being able to do for whatever within your game, lol</p>\n<p>learning even more advanced coding stuff... has even more diminishing returns... on what it adds to what can be done with your game</p>\n<p>once, you've learned how to do the lists and dictionaries (which are very important/useful/powerful, despite that I said that they only add 5% more, lol), you have everything you need to make a full on RPG of your own (excluding the graphics/etc, lol -- quest does have some capabilities for even graphics as well, but that's beyond my own coding ability, but others can help with that stuff, and there's lots of resources on it too, I've just not gotten around yet to learning it myself, laziness.. lol)</p>\n<hr>\n<p>here's some more resources of others and my own (you can try using them, but I'm not the best at explaining stuff... this entire post, might very well have just confused you more, lol... I try though to help... meh, so if you try any of my resources/guides below and they don't have at all, then just get help from others, as they can explain and help much better than usually I can/do, lol, or you can ask me for help or explaining anything in my resources/guides below, but you're probably better off just getting others to help you, lol):</p>\n<p>http://textadventures.co.uk/forum/general/topic/ljjm32av4e2t9ot49k478g/help#710be61e-eae1-4af1-8363-520cc718ba1c</p>\n<p>http://textadventures.co.uk/forum/quest/topic/mu7itzjqv0yxrkdwgsbmzg/how-to-make-npc-confront-you-with-chioces#46cdb25b-4767-40a6-8bf4-3cd84e805781 (this goes into more detail of all this stuff we just did now in this post, along with going into library usage detail, so if you want to learn about libraries you can try this link of mine, or use the quest doc guide on using libraries, or get help on them from otehrs)</p>\n<p>http://textadventures.co.uk/forum/samples/topic/5559/attributes-and-if-script-guide-by-hk (this is my guide on \"scripting\": Attribute usage and the 'if' script, but I got a lot of more general stuff at the top... scroll down a bit to get to the scripting stuff: Attribute usage and the 'if' Script, again not the best at explaining, so if too confusing/convoluted, use the quest docs, as it covers this stuff, and/or get help from others)</p>\n<p>http://textadventures.co.uk/forum/samples/topic/5137/list-and-dictionary-extensive-guide-by-hk (and/if when you're ready, here's my guide on lists and dictionaries that you can try, again not the best at explaining stuff... or use the quest doc resources/guides on using lists/dictionaries, or get help from others)</p>\n<p>anyways, hope you keep at it, and learn to use quest and its coding... and maybe even going on to learning more coding... hehe :D</p>\n<hr>\n<p>oops... forgot one thing...</p>\n<p>here's what it would look like horizontally:</p>\n<pre><code>&lt;asl version=\"580\"&gt;&lt;include ref=\"English.aslx\" /&gt;&lt;include ref=\"Core.aslx\" /&gt;&lt;game name=\"NAME_OF_GAME\"&gt;&lt;attr name=\"gameid\" type=\"string\"&gt;2e475718-3650-42b4-8c7e-9f847834149d&lt;/attr&gt;&lt;attr name=\"author\" type=\"string\"&gt;NAME_OF_AUTHOR&lt;/attr&gt;&lt;attr name=\"subtitle\" type=\"string\"&gt;SUBTITLE&lt;/attr&gt;&lt;attr name=\"version\" type=\"string\"&gt;1.0&lt;/attr&gt;&lt;attr name=\"firstpublished\" type=\"string\"&gt;2019&lt;/attr&gt;&lt;/game&gt;&lt;object name=\"room\"&gt;&lt;inherit name=\"editor_room\" /&gt;&lt;/object&gt;&lt;object name=\"player\"&gt;&lt;inherit name=\"editor_object\" /&gt;&lt;inherit name=\"editor_player\" /&gt;&lt;attr name=\"parent\" type=\"object\"&gt;room&lt;/attr&gt;&lt;/object&gt;&lt;/asl&gt;\n</code></pre>\n<p>this should work fine... the computer has absolutely no problem with this... BUT WE HUMANS DO! YUCK! lol</p>\n<p>we much prefer vertical blocks/lines of code like this:</p>\n<pre><code>&lt;asl version=\"580\"&gt;\n\n  &lt;include ref=\"English.aslx\" /&gt;\n\n  &lt;include ref=\"Core.aslx\" /&gt;\n\n  &lt;game name=\"NAME_OF_GAME\"&gt;\n\n    &lt;attr name=\"gameid\" type=\"string\"&gt;2e475718-3650-42b4-8c7e-9f847834149d&lt;/attr&gt;\n\n    &lt;attr name=\"author\" type=\"string\"&gt;NAME_OF_AUTHOR&lt;/attr&gt;\n\n    &lt;attr name=\"subtitle\" type=\"string\"&gt;SUBTITLE&lt;/attr&gt;\n\n    &lt;attr name=\"version\" type=\"string\"&gt;1.0&lt;/attr&gt;\n\n    &lt;attr name=\"firstpublished\" type=\"string\"&gt;2019&lt;/attr&gt;\n\n  &lt;/game&gt;\n\n  &lt;object name=\"room\"&gt;\n\n    &lt;inherit name=\"editor_room\" /&gt;\n\n  &lt;/object&gt;\n\n  &lt;object name=\"player\"&gt;\n\n    &lt;inherit name=\"editor_object\" /&gt;\n\n    &lt;inherit name=\"editor_player\" /&gt;\n\n    &lt;attr name=\"parent\" type=\"object\"&gt;room&lt;/attr&gt;\n\n  &lt;/object&gt;\n\n&lt;/asl&gt;\n</code></pre>\n\n",
      "PostDate": "2019-09-19T09:43:18.4309234Z",
      "LastEditDate": "2019-09-19T10:12:55.4282577Z",
      "link": null
    },
    {
      "PostId": "6035a07e-530a-4fe0-848b-a4a397286382",
      "UserId": 267336,
      "Username": "jmnevil54",
      "AvatarUrl": "https://secure.gravatar.com/avatar/5d73d7ec1dbe20a5cb46f02a6d53f187?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "A library is simply a group of code, or a file you download for the desktop/computer version of Quest.\r\n\r\nThere are a few combat libraries, and a few tutorials.\r\n\r\nFor a quick example:\r\nAt game - script - start script.\r\n```\r\nplayer.hp = 100\r\nmonster.hp = 50\r\nplayer.changedhitpoints => {\r\n  if (player.hp > 0) {\r\n    msg (\"Hits points now \" + player.hp)\r\n  }\r\n  else {\r\n    msg (\"You are dead!\")\r\n    finish\r\n  }\r\n}\r\n```\r\nWhen the monster is getting attacked.\r\n```\r\nthis.hp = this.hp - 10\r\n```\r\nWhen the player is getting attacked.\r\n```\r\nplayer.hp = player.hp - 10\r\n```\r\n\r\nThis is The Pixie's zombie apocalypse tutorial:\r\nhttps://github.com/ThePix/quest/wiki/The-Zombie-Apocalypse-(on-the-web-version)\r\nThis is The Pixie's other combat library:\r\nhttp://textadventures.co.uk/forum/samples/topic/4886/rpg-style-combat-library\r\nThis is Pertex's combat code.\r\nhttp://textadventures.co.uk/forum/samples/topic/2660/library-rpg-elements\r\nThese are my tutorials.\r\nThis is my RPG tutorial, based on The Pixie's zombie tutorial.\r\nhttps://textadventures.co.uk/forum/samples/topic/qzqe52enhuuacpdrljnffq/simple-turn-based-rpg-combat-for-the-quest-website#e27e61b1-4658-4a0f-bea4-2d01f7f325c0\r\nThis is my update to my RPG tutorial.\r\nhttp://textadventures.co.uk/forum/samples/topic/vg6jtjrayesr4e5kqqytig/simple-turn-based-rpg-combat-code-update-working-on-a-new-system#700b753e-07e5-40dc-9fff-6c7cfa19ab28\r\nThis is \"How to Get the Name, Gender, and Pronouns of the Player, RPG style.\"\r\nhttp://textadventures.co.uk/forum/samples/topic/dzenkpsg8k6elyk12bdvpq/how-to-get-the-name-gender-and-pronouns-of-the-player-rpg-style\r\n\r\nGood luck, and have fun on your game! :)",
      "EditableFormat": "markdown",
      "HTML": "<p>A library is simply a group of code, or a file you download for the desktop/computer version of Quest.</p>\n<p>There are a few combat libraries, and a few tutorials.</p>\n<p>For a quick example:<br>\nAt game - script - start script.</p>\n<pre><code>player.hp = 100\nmonster.hp = 50\nplayer.changedhitpoints =&gt; {\n  if (player.hp &gt; 0) {\n    msg (\"Hits points now \" + player.hp)\n  }\n  else {\n    msg (\"You are dead!\")\n    finish\n  }\n}\n</code></pre>\n<p>When the monster is getting attacked.</p>\n<pre><code>this.hp = this.hp - 10\n</code></pre>\n<p>When the player is getting attacked.</p>\n<pre><code>player.hp = player.hp - 10\n</code></pre>\n<p>This is The Pixie's zombie apocalypse tutorial:<br>\nhttps://github.com/ThePix/quest/wiki/The-Zombie-Apocalypse-(on-the-web-version)<br>\nThis is The Pixie's other combat library:<br>\nhttp://textadventures.co.uk/forum/samples/topic/4886/rpg-style-combat-library<br>\nThis is Pertex's combat code.<br>\nhttp://textadventures.co.uk/forum/samples/topic/2660/library-rpg-elements<br>\nThese are my tutorials.<br>\nThis is my RPG tutorial, based on The Pixie's zombie tutorial.<br>\nhttps://textadventures.co.uk/forum/samples/topic/qzqe52enhuuacpdrljnffq/simple-turn-based-rpg-combat-for-the-quest-website#e27e61b1-4658-4a0f-bea4-2d01f7f325c0<br>\nThis is my update to my RPG tutorial.<br>\nhttp://textadventures.co.uk/forum/samples/topic/vg6jtjrayesr4e5kqqytig/simple-turn-based-rpg-combat-code-update-working-on-a-new-system#700b753e-07e5-40dc-9fff-6c7cfa19ab28<br>\nThis is \"How to Get the Name, Gender, and Pronouns of the Player, RPG style.\"<br>\nhttp://textadventures.co.uk/forum/samples/topic/dzenkpsg8k6elyk12bdvpq/how-to-get-the-name-gender-and-pronouns-of-the-player-rpg-style</p>\n<p>Good luck, and have fun on your game! :)</p>\n\n",
      "PostDate": "2019-09-21T07:02:35.7321999Z",
      "LastEditDate": "2019-09-21T07:29:48.3421981Z",
      "link": null
    }
  ]
}
