{
  "Topic": {
    "TopicId": "4752",
    "ForumId": "5",
    "Title": "Mac OSX Beta Testers Needed",
    "LastUpdated": "2014-11-18T06:25:11+00:00",
    "ReplyCount": 1
  },
  "Posts": [
    {
      "PostId": "31232",
      "UserId": 0,
      "Username": "dfcurran",
      "UserAvatar": null,
      "UserGravatar": "53dfdd2dc07545ff6e8b8e03656d874b",
      "EditableText": "If you'd like to try out a very unique game:  Incident at Karrousel Park please send me your contact info. I will send the list to Apple and they will contact you on how to download the Beta version.   In this game you get to pick who you'd like to play the game with.  A friend, lover,brother, sister, etc.  They are supposed to meet you at Karrousel Park but when you don't find whoever, you go looking, and begin to learn something bad may have happened to them.  The object is to get yourself and your friend out of the park alive.  \nAlthough there will be an iPad version, the beta is MAC OS only. You need OS X 10.9 or higher to play.",
      "EditableFormat": "bbcode",
      "HTML": "If you'd like to try out a very unique game:  Incident at Karrousel Park please send me your contact info. I will send the list to Apple and they will contact you on how to download the Beta version.   In this game you get to pick who you'd like to play the game with.  A friend, lover,brother, sister, etc.  They are supposed to meet you at Karrousel Park but when you don't find whoever, you go looking, and begin to learn something bad may have happened to them.  The object is to get yourself and your friend out of the park alive.  <br/>Although there will be an iPad version, the beta is MAC OS only. You need OS X 10.9 or higher to play.",
      "PostDate": "2014-11-16T17:22:26+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "31320",
      "UserId": 0,
      "Username": "dfcurran",
      "UserAvatar": null,
      "UserGravatar": "53dfdd2dc07545ff6e8b8e03656d874b",
      "EditableText": "It is rather a long game.  There are 430 locations.",
      "EditableFormat": "bbcode",
      "HTML": "It is rather a long game.  There are 430 locations.",
      "PostDate": "2014-11-18T06:25:11+00:00",
      "LastEditDate": null
    }
  ]
}
