{
  "Topic": {
    "TopicId": "4336",
    "ForumId": "20",
    "Title": "Game Design Approaches",
    "LastUpdated": "2014-05-16T11:26:51+01:00",
    "ReplyCount": 6
  },
  "Posts": [
    {
      "PostId": "28774",
      "UserId": 0,
      "Username": "chellkafka",
      "UserAvatar": null,
      "UserGravatar": "eff29d4fab3b92a9d9ccd647e42bf40f",
      "EditableText": "So, first of all, I would like to explain why I started this topic. I'm making my first game now for about a month or even longer I think and I invest a lot in game design and games and I have come across a lot of interesting and mind-blowing ideas and I have formulated some of my own thoughts as well, the thing is, I don't have really somebody to talk to about this stuff. And I found that if I actually could talk to somebody briefly about these topics, I gained a lot from it. It gave me a boost everytime, to keep working on my game (which I honestly would have given up a few times) and rethinking design ideas. So I guess if I had these discussions on a more regular basis, the game would progress a lot more and I maybe would be able to finish it.\n\nSo, I guess the first thing I want to talk about is, how to make truely interactive fiction. I know, that's what textadventures are called, but I really don't feel about them that way. Granted, I have only played a few, classics like Zork and Adventure, or some of the top-rated stuff here, so it can't be representative of all textadventures, but these textadventures weren't really interactive fiction. They were either puzzle games with a framework or some elaborate fictional works with toned down interaction like &quot;making a choice&quot;, which for me is as interactive as flipping a page. And that's my point: that isn't true interactive fiction. What I imagine under interactive fiction isn't something that hits the sweet middle spot, but rather something where the fiction part can't be without the interaction and vice versa. \nIt's the same problem video games have as well. Story-based games are more like rollercoasters. You get dragged along the narrative or the fiction or whatever you may call it, up to a point where they let you shoot or jump around or whatever and so and on. \nOf course, this isn't new, it's been debated a lot, but I never debated it and maybe somebody wants to discuss this.\nI would love some recommendations that prove me wrong of course. I'm always looking for games to learn from.\n\nSo here are some personal approaches of mine, where I try to ensure that what I am making is true interactive fiction.\nI guess the main beef I have with text adventures is, they don't focus on certain sets of interaction. They use any command as it sort of fits with the fiction. The problem with that is, often you have to guess what you have to type in in order to advance. And that is horrible. Not only for the player, but also for the game designer because now the player doesn't think about his interactions in terms of the fiction, but in terms of interaction. The player doesn't think &quot;what makes sense or what works in the context that was given to me?&quot; but rather &quot;what works?&quot;. The player gets excluded from the fiction and he doesn't think about the whole thing as an experience or as fiction, he doesn't feel part of it, it becomes rather a problem with a solution, it becomes a game. And with the last part I mean, the attitude that people get towards games when they get pulled out of immersion. When I played zork for the first time, I was immersed. I pictured myself in front of the mailbox. I opened it and read the leaflet. I knocked on the door and went west when noone replied. I was in the forest and I was looking for a way. And then the game fell apart. I typed in lots of stuff, but a lot was rejected. And then I stopped being there and doing all that stuff, I was in front of my computer trying to figure out what the game wants me to do. That's really bad, I think.\nYou don't have these problems with videogames. Because they are very clear about what you can and what you can't do. And I think that's what is needed to be done. Textadventures should be very clear what the player can and can't do. And they should be very sensible why the player can only do that and not do the other. \nThe interactions you provide to the player should be consistent all the time. Otherwise the player can't immerse himself into your game and immersion is key to interactive fiction. The player should feel as if he's a part of the story you are telling him or that he's a part of your mediations on whatever is haunting your mind.\nI also think that giving the player a reaction to every input he gives, gives the player the impression that merely using the right language makes him interact with the game. A video gamer would never think that. Why? because they have buttons to smash. And if a button doesn't work, they will never smash it. Just because there is no reaction whatsoever to smashing useless buttons. \nWhat I'm saying is, just because we use language as input instead of buttons, doesn't mean there is a difference. It only means we got much more buttons. And if the player doesn't know when to push what button, how is he supposed to interact with your fiction properly?\nThe biggest advantage of textadventures is also their biggest pitfall: the possibilities of player input could be as broad as the language used. But how do you make that consistent? you can't just rely on that your player is going to use the same logic as you. People think differently, they talk differently, they write differently. They are happy to engage with your work, but you got to show them how. Otherwise they won't understand you. Communication requires understanding on both sides.\nSo, I try to set on a few inputs that make sense all the time and show them to the player very early and give the player a mindset at the beginning that this is, how it's going to work.\n\nSo, after all this, I just want to say, I'm not trying to bash textadventures and to say they are inferior to video games. I chose this format because it is very convenient. I just have to focus on designing, writing and programming, which still is an awful lot, and words stimulate very differently than audiovisuals. I like that. Also, the interaction is different. It's more thoughtful, slowpaced, and if done correctly, more intimate. If the game lets you phrase the commands in more ways, it certainly gets more personal. And you can't do that with button mashing.\n\nSo, don't know, what are your thoughts?",
      "EditableFormat": "bbcode",
      "HTML": "So, first of all, I would like to explain why I started this topic. I'm making my first game now for about a month or even longer I think and I invest a lot in game design and games and I have come across a lot of interesting and mind-blowing ideas and I have formulated some of my own thoughts as well, the thing is, I don't have really somebody to talk to about this stuff. And I found that if I actually could talk to somebody briefly about these topics, I gained a lot from it. It gave me a boost everytime, to keep working on my game (which I honestly would have given up a few times) and rethinking design ideas. So I guess if I had these discussions on a more regular basis, the game would progress a lot more and I maybe would be able to finish it.<br/><br/>So, I guess the first thing I want to talk about is, how to make truely interactive fiction. I know, that's what textadventures are called, but I really don't feel about them that way. Granted, I have only played a few, classics like Zork and Adventure, or some of the top-rated stuff here, so it can't be representative of all textadventures, but these textadventures weren't really interactive fiction. They were either puzzle games with a framework or some elaborate fictional works with toned down interaction like &quot;making a choice&quot;, which for me is as interactive as flipping a page. And that's my point: that isn't true interactive fiction. What I imagine under interactive fiction isn't something that hits the sweet middle spot, but rather something where the fiction part can't be without the interaction and vice versa. <br/>It's the same problem video games have as well. Story-based games are more like rollercoasters. You get dragged along the narrative or the fiction or whatever you may call it, up to a point where they let you shoot or jump around or whatever and so and on. <br/>Of course, this isn't new, it's been debated a lot, but I never debated it and maybe somebody wants to discuss this.<br/>I would love some recommendations that prove me wrong of course. I'm always looking for games to learn from.<br/><br/>So here are some personal approaches of mine, where I try to ensure that what I am making is true interactive fiction.<br/>I guess the main beef I have with text adventures is, they don't focus on certain sets of interaction. They use any command as it sort of fits with the fiction. The problem with that is, often you have to guess what you have to type in in order to advance. And that is horrible. Not only for the player, but also for the game designer because now the player doesn't think about his interactions in terms of the fiction, but in terms of interaction. The player doesn't think &quot;what makes sense or what works in the context that was given to me?&quot; but rather &quot;what works?&quot;. The player gets excluded from the fiction and he doesn't think about the whole thing as an experience or as fiction, he doesn't feel part of it, it becomes rather a problem with a solution, it becomes a game. And with the last part I mean, the attitude that people get towards games when they get pulled out of immersion. When I played zork for the first time, I was immersed. I pictured myself in front of the mailbox. I opened it and read the leaflet. I knocked on the door and went west when noone replied. I was in the forest and I was looking for a way. And then the game fell apart. I typed in lots of stuff, but a lot was rejected. And then I stopped being there and doing all that stuff, I was in front of my computer trying to figure out what the game wants me to do. That's really bad, I think.<br/>You don't have these problems with videogames. Because they are very clear about what you can and what you can't do. And I think that's what is needed to be done. Textadventures should be very clear what the player can and can't do. And they should be very sensible why the player can only do that and not do the other. <br/>The interactions you provide to the player should be consistent all the time. Otherwise the player can't immerse himself into your game and immersion is key to interactive fiction. The player should feel as if he's a part of the story you are telling him or that he's a part of your mediations on whatever is haunting your mind.<br/>I also think that giving the player a reaction to every input he gives, gives the player the impression that merely using the right language makes him interact with the game. A video gamer would never think that. Why? because they have buttons to smash. And if a button doesn't work, they will never smash it. Just because there is no reaction whatsoever to smashing useless buttons. <br/>What I'm saying is, just because we use language as input instead of buttons, doesn't mean there is a difference. It only means we got much more buttons. And if the player doesn't know when to push what button, how is he supposed to interact with your fiction properly?<br/>The biggest advantage of textadventures is also their biggest pitfall: the possibilities of player input could be as broad as the language used. But how do you make that consistent? you can't just rely on that your player is going to use the same logic as you. People think differently, they talk differently, they write differently. They are happy to engage with your work, but you got to show them how. Otherwise they won't understand you. Communication requires understanding on both sides.<br/>So, I try to set on a few inputs that make sense all the time and show them to the player very early and give the player a mindset at the beginning that this is, how it's going to work.<br/><br/>So, after all this, I just want to say, I'm not trying to bash textadventures and to say they are inferior to video games. I chose this format because it is very convenient. I just have to focus on designing, writing and programming, which still is an awful lot, and words stimulate very differently than audiovisuals. I like that. Also, the interaction is different. It's more thoughtful, slowpaced, and if done correctly, more intimate. If the game lets you phrase the commands in more ways, it certainly gets more personal. And you can't do that with button mashing.<br/><br/>So, don't know, what are your thoughts?",
      "PostDate": "2014-05-15T17:21:27+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "28779",
      "UserId": 0,
      "Username": "jaynabonne",
      "UserAvatar": "6579_1344778256.jpg",
      "UserGravatar": "379859a7f1952a65399fc63997e68f0b",
      "EditableText": "I have some thoughts on all of this, and I'll craft a reply shortly, but for now, I'd recommend checking out (if you haven't already) the blogs by Emily Short. Not only does she offer great insight based on her own IF creation experience, but she is also a conduit of sorts for much of what is going on in the IF world these days. A recent post, which I just read today, is talking about a game that takes a novel approach to IF textual input. I'm not sure if I totally like what the piece is doing (the UI tends to flit around a lot), but there are some things I do like, such as narrowing the input space and having its output read more like actual narrative. If you haven't checked it out yet, her blog about it is here:\n\n<!-- m --><a class=\"postlink\" href=\"http://emshort.wordpress.com/2014/05/15/shufflecomp-an-earth-turning-slowly/#comments\">http://emshort.wordpress.com/2014/05/15 ... /#comments</a><!-- m -->\n\nI will reply with my own thoughts as well, to the extent that I can get some down. <!-- s:) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) --> I've had an ongoing discussion in my head lately about &quot;the parser&quot; vs hyperlink input which is either insightful or nonsense. I haven't worked out which yet.",
      "EditableFormat": "bbcode",
      "HTML": "I have some thoughts on all of this, and I'll craft a reply shortly, but for now, I'd recommend checking out (if you haven't already) the blogs by Emily Short. Not only does she offer great insight based on her own IF creation experience, but she is also a conduit of sorts for much of what is going on in the IF world these days. A recent post, which I just read today, is talking about a game that takes a novel approach to IF textual input. I'm not sure if I totally like what the piece is doing (the UI tends to flit around a lot), but there are some things I do like, such as narrowing the input space and having its output read more like actual narrative. If you haven't checked it out yet, her blog about it is here:<br/><br/><!-- m --><a class=\"postlink\" href=\"http://emshort.wordpress.com/2014/05/15/shufflecomp-an-earth-turning-slowly/#comments\">http://emshort.wordpress.com/2014/05/15 ... /#comments</a><!-- m --><br/><br/>I will reply with my own thoughts as well, to the extent that I can get some down. <!-- s:) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) --> I've had an ongoing discussion in my head lately about &quot;the parser&quot; vs hyperlink input which is either insightful or nonsense. I haven't worked out which yet.",
      "PostDate": "2014-05-15T19:49:25+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "28782",
      "UserId": 0,
      "Username": "jaynabonne",
      "UserAvatar": "6579_1344778256.jpg",
      "UserGravatar": "379859a7f1952a65399fc63997e68f0b",
      "EditableText": "You raise a lot of interesting points, points which, as you say, have been debated quite a bit without resolution. The lack of a clear resolution so far is the bad news. The good news is that there's room for innovation, creativity and experimentation to discover what works and what doesn't. I think it's a fascinating and exciting time, if not also frustrating. \n\nPart of this is the shift from &quot;text adventure&quot; to &quot;interactive fiction&quot;. They're just words, just labels, but they influence through their implications. And I think &quot;interactive fiction&quot; puts a lot more responsibility on an author than &quot;text adventure&quot; does. (I almost wrote &quot;game author&quot;, but I shy away from the word &quot;game&quot; now. Certainly much of it can still be considered games, and that won't change, I hope. But there are also thrusts along the &quot;fiction&quot; lines, with an emphasis more on &quot;player&quot; driven narrative creation. Unfortunately, while intellectually interesting, some efforts along those lines leave - in my mind - something to be desired. Maybe I should just stick with &quot;game&quot;...)\n\nYou use the word &quot;interactive&quot; and try to define it or at least corral it a bit. A book I'd recommend to anyone interested in IF is &quot;Chris Crawford on Interactive Storytelling&quot;. It covers quite a range of topics, all pertinent to IF. His ideal and goal is a &quot;story world&quot;, a world (if I can offer my interpretation) in which you interact with &quot;agents&quot; through a rich, wide range of interactions such that the story you experience is unique to you. Rather than being linear or even branching, it's truly an interactive, adapting world where story plays out on various stages, with the course of events determined by what you do. You, the player, create the story, not the author. The author just creates the world where a variety of stories can take place.\n\nIn that book, he defines &quot;interactive&quot; as &quot;A cyclic process between two or more active agents in which each agent alternately listens, thinks, and speaks.&quot; That might sound a bit &quot;tech-speak&quot; in the beginning, but it ends on quite a common sense, human note. You have to give some interpretation to what it means for a machine to &quot;listen&quot;, &quot;think&quot; and &quot;speak&quot;, but it raises the bar a bit on what someone would expect from something truly interactive. I won't get much more into all he has to say, as I could write a book on it - and he already has, thankfully.\n\nThere has been great debate about the virtues and evils of the text parser in IF. I don't think a satisfactory alternative has been created yet, and some of the alternatives (e.g. hyperlink / CYOA type games), while playable, lack something. As a game author, I link the convenience of canned hyperlinks. As a game player, I appreciate the knowledge gained having things spelled out gives me, but I feel the loss when being spoon-fed everything.\n\nI have a theory which is probably a bit restricted in its view but which has given me some food for thought.\n\nIf you consider some of the best loved games, they all have elements that tap into human psychology. I will admit at this point to a certain number of years under my belt, so if my references seem dated (or lame), please bear with me.\n\nThink about a game like Space Invaders or Asteroids. While simplistic and repetitive, they were quite popular in their time. Why? Because they involve a very human desire to &quot;clean up&quot;. We get a certain satisfaction from straightening things up, from putting them in their place, by organizing. In Asteroids, you get that real, though subtle, pleasure of, at the end of the level, clearing the screen.\n\nThere are always aspects to successful games that feed our need for something - whatever that something is. I can attest to the thrill of that special sound effect when you get an extra life in a Mario game or the old Williams arcade games (e.g. Defender, Robotron 2084). In the Zelda games, there is that special reward sound when you complete a task or open a new area to explore. I don't know if it's some sort of endorphin release or something less biological. But they tap directly into something in us that makes us want to keep going.\n\nEven a game like Candy Crush - you're just moving little candies around to complete patterns, etc. But you also can create special kinds of candies that do things like take out rows or blow up a certain color or even more. You could be having the worst time on a level, and something like that comes along and, no matter whether it helps or not, you get a boost because you made something a bit cool happen.\n\nI've played both parser-based and hyperlinked games. While I find the hyperlink games easier (since I don't have to fight with the parser), I find myself less satisfied with them. I'm not as engaged.\n\nI think what it is (and here is my theory) is that with textual input that is parsed, just getting the command right gives you some sense of satisfaction. When I start up an IF game, just that first &quot;l&quot; or &quot;look&quot; to see where I am gives me a positive response to what I have typed. I have figured something out - I get a bit of a zing. That zing fades as the game progresses for common commands. Once I've more or less proven to myself that basic looking/taking/putting/navigating work, they lose their allure. I begin to crave new challenges, new problems to figure out, new things to type that do new and wondrous things.\n\nI was playing a Spring Thing game by a Questor here, and though I didn't finish the game, I walked away feeling satisifed with what I did do - because I figured things out.\n\nNo matter what the hyperlinks do, just clicking on a hyperlink to see more text is not so satisfying. I'm not figuring things out as such. I am making a choice, and perhaps that's where the challenge comes in as an author. But I have yet to find a CYOA type game that I found really engaging.\n\nIs it possible to structure things such that you can have a hyperlink game and still feel like you've solved problems along the way, still feeling satisfied just by playing? I think it must be. I'd love to work out something like that. \n\nI think your analogy with other types of games is valid only to some extent. For example, I was playing Myst URU Online, which is an immersive, 3D first person, exploratory type game. Given the graphical nature and the incredible worlds and story lines they created, I was often happy just exploring. I did get satisfaction from solving puzzles as well, but I was so immersed, it often didn't matter. Could that be recreated textually? You could try, but we can take in an entire scene with a glance that it would take pages to plod through textually. They are just different media, and different rules apply.\n\nwhile reading some debate about parser vs hyperlink games, one person said he likes the *illusion* in a parser-based game that you have unlimited choice. Of course, you don't, and that is usually brought home by how much you can't do. But perhaps that comes down to how much an author wants to invest in making a great number of different verbs and inputs work. I can appreciate when that has been done, but I don't have a desire to do it myself. <!-- s:) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) -->\n\nSo how do you create the right balance between enough freedom and control that the player feels satisfaction all along the journey you have for them without giving them so little choice that they feel constrained and so much choice that they don't what to do next? I don't have the answer. Perhaps your scheme of a limited verb set would work. I'm intrigued to see it. One doubt I have is that Chris Crawford postulates that it's the verbs in a story world that make it rich more than the nouns. I'll leave that as food for thought for you. Perhaps if a reduced verb set works for you, if you can create the game you want with it, then it's good enough. I'll be happy to try what you come up with. <!-- s:) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) -->\n\n(And I'm always game and happy to discuss theory, philosophy, and the grander task and challenge of implementation!)",
      "EditableFormat": "bbcode",
      "HTML": "You raise a lot of interesting points, points which, as you say, have been debated quite a bit without resolution. The lack of a clear resolution so far is the bad news. The good news is that there's room for innovation, creativity and experimentation to discover what works and what doesn't. I think it's a fascinating and exciting time, if not also frustrating. <br/><br/>Part of this is the shift from &quot;text adventure&quot; to &quot;interactive fiction&quot;. They're just words, just labels, but they influence through their implications. And I think &quot;interactive fiction&quot; puts a lot more responsibility on an author than &quot;text adventure&quot; does. (I almost wrote &quot;game author&quot;, but I shy away from the word &quot;game&quot; now. Certainly much of it can still be considered games, and that won't change, I hope. But there are also thrusts along the &quot;fiction&quot; lines, with an emphasis more on &quot;player&quot; driven narrative creation. Unfortunately, while intellectually interesting, some efforts along those lines leave - in my mind - something to be desired. Maybe I should just stick with &quot;game&quot;...)<br/><br/>You use the word &quot;interactive&quot; and try to define it or at least corral it a bit. A book I'd recommend to anyone interested in IF is &quot;Chris Crawford on Interactive Storytelling&quot;. It covers quite a range of topics, all pertinent to IF. His ideal and goal is a &quot;story world&quot;, a world (if I can offer my interpretation) in which you interact with &quot;agents&quot; through a rich, wide range of interactions such that the story you experience is unique to you. Rather than being linear or even branching, it's truly an interactive, adapting world where story plays out on various stages, with the course of events determined by what you do. You, the player, create the story, not the author. The author just creates the world where a variety of stories can take place.<br/><br/>In that book, he defines &quot;interactive&quot; as &quot;A cyclic process between two or more active agents in which each agent alternately listens, thinks, and speaks.&quot; That might sound a bit &quot;tech-speak&quot; in the beginning, but it ends on quite a common sense, human note. You have to give some interpretation to what it means for a machine to &quot;listen&quot;, &quot;think&quot; and &quot;speak&quot;, but it raises the bar a bit on what someone would expect from something truly interactive. I won't get much more into all he has to say, as I could write a book on it - and he already has, thankfully.<br/><br/>There has been great debate about the virtues and evils of the text parser in IF. I don't think a satisfactory alternative has been created yet, and some of the alternatives (e.g. hyperlink / CYOA type games), while playable, lack something. As a game author, I link the convenience of canned hyperlinks. As a game player, I appreciate the knowledge gained having things spelled out gives me, but I feel the loss when being spoon-fed everything.<br/><br/>I have a theory which is probably a bit restricted in its view but which has given me some food for thought.<br/><br/>If you consider some of the best loved games, they all have elements that tap into human psychology. I will admit at this point to a certain number of years under my belt, so if my references seem dated (or lame), please bear with me.<br/><br/>Think about a game like Space Invaders or Asteroids. While simplistic and repetitive, they were quite popular in their time. Why? Because they involve a very human desire to &quot;clean up&quot;. We get a certain satisfaction from straightening things up, from putting them in their place, by organizing. In Asteroids, you get that real, though subtle, pleasure of, at the end of the level, clearing the screen.<br/><br/>There are always aspects to successful games that feed our need for something - whatever that something is. I can attest to the thrill of that special sound effect when you get an extra life in a Mario game or the old Williams arcade games (e.g. Defender, Robotron 2084). In the Zelda games, there is that special reward sound when you complete a task or open a new area to explore. I don't know if it's some sort of endorphin release or something less biological. But they tap directly into something in us that makes us want to keep going.<br/><br/>Even a game like Candy Crush - you're just moving little candies around to complete patterns, etc. But you also can create special kinds of candies that do things like take out rows or blow up a certain color or even more. You could be having the worst time on a level, and something like that comes along and, no matter whether it helps or not, you get a boost because you made something a bit cool happen.<br/><br/>I've played both parser-based and hyperlinked games. While I find the hyperlink games easier (since I don't have to fight with the parser), I find myself less satisfied with them. I'm not as engaged.<br/><br/>I think what it is (and here is my theory) is that with textual input that is parsed, just getting the command right gives you some sense of satisfaction. When I start up an IF game, just that first &quot;l&quot; or &quot;look&quot; to see where I am gives me a positive response to what I have typed. I have figured something out - I get a bit of a zing. That zing fades as the game progresses for common commands. Once I've more or less proven to myself that basic looking/taking/putting/navigating work, they lose their allure. I begin to crave new challenges, new problems to figure out, new things to type that do new and wondrous things.<br/><br/>I was playing a Spring Thing game by a Questor here, and though I didn't finish the game, I walked away feeling satisifed with what I did do - because I figured things out.<br/><br/>No matter what the hyperlinks do, just clicking on a hyperlink to see more text is not so satisfying. I'm not figuring things out as such. I am making a choice, and perhaps that's where the challenge comes in as an author. But I have yet to find a CYOA type game that I found really engaging.<br/><br/>Is it possible to structure things such that you can have a hyperlink game and still feel like you've solved problems along the way, still feeling satisfied just by playing? I think it must be. I'd love to work out something like that. <br/><br/>I think your analogy with other types of games is valid only to some extent. For example, I was playing Myst URU Online, which is an immersive, 3D first person, exploratory type game. Given the graphical nature and the incredible worlds and story lines they created, I was often happy just exploring. I did get satisfaction from solving puzzles as well, but I was so immersed, it often didn't matter. Could that be recreated textually? You could try, but we can take in an entire scene with a glance that it would take pages to plod through textually. They are just different media, and different rules apply.<br/><br/>while reading some debate about parser vs hyperlink games, one person said he likes the *illusion* in a parser-based game that you have unlimited choice. Of course, you don't, and that is usually brought home by how much you can't do. But perhaps that comes down to how much an author wants to invest in making a great number of different verbs and inputs work. I can appreciate when that has been done, but I don't have a desire to do it myself. <!-- s:) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) --><br/><br/>So how do you create the right balance between enough freedom and control that the player feels satisfaction all along the journey you have for them without giving them so little choice that they feel constrained and so much choice that they don't what to do next? I don't have the answer. Perhaps your scheme of a limited verb set would work. I'm intrigued to see it. One doubt I have is that Chris Crawford postulates that it's the verbs in a story world that make it rich more than the nouns. I'll leave that as food for thought for you. Perhaps if a reduced verb set works for you, if you can create the game you want with it, then it's good enough. I'll be happy to try what you come up with. <!-- s:) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) --><br/><br/>(And I'm always game and happy to discuss theory, philosophy, and the grander task and challenge of implementation!)",
      "PostDate": "2014-05-16T02:18:24+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "28784",
      "UserId": 0,
      "Username": "HegemonKhan",
      "UserAvatar": null,
      "UserGravatar": "a96cf34d8d97c57de38f54ee22b1759b",
      "EditableText": "RPGs by design are immersible and customizable (which further increases your sense of immersion), so the more RPG-like you make a text adventure, the more immersible it is, and the less 'pure-click on button or typed input-puzzle' game it is, however, it also makes the amount of work (systems: magic, combat, equipment, items, leveling, game mechanics, dialogue, quests-~events, stealth-thievery-lockpicking, and etc) needed quadratic~exponential... lol. A good example are the elder scroll games (most recent is Skyrim), as aside from the graphics (3D world), they're text adventures (you can use quest to make pretty much everything in Skyrim that doesn't involve the graphics). There's a good thread here, where I post about the aspects of good game design (ie: an RPG's aspects, lol), here's the link: ( <!-- l --><a class=\"postlink-local\" href=\"http://forum.textadventures.co.uk/viewtopic.php?f=20&amp;t=3877\">viewtopic.php?f=20&amp;t=3877</a><!-- l --> )\n\nas for the issue of what are the commands... you can always make a help system, that the person can type (such as 'help'), that would display all of the commands a user can type in during game play, along with a 'pedia' for the game concepts, or you can even make a tutorial part within the game (an example is Final Fantasy 3 US ~ 6 JP, in the Narshe town, near the exit out of the town) that the person can visit whenever they want to do so.\n\nas for controlling what users during game play can type in... this is known as 'error and exception handling' in programming (and IT security).\n\nfor example:\n\n&lt;function name=&quot;birth_year_function&quot;&gt;&lt;![CDATA[\n-&gt; msg (&quot;What year were you born?&quot;)\n-&gt; get input {\n-&gt;-&gt; if (IsNumeric (result) = false) {\n-&gt;-&gt;-&gt; ClearScreen\n-&gt;-&gt;-&gt; msg (&quot;Please type in a number.&quot;)\n-&gt;-&gt;-&gt; wait {\n-&gt;-&gt;-&gt;-&gt; ClearScreen\n-&gt;-&gt;-&gt;-&gt; birth_year_function\n-&gt;-&gt;-&gt; }\n-&gt;-&gt; } else if (IsNumeric (result) = true) {\n-&gt;-&gt;-&gt; if (LengthOf (result) = 4) {\n-&gt;-&gt;-&gt;-&gt; game.pov.year_integer = ToInt (result)\n-&gt;-&gt;-&gt; } else if (not LengthOf (result) = 4) {\n-&gt;-&gt;-&gt;-&gt; ClearScreen\n-&gt;-&gt;-&gt;-&gt; msg (&quot;Please type in 4 digits.&quot;)\n-&gt;-&gt;-&gt;-&gt; wait {\n-&gt;-&gt;-&gt;-&gt;-&gt; ClearScreen\n-&gt;-&gt;-&gt;-&gt;-&gt; birth_year_function\n-&gt;-&gt;-&gt;-&gt; }\n-&gt;-&gt;-&gt; }\n-&gt;-&gt; }\n-&gt; }\n]]&gt;&lt;/function&gt;\n\n---------------------\n\nI think you're familar with old school text adventures and NES RPGs (like Final Fantasy 1 and Dragon Warrior 1), but if not:\n\nyour buttons (for example):\n\nEXPLORE ~ SEARCH ~ TALK\nEQUIP ~ STATS ~ ITEM\n\na game+UI design you could use.\n\n(your complexity, and thus immersion, is from your extensive coding underneath 6 simple buttons for the user to click on ~ a lot is going on ~ random responses, getting user input, and etc, while you keep it simple for the user, only having to click a few main buttons, which then leads to more options~choices afterwords)\n\n-------------\n\nalso, these turned out to be really great games, and can be made with quest, so google and take a look at them:\n\n1. Shadowgate (NES)\n2. Maniac Mansion (NES) (although its graphics: moving characters, a moveable pointer, and etc, makes it more fun~immersible, but otherwise, you can make the same game with quest)\n\nif you can include artwork and a really cool design and look and easy-to-use UI, then your game is that much more immersive, as that visual aspect can really add to a game, though this isn't available to everyone, like me as I can't do any artwork, and still haven't learned making UI (still trying to understand Pixie' Level Up 'UI'-coding, sighs, hehe).",
      "EditableFormat": "bbcode",
      "HTML": "RPGs by design are immersible and customizable (which further increases your sense of immersion), so the more RPG-like you make a text adventure, the more immersible it is, and the less 'pure-click on button or typed input-puzzle' game it is, however, it also makes the amount of work (systems: magic, combat, equipment, items, leveling, game mechanics, dialogue, quests-~events, stealth-thievery-lockpicking, and etc) needed quadratic~exponential... lol. A good example are the elder scroll games (most recent is Skyrim), as aside from the graphics (3D world), they're text adventures (you can use quest to make pretty much everything in Skyrim that doesn't involve the graphics). There's a good thread here, where I post about the aspects of good game design (ie: an RPG's aspects, lol), here's the link: ( <!-- l --><a class=\"postlink-local\" href=\"http://forum.textadventures.co.uk/viewtopic.php?f=20&amp;t=3877\">viewtopic.php?f=20&amp;t=3877</a><!-- l --> )<br/><br/>as for the issue of what are the commands... you can always make a help system, that the person can type (such as 'help'), that would display all of the commands a user can type in during game play, along with a 'pedia' for the game concepts, or you can even make a tutorial part within the game (an example is Final Fantasy 3 US ~ 6 JP, in the Narshe town, near the exit out of the town) that the person can visit whenever they want to do so.<br/><br/>as for controlling what users during game play can type in... this is known as 'error and exception handling' in programming (and IT security).<br/><br/>for example:<br/><br/>&lt;function name=&quot;birth_year_function&quot;&gt;&lt;![CDATA[<br/>-&gt; msg (&quot;What year were you born?&quot;)<br/>-&gt; get input {<br/>-&gt;-&gt; if (IsNumeric (result) = false) {<br/>-&gt;-&gt;-&gt; ClearScreen<br/>-&gt;-&gt;-&gt; msg (&quot;Please type in a number.&quot;)<br/>-&gt;-&gt;-&gt; wait {<br/>-&gt;-&gt;-&gt;-&gt; ClearScreen<br/>-&gt;-&gt;-&gt;-&gt; birth_year_function<br/>-&gt;-&gt;-&gt; }<br/>-&gt;-&gt; } else if (IsNumeric (result) = true) {<br/>-&gt;-&gt;-&gt; if (LengthOf (result) = 4) {<br/>-&gt;-&gt;-&gt;-&gt; game.pov.year_integer = ToInt (result)<br/>-&gt;-&gt;-&gt; } else if (not LengthOf (result) = 4) {<br/>-&gt;-&gt;-&gt;-&gt; ClearScreen<br/>-&gt;-&gt;-&gt;-&gt; msg (&quot;Please type in 4 digits.&quot;)<br/>-&gt;-&gt;-&gt;-&gt; wait {<br/>-&gt;-&gt;-&gt;-&gt;-&gt; ClearScreen<br/>-&gt;-&gt;-&gt;-&gt;-&gt; birth_year_function<br/>-&gt;-&gt;-&gt;-&gt; }<br/>-&gt;-&gt;-&gt; }<br/>-&gt;-&gt; }<br/>-&gt; }<br/>]]&gt;&lt;/function&gt;<br/><br/>---------------------<br/><br/>I think you're familar with old school text adventures and NES RPGs (like Final Fantasy 1 and Dragon Warrior 1), but if not:<br/><br/>your buttons (for example):<br/><br/>EXPLORE ~ SEARCH ~ TALK<br/>EQUIP ~ STATS ~ ITEM<br/><br/>a game+UI design you could use.<br/><br/>(your complexity, and thus immersion, is from your extensive coding underneath 6 simple buttons for the user to click on ~ a lot is going on ~ random responses, getting user input, and etc, while you keep it simple for the user, only having to click a few main buttons, which then leads to more options~choices afterwords)<br/><br/>-------------<br/><br/>also, these turned out to be really great games, and can be made with quest, so google and take a look at them:<br/><br/>1. Shadowgate (NES)<br/>2. Maniac Mansion (NES) (although its graphics: moving characters, a moveable pointer, and etc, makes it more fun~immersible, but otherwise, you can make the same game with quest)<br/><br/>if you can include artwork and a really cool design and look and easy-to-use UI, then your game is that much more immersive, as that visual aspect can really add to a game, though this isn't available to everyone, like me as I can't do any artwork, and still haven't learned making UI (still trying to understand Pixie' Level Up 'UI'-coding, sighs, hehe).",
      "PostDate": "2014-05-16T02:28:16+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "28785",
      "UserId": 0,
      "Username": "jaynabonne",
      "UserAvatar": "6579_1344778256.jpg",
      "UserGravatar": "379859a7f1952a65399fc63997e68f0b",
      "EditableText": "I think that's interesting because it points out something key - if you have a fixed set of commands, then you don't really need text input. You can just have buttons and maybe sub-menus. The point of an RPG is to use a fixed set of commands to manipulate the world, and RPGs get on quite well without having to type &quot;look&quot;, &quot;go west&quot;, &quot;talk to shopkeep&quot;, etc. The limited sorts of interactions lend themselves to simple controls.\n\nGames that require text input seem to have a different thrust - making the player figure out what to type at what time. That is both the crux and the bane of many text adventure games. The player is given the freedom to type anything, only a small subset of which actually does anything useful (in some cases where only one thing actually works in a certain situation). Said like that, it seems insane, and yet that is (or has been) the state of things.",
      "EditableFormat": "bbcode",
      "HTML": "I think that's interesting because it points out something key - if you have a fixed set of commands, then you don't really need text input. You can just have buttons and maybe sub-menus. The point of an RPG is to use a fixed set of commands to manipulate the world, and RPGs get on quite well without having to type &quot;look&quot;, &quot;go west&quot;, &quot;talk to shopkeep&quot;, etc. The limited sorts of interactions lend themselves to simple controls.<br/><br/>Games that require text input seem to have a different thrust - making the player figure out what to type at what time. That is both the crux and the bane of many text adventure games. The player is given the freedom to type anything, only a small subset of which actually does anything useful (in some cases where only one thing actually works in a certain situation). Said like that, it seems insane, and yet that is (or has been) the state of things.",
      "PostDate": "2014-05-16T03:05:27+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "28789",
      "UserId": 0,
      "Username": "chellkafka",
      "UserAvatar": null,
      "UserGravatar": "eff29d4fab3b92a9d9ccd647e42bf40f",
      "EditableText": "Wow, thanks for the responses, guys! Really appreciate it.\nI do think that RPGs are the more immersive games that exist, but I think they only work for a certain niche regarding narrative or meaning. They fulfill fantasies, you can explore what would happen if you were a sneaky thief or a gun-wielding scientist or whatever. But I'm talking about games that are about a certain story or a certain meaning, about ideas. I think the purest example of what I mean is &quot;Gravitation&quot; by Jason Rohrer. (Go check it out, it's for free and only lasts 8 minutes.)\nThat game is about everyday life, inspiration and creative work. And how do I know this? There is no text in the entire game stating this. There are no visuals stating this. No voice declaring that. You realize it by playing the game. In the game there is a girl playing ball with you (representing everyday life) and the more you play, the more you are on fire and you can jump higher (inspiration) and then you jump so high you reach the stars and you collect them and after a while you cool down. You fall back down and see blocks of ice standing next to an oven. and you can push the ice into the oven and score. the stars are representing ideas that crystalize into ice, concrete projects, that you have to finish. You can't play the game in a wrong way. As long as your interacting you are exploring this meaning. And that's what I want to do. RPGs are good if you want diversity in terms of interaction, but imagine you would introduce that into &quot;Gravitation&quot;. It would totally change what the game is about.\n\nAnd I didn't mean to limit the set of commands. I meant to limit the amount of interactions in a textadventure. So that the player has a clear understanding what he can and can't do. I think there is plenty room for different commands as long as they are regarding the same interactions. I think that being able to write &quot;examine entity&quot; rather than only &quot;look at object&quot; can give the player a great sense of agency and intimacy, just because he is allowed to use the phrasing of an action that he usually uses. But the action is in both cases the same, that's what I mean. I don't think buttons can replace that. \n\nI don't think that people have problems with limits. I mean, we are bound to the laws of nature, but I don't see people getting upset about it. I think the problem is when the player isn't shown the limits and the possibilities. Like in a game where to the player there is no consistency what works and what not. I was playing this game called &quot;Dear Esther&quot; which has very limited interactions: waling and looking, that's all. And I had absolutely no problem with that. The problems occured when inconsistencies arrose. Some things I collided with, with some things I didn't, absolutely randomly. Sometimes there was water where I could swim, sometimes there was water where I would immediately drown. Sometimes there were things that I saw and I could walk up to them and sometimes not. That's what I mean with consistency. And that's what bothers me with textadventures a lot of the times. I don't feel part of the game, I don't feel like I'm doing things because I want to, but because the game requires me too. And regarding storytelling that is more like a very tricky way of turning pages than interacting with the story.\nChallenges shouldn't arrise by not knowing how to interact properly, but by interacting itself. It's like Super Mario isn't challenging because you don't know what button to push. It's challenging because you have to jump over a pit while a dude in a cloud is throwing turtles at you. That's much more interactive storytelling, it almost sounds like something Lewis Carrol came up with.\n\n<!-- m --><a class=\"postlink\" href=\"http://frictionalgames.blogspot.co.at/2013/08/5-core-elements-of-interactive.html\">http://frictionalgames.blogspot.co.at/2 ... ctive.html</a><!-- m -->\n\nthat is a great article I think. and his point of interaction being there to provide the player a sense of presence in the story, is what I'm really getting at. The player should feel like a part of the story, like the driving force. And guessing the verb or reading the designer's mind is utterly destroying that.\n\nAnd I don't think that the solution lies in UI or hyperlinks or whatever. It lies in game design. i think this video shows very clearly what I mean:\n\n<!-- m --><a class=\"postlink\" href=\"http://www.youtube.com/watch?v=8FpigqfcvlM\">http://www.youtube.com/watch?v=8FpigqfcvlM</a><!-- m -->\n\nTeaching the player what he has to know about your game, within the game. And I know that's hard. But I think necessary.\n\nSo, thanks for the replies.\nAnd I'll look into Emily Short, already downloaded a game by her. I looked at the UI-article and I like the direction it goes, but it's very handholding for me. I think once you conveyed the player what he can do, he will never have a doubt about what he should do. That's it I guess. You raise 'em and then you let them out into your crazy world and hope for the best, I guess.",
      "EditableFormat": "bbcode",
      "HTML": "Wow, thanks for the responses, guys! Really appreciate it.<br/>I do think that RPGs are the more immersive games that exist, but I think they only work for a certain niche regarding narrative or meaning. They fulfill fantasies, you can explore what would happen if you were a sneaky thief or a gun-wielding scientist or whatever. But I'm talking about games that are about a certain story or a certain meaning, about ideas. I think the purest example of what I mean is &quot;Gravitation&quot; by Jason Rohrer. (Go check it out, it's for free and only lasts 8 minutes.)<br/>That game is about everyday life, inspiration and creative work. And how do I know this? There is no text in the entire game stating this. There are no visuals stating this. No voice declaring that. You realize it by playing the game. In the game there is a girl playing ball with you (representing everyday life) and the more you play, the more you are on fire and you can jump higher (inspiration) and then you jump so high you reach the stars and you collect them and after a while you cool down. You fall back down and see blocks of ice standing next to an oven. and you can push the ice into the oven and score. the stars are representing ideas that crystalize into ice, concrete projects, that you have to finish. You can't play the game in a wrong way. As long as your interacting you are exploring this meaning. And that's what I want to do. RPGs are good if you want diversity in terms of interaction, but imagine you would introduce that into &quot;Gravitation&quot;. It would totally change what the game is about.<br/><br/>And I didn't mean to limit the set of commands. I meant to limit the amount of interactions in a textadventure. So that the player has a clear understanding what he can and can't do. I think there is plenty room for different commands as long as they are regarding the same interactions. I think that being able to write &quot;examine entity&quot; rather than only &quot;look at object&quot; can give the player a great sense of agency and intimacy, just because he is allowed to use the phrasing of an action that he usually uses. But the action is in both cases the same, that's what I mean. I don't think buttons can replace that. <br/><br/>I don't think that people have problems with limits. I mean, we are bound to the laws of nature, but I don't see people getting upset about it. I think the problem is when the player isn't shown the limits and the possibilities. Like in a game where to the player there is no consistency what works and what not. I was playing this game called &quot;Dear Esther&quot; which has very limited interactions: waling and looking, that's all. And I had absolutely no problem with that. The problems occured when inconsistencies arrose. Some things I collided with, with some things I didn't, absolutely randomly. Sometimes there was water where I could swim, sometimes there was water where I would immediately drown. Sometimes there were things that I saw and I could walk up to them and sometimes not. That's what I mean with consistency. And that's what bothers me with textadventures a lot of the times. I don't feel part of the game, I don't feel like I'm doing things because I want to, but because the game requires me too. And regarding storytelling that is more like a very tricky way of turning pages than interacting with the story.<br/>Challenges shouldn't arrise by not knowing how to interact properly, but by interacting itself. It's like Super Mario isn't challenging because you don't know what button to push. It's challenging because you have to jump over a pit while a dude in a cloud is throwing turtles at you. That's much more interactive storytelling, it almost sounds like something Lewis Carrol came up with.<br/><br/><!-- m --><a class=\"postlink\" href=\"http://frictionalgames.blogspot.co.at/2013/08/5-core-elements-of-interactive.html\">http://frictionalgames.blogspot.co.at/2 ... ctive.html</a><!-- m --><br/><br/>that is a great article I think. and his point of interaction being there to provide the player a sense of presence in the story, is what I'm really getting at. The player should feel like a part of the story, like the driving force. And guessing the verb or reading the designer's mind is utterly destroying that.<br/><br/>And I don't think that the solution lies in UI or hyperlinks or whatever. It lies in game design. i think this video shows very clearly what I mean:<br/><br/><!-- m --><a class=\"postlink\" href=\"http://www.youtube.com/watch?v=8FpigqfcvlM\">http://www.youtube.com/watch?v=8FpigqfcvlM</a><!-- m --><br/><br/>Teaching the player what he has to know about your game, within the game. And I know that's hard. But I think necessary.<br/><br/>So, thanks for the replies.<br/>And I'll look into Emily Short, already downloaded a game by her. I looked at the UI-article and I like the direction it goes, but it's very handholding for me. I think once you conveyed the player what he can do, he will never have a doubt about what he should do. That's it I guess. You raise 'em and then you let them out into your crazy world and hope for the best, I guess.",
      "PostDate": "2014-05-16T10:22:18+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "28791",
      "UserId": 0,
      "Username": "chellkafka",
      "UserAvatar": null,
      "UserGravatar": "eff29d4fab3b92a9d9ccd647e42bf40f",
      "EditableText": "So, I played &quot;Counterfeit Monkey&quot; by Emily Short and it's the second textadventure with a tutorial, thank god!\nI love how it starts off. I immidiately get drawn into the fiction and feel part of it by interacting and she shows me how to play the game, what to do! that's what I mean! play the game if you haven't!\nBut I think there was a wasted oppurtunity. the best games that teach you, don't feel like tutorials at all. Portal is the best example there exists. but it clearly is a tutorial, even optional. it is connected to the fiction, but still it feels off.",
      "EditableFormat": "bbcode",
      "HTML": "So, I played &quot;Counterfeit Monkey&quot; by Emily Short and it's the second textadventure with a tutorial, thank god!<br/>I love how it starts off. I immidiately get drawn into the fiction and feel part of it by interacting and she shows me how to play the game, what to do! that's what I mean! play the game if you haven't!<br/>But I think there was a wasted oppurtunity. the best games that teach you, don't feel like tutorials at all. Portal is the best example there exists. but it clearly is a tutorial, even optional. it is connected to the fiction, but still it feels off.",
      "PostDate": "2014-05-16T11:26:51+01:00",
      "LastEditDate": null
    }
  ]
}
