{
  "Topic": {
    "TopicId": "5088",
    "ForumId": "20",
    "Title": "Cooperation or offer/search blackboards?",
    "LastUpdated": "2015-03-05T22:57:21+00:00",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "35142",
      "UserId": 0,
      "Username": "Vollkrasser",
      "UserAvatar": null,
      "UserGravatar": "2f742d03f5a3957e1c7fc9b4c21216ae",
      "EditableText": "Hi,\n\nI have an idea to encourage cooperation for making complete and good adventures here.\n\nProblem or status quo:\nMany game-makers people would need support in different fields like Quest UI, coding, story, translations, graphics, game-testing and so on. \nRight now the only way to solve such things is to post each problem on the forum and hope to get help. \n\nIdea:\nThere are people in the community here, who are good in some of these fiels and who also would like to help or even cooperate in making a game. On the other hand there are people who would need to find such peoples. So how can we support to bring them together?\n\nOne way for this would be sort of 2 blackboards or lists, where...\n\n...on one list people can register [b:2m4iw2wt]what[/b:2m4iw2wt] they offer and [b:2m4iw2wt]how[/b:2m4iw2wt]: \ne.g. &quot;Offering game-testing for youre work in progress game for bugs, logical errors and so on. maybe 1 hour a week, but not more.&quot;\n&quot;Offer scripting advise in java script, but only for single problems, not to join a team for making the whole game&quot;\n&quot;Offer story ideas and riddles in the seting of x, and would support a cooperation for making a whole game out of them.&quot;\n\nand another list where people can register what they search and how:\ne.g. &quot;searching for a game-tester who will accompany each chapter of my game to guarantee quality progress&quot;\n\nIf we just open 2 posts for &quot;search&quot; and &quot;offer&quot; i bet they get filled up with comments, questions, discussion  and so on that it will be a mess soon and one cant find the real &quot;adverts&quot;.\nFor a good quality of such &quot;blackboards&quot; there should only be the offers and searches (=ad's) and they should be up-to-date:\nSo if any question arises the 2 people shouls communicate directly with each other (e.g. via private messages) and not flood the blackboards.\n\nOne way with the already existing forum technology here would be in the first step to create 2 &quot;root&quot; Forums:\n/Coop-Offer\n/Coop-Search\nThere People could post their &quot;ad's&quot; with the significant stuff in the headline. The questions, comments and so on for each ad will then be within this posting and cant be prevented, but it would be a feasible quick-fix start. The headlines of each topic would make the root forums usable without the spam causing trouble there. Of course the moderators would have to make sure that no other postings than offer and search ads will be in there.\n\nIf this first step of the blackboard system is really used by many people over time, the next step could be to make sub-Forums for each of the relevant fields of work that emerge, e.g.:\n\n/Coop-Offer/Quest\n/Coop-Offer/Game-Testing\n/Coop-Offer/Coding\n\nWhat do you think?\n\nAnother posive effect could be that thereby small teams form, maybe even just 2 or 3 people. But even with such small cooperations the workload will be less than a one-man show and the result will usually be better also, as no one is good in all fields.\n \nCya\n\nV",
      "EditableFormat": "bbcode",
      "HTML": "Hi,<br/><br/>I have an idea to encourage cooperation for making complete and good adventures here.<br/><br/>Problem or status quo:<br/>Many game-makers people would need support in different fields like Quest UI, coding, story, translations, graphics, game-testing and so on. <br/>Right now the only way to solve such things is to post each problem on the forum and hope to get help. <br/><br/>Idea:<br/>There are people in the community here, who are good in some of these fiels and who also would like to help or even cooperate in making a game. On the other hand there are people who would need to find such peoples. So how can we support to bring them together?<br/><br/>One way for this would be sort of 2 blackboards or lists, where...<br/><br/>...on one list people can register <span style=\"font-weight:bold;\">what</span> they offer and <span style=\"font-weight:bold;\">how</span>: <br/>e.g. &quot;Offering game-testing for youre work in progress game for bugs, logical errors and so on. maybe 1 hour a week, but not more.&quot;<br/>&quot;Offer scripting advise in java script, but only for single problems, not to join a team for making the whole game&quot;<br/>&quot;Offer story ideas and riddles in the seting of x, and would support a cooperation for making a whole game out of them.&quot;<br/><br/>and another list where people can register what they search and how:<br/>e.g. &quot;searching for a game-tester who will accompany each chapter of my game to guarantee quality progress&quot;<br/><br/>If we just open 2 posts for &quot;search&quot; and &quot;offer&quot; i bet they get filled up with comments, questions, discussion  and so on that it will be a mess soon and one cant find the real &quot;adverts&quot;.<br/>For a good quality of such &quot;blackboards&quot; there should only be the offers and searches (=ad's) and they should be up-to-date:<br/>So if any question arises the 2 people shouls communicate directly with each other (e.g. via private messages) and not flood the blackboards.<br/><br/>One way with the already existing forum technology here would be in the first step to create 2 &quot;root&quot; Forums:<br/>/Coop-Offer<br/>/Coop-Search<br/>There People could post their &quot;ad's&quot; with the significant stuff in the headline. The questions, comments and so on for each ad will then be within this posting and cant be prevented, but it would be a feasible quick-fix start. The headlines of each topic would make the root forums usable without the spam causing trouble there. Of course the moderators would have to make sure that no other postings than offer and search ads will be in there.<br/><br/>If this first step of the blackboard system is really used by many people over time, the next step could be to make sub-Forums for each of the relevant fields of work that emerge, e.g.:<br/><br/>/Coop-Offer/Quest<br/>/Coop-Offer/Game-Testing<br/>/Coop-Offer/Coding<br/><br/>What do you think?<br/><br/>Another posive effect could be that thereby small teams form, maybe even just 2 or 3 people. But even with such small cooperations the workload will be less than a one-man show and the result will usually be better also, as no one is good in all fields.<br/> <br/>Cya<br/><br/>",
      "PostDate": "2015-03-05T22:57:21+00:00",
      "LastEditDate": null
    }
  ]
}
