{
  "Topic": {
    "TopicId": "6339",
    "ForumId": "20",
    "Title": "objects and places panes",
    "LastUpdated": "2016-06-23T21:20:24+01:00",
    "ReplyCount": 22
  },
  "Posts": [
    {
      "PostId": "42860",
      "UserId": 0,
      "Username": "XanMag",
      "UserAvatar": "7161_1436827710.jpg",
      "UserGravatar": "4b45a3afd18077f76f6569225c422bdb",
      "EditableText": "I've always struggled with this part of Quest...\n\nPersonally, I've always preferred reading the text the author presents and typing in responses.  It feels more like an old-school TA.  However, two things that I have noticed are...\n\n1.  I've had younger audiences (mostly teacher aides =) play my game to test it out.  I have noticed that they do not possess the TA background to know how to interact with old school text games, like the ones I'm trying to create.  Instead of using old-school &quot;Zorkian lingo&quot;, they will type all sorts of weird stuff in and get error messages.  I realize that the 'help' command is supposed to help with how to properly interact with the game, but, hell, young kids hardly read anything anyway let alone ask for help AND pay attention to the response.  I have noticed though that having the objects pane available, they prefer to click, click... click to get responses.  This is nice because it bypasses the &quot;lingo&quot; obstacle I think the younger generations have when picking up TAs.\n\n2.  I also have noticed that I think it provides, in some cases, too much help to the gamer.  It's almost like a little hint system.  Oh... what should I do with that music box?  Just click it and I'll get my options - I can open it, wind it, smash it... wonderful, let's try those!  Perhaps it is only the poorly written games that I feel this way about but shouldn't the options be noticeable in the description of that object?  Isn't that part of a TA?\n\nAnyway, what are your feelings about this nice option that is provided by the Quest system?  Should the display verbs be used in the panes?  Do you prefer games that have them available at a click?  Do you prefer having the more meaningful objects listed in the panes with/without display verbs?  What about having only some display verbs?  What about getting rid of all of the display verbs all together?  I'm leaning toward the last one, but is that limiting the enjoyment of the game for a HUGE chunk of those currently interested in TAs?",
      "EditableFormat": "bbcode",
      "HTML": "I've always struggled with this part of Quest...<br/><br/>Personally, I've always preferred reading the text the author presents and typing in responses.  It feels more like an old-school TA.  However, two things that I have noticed are...<br/><br/>1.  I've had younger audiences (mostly teacher aides =) play my game to test it out.  I have noticed that they do not possess the TA background to know how to interact with old school text games, like the ones I'm trying to create.  Instead of using old-school &quot;Zorkian lingo&quot;, they will type all sorts of weird stuff in and get error messages.  I realize that the 'help' command is supposed to help with how to properly interact with the game, but, hell, young kids hardly read anything anyway let alone ask for help AND pay attention to the response.  I have noticed though that having the objects pane available, they prefer to click, click... click to get responses.  This is nice because it bypasses the &quot;lingo&quot; obstacle I think the younger generations have when picking up TAs.<br/><br/>2.  I also have noticed that I think it provides, in some cases, too much help to the gamer.  It's almost like a little hint system.  Oh... what should I do with that music box?  Just click it and I'll get my options - I can open it, wind it, smash it... wonderful, let's try those!  Perhaps it is only the poorly written games that I feel this way about but shouldn't the options be noticeable in the description of that object?  Isn't that part of a TA?<br/><br/>Anyway, what are your feelings about this nice option that is provided by the Quest system?  Should the display verbs be used in the panes?  Do you prefer games that have them available at a click?  Do you prefer having the more meaningful objects listed in the panes with/without display verbs?  What about having only some display verbs?  What about getting rid of all of the display verbs all together?  I'm leaning toward the last one, but is that limiting the enjoyment of the game for a HUGE chunk of those currently interested in TAs?",
      "PostDate": "2016-05-16T02:54:58+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "42861",
      "UserId": 0,
      "Username": "HegemonKhan",
      "UserAvatar": null,
      "UserGravatar": "a96cf34d8d97c57de38f54ee22b1759b",
      "EditableText": "I'm probably stating the obvious, but that is what you're asking for, hehe:\n\n------\n\nthis is the basic game design question of TAs:\n\ntype vs click\n\nany graphical game (usually), is a click game: myst, shadowgate, maniac mansion, the dig, indiana jones series, etc\n\nvs originally old school games of typing (as they didn't have the graphics ability back then) and any new games going back to using typing\n\n------\n\nregardless of whether it is a click or type or both game, it's a created game, you the game maker, have full control of your game.\n\nThe person playing the game only has, more or less, the illusion of control/freedom.\n\n-------\n\nclicking games can still be as puzzle-difficult and open/freedom-perceived as typing games, while typing games can (and have to) have ways to prevent the person from getting stuck as they can't guess the input command (or you're going to have a very mad customer/client).\n\n-----\n\nso, it's a matter of which type of game, you got more skill in designing, as they're very different in how you have to go about designing them, to achieve what you want to achieve.\n\n-----\n\nI'd recommend studying a bunch of games, as possible/if you can, seeing how they handle these aspects of game design.\n\n-----\n\nOne possible example of how to make a click game, not so simple and brainless, is to not inform the person playing that something has happened... they got to explore around the game, finding out what they did, caused what to happen, as a quick method I just thought of for achieving this design.\n\nother methods involve limiting their clicking: having deaths for clicking on doing the wrong thing\n\npuzzles can be built into clicking games... such as having to click on stuff in a certain order, and etc methods, which you are probably more knowledgeable about then I am, having made 2-3 games already, hehe. The puzzle has to be in how you go about solving something.\n\n---------\n\nwhereas with typing, you have to be careful that your &quot;puzzles&quot; aren't merely in guessing the correct input... as that's not really a puzzle. You got to be vigilant that you're actually creating creative puzzles and not merely annoying brainlesss &quot;guess the correct input command&quot; as your so-called &quot;puzzle&quot;.",
      "EditableFormat": "bbcode",
      "HTML": "I'm probably stating the obvious, but that is what you're asking for, hehe:<br/><br/>------<br/><br/>this is the basic game design question of TAs:<br/><br/>type vs click<br/><br/>any graphical game (usually), is a click game: myst, shadowgate, maniac mansion, the dig, indiana jones series, etc<br/><br/>vs originally old school games of typing (as they didn't have the graphics ability back then) and any new games going back to using typing<br/><br/>------<br/><br/>regardless of whether it is a click or type or both game, it's a created game, you the game maker, have full control of your game.<br/><br/>The person playing the game only has, more or less, the illusion of control/freedom.<br/><br/>-------<br/><br/>clicking games can still be as puzzle-difficult and open/freedom-perceived as typing games, while typing games can (and have to) have ways to prevent the person from getting stuck as they can't guess the input command (or you're going to have a very mad customer/client).<br/><br/>-----<br/><br/>so, it's a matter of which type of game, you got more skill in designing, as they're very different in how you have to go about designing them, to achieve what you want to achieve.<br/><br/>-----<br/><br/>I'd recommend studying a bunch of games, as possible/if you can, seeing how they handle these aspects of game design.<br/><br/>-----<br/><br/>One possible example of how to make a click game, not so simple and brainless, is to not inform the person playing that something has happened... they got to explore around the game, finding out what they did, caused what to happen, as a quick method I just thought of for achieving this design.<br/><br/>other methods involve limiting their clicking: having deaths for clicking on doing the wrong thing<br/><br/>puzzles can be built into clicking games... such as having to click on stuff in a certain order, and etc methods, which you are probably more knowledgeable about then I am, having made 2-3 games already, hehe. The puzzle has to be in how you go about solving something.<br/><br/>---------<br/><br/>whereas with typing, you have to be careful that your &quot;puzzles&quot; aren't merely in guessing the correct input... as that's not really a puzzle. You got to be vigilant that you're actually creating creative puzzles and not merely annoying brainlesss &quot;guess the correct input command&quot; as your so-called &quot;puzzle&quot;.",
      "PostDate": "2016-05-16T03:23:50+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "42862",
      "UserId": 0,
      "Username": "Marzipan",
      "UserAvatar": null,
      "UserGravatar": "96db8d4d178365a7065b1872e874bc83",
      "EditableText": "I loathe the panes. They are ugly, switching back and forth from keyboard to mouse is clunky, and they were the first thing to go on both my WIPs.\n\nI understand that not everyone looking over Quest games is familiar with standard IF commands, that's one of the things I appreciate about it, the way it draws in all sorts of new users with different backgrounds.\n\nBut, at the same time, if someone is playing a text game, I think it should be okay for an author to assume some ability to read and comprehend words. If a prominently placed message at the beginning of the game about typing HELP for help with playing doesn't sink in, then none of the room or item descriptions will either and they can be pretty much written off as a lost cause at that point, IMO.",
      "EditableFormat": "bbcode",
      "HTML": "I loathe the panes. They are ugly, switching back and forth from keyboard to mouse is clunky, and they were the first thing to go on both my WIPs.<br/><br/>I understand that not everyone looking over Quest games is familiar with standard IF commands, that's one of the things I appreciate about it, the way it draws in all sorts of new users with different backgrounds.<br/><br/>But, at the same time, if someone is playing a text game, I think it should be okay for an author to assume some ability to read and comprehend words. If a prominently placed message at the beginning of the game about typing HELP for help with playing doesn't sink in, then none of the room or item descriptions will either and they can be pretty much written off as a lost cause at that point, IMO.",
      "PostDate": "2016-05-16T07:03:10+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "42865",
      "UserId": 0,
      "Username": "The Pixie",
      "UserAvatar": null,
      "UserGravatar": "cfa37e927f96177bcf6053ae8f108f77",
      "EditableText": "I have a work in progress where I have got rid of them, and two others where I have got rid of the command bar instead! It just depends... \n[quote:206l2ovu]2. I also have noticed that I think it provides, in some cases, too much help to the gamer. It's almost like a little hint system. Oh... what should I do with that music box? Just click it and I'll get my options - I can open it, wind it, smash it... wonderful, let's try those! Perhaps it is only the poorly written games that I feel this way about but shouldn't the options be noticeable in the description of that object? Isn't that part of a TA?[/quote:206l2ovu]\nThis is an important point. If you use verbs fully, showing all the valid options, then they potentially become more of a cheat system than a hint system. But if you do not display all the options, some players will get angry that the missing vital verb is missing, and will think it is a bug. This is really why I have gone with either the panes [b:206l2ovu]or [/b:206l2ovu]the command bar, but not both (and swapping between mouse and keyboard IS clunky) (Deeper has both, I know, but I think you can do it without using the command bar; it does not have any puzzles that require odd commands).",
      "EditableFormat": "bbcode",
      "HTML": "I have a work in progress where I have got rid of them, and two others where I have got rid of the command bar instead! It just depends... <br/><blockquote><p>2. I also have noticed that I think it provides, in some cases, too much help to the gamer. It's almost like a little hint system. Oh... what should I do with that music box? Just click it and I'll get my options - I can open it, wind it, smash it... wonderful, let's try those! Perhaps it is only the poorly written games that I feel this way about but shouldn't the options be noticeable in the description of that object? Isn't that part of a TA?</p></blockquote><br/>This is an important point. If you use verbs fully, showing all the valid options, then they potentially become more of a cheat system than a hint system. But if you do not display all the options, some players will get angry that the missing vital verb is missing, and will think it is a bug. This is really why I have gone with either the panes <span style=\"font-weight:bold;\">or </span>the command bar, but not both (and swapping between mouse and keyboard IS clunky) (Deeper has both, I know, but I think you can do it without using the command bar; it does not have any puzzles that require odd commands).",
      "PostDate": "2016-05-16T11:51:09+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "42904",
      "UserId": 0,
      "Username": "Watcher55",
      "UserAvatar": null,
      "UserGravatar": "5fbb9717e1d63a1d8e1b7d5563f17891",
      "EditableText": "Yes, it's a tricky decision. Having the verb lists does act as hints, to the extent of annoyance in some cases (where the solution requires a bit of creative thinking and to allow the verb basically gives the solution away).\n\nI decided to include the hyperlinks because playing the game with text input only is a pain if you don't have a physical keyboard, especially on a small device; also an acknowledgement of user preferences. To an extent I obscure this by including red herring commands, but that's just so that the user can't assume that *everything* in the list is useful.\n\n&quot;Use&quot; is a related issue: I find it annoying to have to navigate pick lists for verbs requiring a second object, so I often allow &quot;use&quot; where the system tries to deduce how you're trying to use the object. But again, that's giving the player help they otherwise wouldn't have.",
      "EditableFormat": "bbcode",
      "HTML": "Yes, it's a tricky decision. Having the verb lists does act as hints, to the extent of annoyance in some cases (where the solution requires a bit of creative thinking and to allow the verb basically gives the solution away).<br/><br/>I decided to include the hyperlinks because playing the game with text input only is a pain if you don't have a physical keyboard, especially on a small device; also an acknowledgement of user preferences. To an extent I obscure this by including red herring commands, but that's just so that the user can't assume that *everything* in the list is useful.<br/><br/>&quot;Use&quot; is a related issue: I find it annoying to have to navigate pick lists for verbs requiring a second object, so I often allow &quot;use&quot; where the system tries to deduce how you're trying to use the object. But again, that's giving the player help they otherwise wouldn't have.",
      "PostDate": "2016-05-18T05:15:02+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "43005",
      "UserId": 0,
      "Username": "jaynabonne",
      "UserAvatar": "6579_1344778256.jpg",
      "UserGravatar": "379859a7f1952a65399fc63997e68f0b",
      "EditableText": "I'll try not to waffle one too much about this, and I know already I'm going to digress from your actual question, but it might be interesting for some one, so... time to indulge a little bit.\n\nI'm in a bit of funny position, because I never played Zork. I have heard about it and poked at it a little bit. And I did play &quot;Softporn&quot; on the old Apple II, but I tended to fall in the RPG (Wizardry, Might and Magic, etc) and arcade camp. Later, on consoles, I stuck with RPG type games, including the Zelda series, etc.\n\nWhat I learned from that is that you can have a full, rich experience with a small set of &quot;verbs&quot;, as long as the verbs can be creatively used and (perhaps even) combined, where the player feels that sense of agency - can the player solve the problems to be solved in a way that feels unique to the player, where the player feels like &quot;I came up with that solution&quot;?\n\nFlash forward to my rediscovery of text adventures (now branded and expanded as &quot;interactive fiction&quot;), and with Quest, I began trying to write parser games. Two things have put me off them. The first is, ironically, that I have been reading the intfic forums. And I came to realize that what separates a good parser game from a poor or average one is the extent to which is preserves the illusion that &quot;the player can type anything&quot;. That is a huge point that novice IF game authors often miss, and I didn't even know it myself. What it means is that you not only need to code what *you* would type in, but you also need to anticipate and account for all the other possible things *everyone else* might type in. And the direction modern parser-game design is going is that the game doesn't have to necessarily allow all sorts of things to happen, but it should be able to respond well enough to things to guide the player to what they need to do.\n\nI have played games here on the Quest site that fall into the &quot;there's only one way to get through this game&quot; syndrome, even to the point of creating their own conventions that make on occasion make absolutely no sense (at least from my point of view). And yet people were able to play them because they somehow &quot;got&quot; what the author was doing and didn't care that they had to type nonsense at times to progress.\n\nSo that is my first stumbling block. A parser-based game must preserve that illusion of &quot;you can type in anything&quot;, and people will often try typing all sorts of things into games to see how they respond, hoping to find fun things. It's a massive, major job, and I eventually found that I didn't care enough to actually make that happen. There are people out there who do, and they make amazing, incredible, wonderful jobs of it. I will never be one of those (unless I had some really strong motivation). There is a counterpart to that as well, which is that - having cut my teeth on RPG-type games and point-and-click and arcade games with more limited controls - I just don't have the patience to try to figure out the magic incantation I have to type in to get things to work. I'm too old now, and life is too short to spend a lot of time going down dead ends that I don't know are dead ends.\n\nMy second stumbling block with parser-based games is what happened when I was first working on spondre, when I handed the beginnings of my game to my wife. I had the same experience you did - she fumbled with it, tried typing all sorts of things in, and got generally frustrated. Now, there has been a lot of discussion in the IF forums about what to do about this - how do you train the player in the IF conventions? It's not trivial, and it's not easy. But it seems essential, to perhaps have some sort of up-front tutorial mode as you see with other, non-text games, for those who haven't played before. Or if not up-front, then more implicit, as-you-play sort of help, where the game sees you're having trouble and helps out. \n\nThat is no small task.\n\nSo I had two problems: first, making a good parser game is hard, and second, playing a parser game is hard. And I want to write games that I can give to my wife, my kids, my parents, random people on the internet, and have them all at least be able to know what to do.\n\nOn the other side, you have CYOA (gamebook) type games, where you read some text and then pick from options. That has the same sort of problems as you mentioned above, where everything is up front, and you're picking things rather than entering commands of your own devising. I've played games like that, some even highly regarded, and I lose interest. I tend to focus on the choices instead of the text, and the choices often have nothing to do with me or what I want. I was playing &quot;80 days&quot;, for example, and part way through, I realized that I was making choices fairly automatically, I didn't know why I was making them, and I just didn't *care&quot;. And I gave up. The game has a fantastic interface, with things I'd like to emulate, but after choosing different paths and whether to go to the bank or spend the night or buy supplies or... They weren't choices that mattered to me.\n\nSo you have on the one hand a parser interface that gives the illusion of &quot;you can type anything&quot; (which, as Emily Short rightly pointed out, is a lie, and knowing it's a lie makes it hard for me), and on the other you have a game where the game offers you what to choose.\n\nThere is also another variant, which has inline links. It could be called a &quot;hypertext&quot; game, and I think it has promise, but it tends to have a similar feel to me to the CYOA one, if done poorly. Nothing bothers me more than having text with (say) three links, and when I click a link, the text and my unselected choices go away. That leaves me with the same feel as a CYOA, where I have to make a choice without necessarily knowing what I'm choosing, and then I'm committed to that choice. \n\nWhat they lack is the ability to *explore* a game. That is changing in some ways, in that game authors (Twine, etc) are more now having recurring paths, where you can go back and revisit earlier choices, but you still get whisked away without knowing when it will happen to new places. It has an &quot;out of control&quot; sort of feel to me.\n\nQuest's verb pop-ups are a sort of hybrid. You have the parser input, but you also can click on objects and get verbs. It's a mix of two interfaces, and they conflict to some extent. You can use the verb menus to try to compensate for the parser, but it won't teach people how to use the parser, and you can't put everything in the menus. So you end up training the player to interact with the game in a way that is ultimately incomplete and won't get them to the end. I think if I was going to create a parser game, I'd just create a parser game. If I wanted to use links, then I'd use links. If you have a game with both, then you should be able to do anything in both, but then you have two interfaces. Why? (One reason I got rid of the command prompt in spondre is that Pertex asked me why I was bothering with both modes of input, as I had clickable links as well. It was a pertinent and revealing question for me.)\n\nNow, you can justify the pane as a place to look to see things like inventory, so you don't have to try to remember or have to keep polluting the game output with &quot;i&quot; commands. You can also, perhaps, justify clicking on the panes if you look at them only as extensions to the parser. That's basically what they are - extension, not replacement. But they can never solve &quot;the parser problem&quot;. They can only be used as shortcuts if people want to pick up the mouse. \n\nFor me, I'm still looking for the ideal interface. It won't be parser for me, and it won't be CYOA. I think it will be some sort of hyperlink thing, but the hyperlinks bother me (they distract from the text). spondre had links but they didn't show, which might have worked if I had done it right, but that might be doomed as well.\n\nOk, that was long and perhaps touched on things that had nothing to do with your question. But I think I at least arrived somewhere close to your question, so I hope it's useful. <!-- s:) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) -->",
      "EditableFormat": "bbcode",
      "HTML": "I'll try not to waffle one too much about this, and I know already I'm going to digress from your actual question, but it might be interesting for some one, so... time to indulge a little bit.<br/><br/>I'm in a bit of funny position, because I never played Zork. I have heard about it and poked at it a little bit. And I did play &quot;Softporn&quot; on the old Apple II, but I tended to fall in the RPG (Wizardry, Might and Magic, etc) and arcade camp. Later, on consoles, I stuck with RPG type games, including the Zelda series, etc.<br/><br/>What I learned from that is that you can have a full, rich experience with a small set of &quot;verbs&quot;, as long as the verbs can be creatively used and (perhaps even) combined, where the player feels that sense of agency - can the player solve the problems to be solved in a way that feels unique to the player, where the player feels like &quot;I came up with that solution&quot;?<br/><br/>Flash forward to my rediscovery of text adventures (now branded and expanded as &quot;interactive fiction&quot;), and with Quest, I began trying to write parser games. Two things have put me off them. The first is, ironically, that I have been reading the intfic forums. And I came to realize that what separates a good parser game from a poor or average one is the extent to which is preserves the illusion that &quot;the player can type anything&quot;. That is a huge point that novice IF game authors often miss, and I didn't even know it myself. What it means is that you not only need to code what *you* would type in, but you also need to anticipate and account for all the other possible things *everyone else* might type in. And the direction modern parser-game design is going is that the game doesn't have to necessarily allow all sorts of things to happen, but it should be able to respond well enough to things to guide the player to what they need to do.<br/><br/>I have played games here on the Quest site that fall into the &quot;there's only one way to get through this game&quot; syndrome, even to the point of creating their own conventions that make on occasion make absolutely no sense (at least from my point of view). And yet people were able to play them because they somehow &quot;got&quot; what the author was doing and didn't care that they had to type nonsense at times to progress.<br/><br/>So that is my first stumbling block. A parser-based game must preserve that illusion of &quot;you can type in anything&quot;, and people will often try typing all sorts of things into games to see how they respond, hoping to find fun things. It's a massive, major job, and I eventually found that I didn't care enough to actually make that happen. There are people out there who do, and they make amazing, incredible, wonderful jobs of it. I will never be one of those (unless I had some really strong motivation). There is a counterpart to that as well, which is that - having cut my teeth on RPG-type games and point-and-click and arcade games with more limited controls - I just don't have the patience to try to figure out the magic incantation I have to type in to get things to work. I'm too old now, and life is too short to spend a lot of time going down dead ends that I don't know are dead ends.<br/><br/>My second stumbling block with parser-based games is what happened when I was first working on spondre, when I handed the beginnings of my game to my wife. I had the same experience you did - she fumbled with it, tried typing all sorts of things in, and got generally frustrated. Now, there has been a lot of discussion in the IF forums about what to do about this - how do you train the player in the IF conventions? It's not trivial, and it's not easy. But it seems essential, to perhaps have some sort of up-front tutorial mode as you see with other, non-text games, for those who haven't played before. Or if not up-front, then more implicit, as-you-play sort of help, where the game sees you're having trouble and helps out. <br/><br/>That is no small task.<br/><br/>So I had two problems: first, making a good parser game is hard, and second, playing a parser game is hard. And I want to write games that I can give to my wife, my kids, my parents, random people on the internet, and have them all at least be able to know what to do.<br/><br/>On the other side, you have CYOA (gamebook) type games, where you read some text and then pick from options. That has the same sort of problems as you mentioned above, where everything is up front, and you're picking things rather than entering commands of your own devising. I've played games like that, some even highly regarded, and I lose interest. I tend to focus on the choices instead of the text, and the choices often have nothing to do with me or what I want. I was playing &quot;80 days&quot;, for example, and part way through, I realized that I was making choices fairly automatically, I didn't know why I was making them, and I just didn't *care&quot;. And I gave up. The game has a fantastic interface, with things I'd like to emulate, but after choosing different paths and whether to go to the bank or spend the night or buy supplies or... They weren't choices that mattered to me.<br/><br/>So you have on the one hand a parser interface that gives the illusion of &quot;you can type anything&quot; (which, as Emily Short rightly pointed out, is a lie, and knowing it's a lie makes it hard for me), and on the other you have a game where the game offers you what to choose.<br/><br/>There is also another variant, which has inline links. It could be called a &quot;hypertext&quot; game, and I think it has promise, but it tends to have a similar feel to me to the CYOA one, if done poorly. Nothing bothers me more than having text with (say) three links, and when I click a link, the text and my unselected choices go away. That leaves me with the same feel as a CYOA, where I have to make a choice without necessarily knowing what I'm choosing, and then I'm committed to that choice. <br/><br/>What they lack is the ability to *explore* a game. That is changing in some ways, in that game authors (Twine, etc) are more now having recurring paths, where you can go back and revisit earlier choices, but you still get whisked away without knowing when it will happen to new places. It has an &quot;out of control&quot; sort of feel to me.<br/><br/>Quest's verb pop-ups are a sort of hybrid. You have the parser input, but you also can click on objects and get verbs. It's a mix of two interfaces, and they conflict to some extent. You can use the verb menus to try to compensate for the parser, but it won't teach people how to use the parser, and you can't put everything in the menus. So you end up training the player to interact with the game in a way that is ultimately incomplete and won't get them to the end. I think if I was going to create a parser game, I'd just create a parser game. If I wanted to use links, then I'd use links. If you have a game with both, then you should be able to do anything in both, but then you have two interfaces. Why? (One reason I got rid of the command prompt in spondre is that Pertex asked me why I was bothering with both modes of input, as I had clickable links as well. It was a pertinent and revealing question for me.)<br/><br/>Now, you can justify the pane as a place to look to see things like inventory, so you don't have to try to remember or have to keep polluting the game output with &quot;i&quot; commands. You can also, perhaps, justify clicking on the panes if you look at them only as extensions to the parser. That's basically what they are - extension, not replacement. But they can never solve &quot;the parser problem&quot;. They can only be used as shortcuts if people want to pick up the mouse. <br/><br/>For me, I'm still looking for the ideal interface. It won't be parser for me, and it won't be CYOA. I think it will be some sort of hyperlink thing, but the hyperlinks bother me (they distract from the text). spondre had links but they didn't show, which might have worked if I had done it right, but that might be doomed as well.<br/><br/>Ok, that was long and perhaps touched on things that had nothing to do with your question. But I think I at least arrived somewhere close to your question, so I hope it's useful. <!-- s:) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) -->",
      "PostDate": "2016-05-21T22:15:27+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "43034",
      "UserId": 0,
      "Username": "Marzipan",
      "UserAvatar": null,
      "UserGravatar": "96db8d4d178365a7065b1872e874bc83",
      "EditableText": "No time for a long response right now, but just wanted to say that that was a fantastic post and a great read. My feelings are still that a parser is what's needed for that truly immersive experience of exploring your environment, but I've long accepted that classic parser IF is on its way out, depressing as that is when there's nothing else quite like it out there. \n\nIn large part perhaps because hyperlinks and CYOA style games are easier to use on mobile devices, and 'click thing: advance plot' will of course always be simpler than 'think of a command that's appropriate here in the context of your surroundings and what you're carrying'. And with less players comes less authors willing to put in the massive amounts of effort needed to write even a moderate sized IF game that will barely be played.",
      "EditableFormat": "bbcode",
      "HTML": "No time for a long response right now, but just wanted to say that that was a fantastic post and a great read. My feelings are still that a parser is what's needed for that truly immersive experience of exploring your environment, but I've long accepted that classic parser IF is on its way out, depressing as that is when there's nothing else quite like it out there. <br/><br/>In large part perhaps because hyperlinks and CYOA style games are easier to use on mobile devices, and 'click thing: advance plot' will of course always be simpler than 'think of a command that's appropriate here in the context of your surroundings and what you're carrying'. And with less players comes less authors willing to put in the massive amounts of effort needed to write even a moderate sized IF game that will barely be played.",
      "PostDate": "2016-05-23T17:46:24+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "43048",
      "UserId": 0,
      "Username": "The Pixie",
      "UserAvatar": null,
      "UserGravatar": "cfa37e927f96177bcf6053ae8f108f77",
      "EditableText": "I am sure it is also a facto that CYOA is a lot easier to write. You only need to do one to three options at each step, instead of anticipating the player doing [i:1n0cijvq]anything[/i:1n0cijvq].",
      "EditableFormat": "bbcode",
      "HTML": "I am sure it is also a facto that CYOA is a lot easier to write. You only need to do one to three options at each step, instead of anticipating the player doing <span style=\"font-style:italic;\">anything</span>",
      "PostDate": "2016-05-24T08:10:59+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "43056",
      "UserId": 0,
      "Username": "jaynabonne",
      "UserAvatar": "6579_1344778256.jpg",
      "UserGravatar": "379859a7f1952a65399fc63997e68f0b",
      "EditableText": "Marzipan, I can understand that completely. I have poked at a few parser games, and I've had moments during those where you get that *hit*, that brain reward where you type something in that *you* devised, and the system responds in the way that you want. That's a very powerful thing, and it's something I find lacking in hyperlink style games (CYOA or otherwise). I would love to find a way to allow that sort of thing, but without the parser problems. Pie in the sky, I know. <!-- s:) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) -->\n\nThe Pixie, I think CYOA games can be as difficult as well, but just in different ways. Of course, if you don't mind having a poor user experience, as some have done on the Quest site here, then it's probably not hard (&quot;how about we have a game where at each step you have two choices, one of which is right and one of which is wrong, and if you click the wrong one, you die and have to start over...&quot;). I've pondered (and read) about a lot of design approaches to CYOA, and it's not trivial to have a branching strategy that doesn't lead either to a broad tree with no depth or doesn't make use of rejoining of branches, where no matter what you do, you end up in the same place anyway. There is all kinds of discussion about &quot;beats&quot; and breaking the paths up into clusters, etc, as well as the general problem of &quot;how do I choose the next bit of content to show&quot; based on a wide range of game state variables and past choices. People have made some really interesting progress in this area, bringing in new concepts that I'm not even up on (and would like to be). I guess as with anything, doing something well is never easy. <!-- s:) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) -->",
      "EditableFormat": "bbcode",
      "HTML": "Marzipan, I can understand that completely. I have poked at a few parser games, and I've had moments during those where you get that *hit*, that brain reward where you type something in that *you* devised, and the system responds in the way that you want. That's a very powerful thing, and it's something I find lacking in hyperlink style games (CYOA or otherwise). I would love to find a way to allow that sort of thing, but without the parser problems. Pie in the sky, I know. <!-- s:) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) --><br/><br/>The Pixie, I think CYOA games can be as difficult as well, but just in different ways. Of course, if you don't mind having a poor user experience, as some have done on the Quest site here, then it's probably not hard (&quot;how about we have a game where at each step you have two choices, one of which is right and one of which is wrong, and if you click the wrong one, you die and have to start over...&quot;). I've pondered (and read) about a lot of design approaches to CYOA, and it's not trivial to have a branching strategy that doesn't lead either to a broad tree with no depth or doesn't make use of rejoining of branches, where no matter what you do, you end up in the same place anyway. There is all kinds of discussion about &quot;beats&quot; and breaking the paths up into clusters, etc, as well as the general problem of &quot;how do I choose the next bit of content to show&quot; based on a wide range of game state variables and past choices. People have made some really interesting progress in this area, bringing in new concepts that I'm not even up on (and would like to be). I guess as with anything, doing something well is never easy. <!-- s:) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) -->",
      "PostDate": "2016-05-24T12:58:45+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "43061",
      "UserId": 0,
      "Username": "XanMag",
      "UserAvatar": "7161_1436827710.jpg",
      "UserGravatar": "4b45a3afd18077f76f6569225c422bdb",
      "EditableText": "This sounds like a challenge for me!  Summer break has arrived and I'll have some free time.  I'll work on creating my first CYOA with the goal of being incredibly dynamic.  My goal will be to give the player a drastic and varied experience with each play.  Any other suggestions?",
      "EditableFormat": "bbcode",
      "HTML": "This sounds like a challenge for me!  Summer break has arrived and I'll have some free time.  I'll work on creating my first CYOA with the goal of being incredibly dynamic.  My goal will be to give the player a drastic and varied experience with each play.  Any other suggestions?",
      "PostDate": "2016-05-24T15:44:58+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "43068",
      "UserId": 0,
      "Username": "Marzipan",
      "UserAvatar": null,
      "UserGravatar": "96db8d4d178365a7065b1872e874bc83",
      "EditableText": "My first suggestion would be, read some good CYOAs with branching plots that respond logically to the player's choices. (You might have to go to other sites.) Secondly, don't bite off more than you can chew. <!-- s:P --><img src=\"{SMILIES_PATH}/icon_razz.gif\" alt=\":P\" title=\"Razz\" /><!-- s:P --> \n\nA CYOA grows exponentially in size as you write and the branches have a way of sprawling out and getting away from you, even before you add in scripting and tracking and responding to the players actions on other levels. They're not as easy to complete as one might assume.\n\nAlso, I'd recommend not falling into the trap of character customization that's so popular now, feeling obligated to include romance options for every inclination under the sun, etc. That generally adds a lot of headaches for you and only gives the illusion of giving the player more choices, at the expense of time that could be spent writing a longer story with more depth about a more believable character you establish, with their own personality, backstory, etc.",
      "EditableFormat": "bbcode",
      "HTML": "My first suggestion would be, read some good CYOAs with branching plots that respond logically to the player's choices. (You might have to go to other sites.) Secondly, don't bite off more than you can chew. <!-- s:P --><img src=\"{SMILIES_PATH}/icon_razz.gif\" alt=\":P\" title=\"Razz\" /><!-- s:P --> <br/><br/>A CYOA grows exponentially in size as you write and the branches have a way of sprawling out and getting away from you, even before you add in scripting and tracking and responding to the players actions on other levels. They're not as easy to complete as one might assume.<br/><br/>Also, I'd recommend not falling into the trap of character customization that's so popular now, feeling obligated to include romance options for every inclination under the sun, etc. That generally adds a lot of headaches for you and only gives the illusion of giving the player more choices, at the expense of time that could be spent writing a longer story with more depth about a more believable character you establish, with their own personality, backstory, etc.",
      "PostDate": "2016-05-24T19:02:45+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "43070",
      "UserId": 0,
      "Username": "XanMag",
      "UserAvatar": "7161_1436827710.jpg",
      "UserGravatar": "4b45a3afd18077f76f6569225c422bdb",
      "EditableText": "[quote=&quot;Marzipan&quot;:1f189k50]Secondly, don't bite off more than you can chew. <!-- s:P --><img src=\"{SMILIES_PATH}/icon_razz.gif\" alt=\":P\" title=\"Razz\" /><!-- s:P -->[/quote:1f189k50]\n\nDon't worry.  My mouth is HUGE.  <!-- s:lol: --><img src=\"{SMILIES_PATH}/icon_lol.gif\" alt=\":lol:\" title=\"Laughing\" /><!-- s:lol: --> \n\n I'd be willing to bet that X2 was far more complex (both branching and coding) with far more writing than 99% of any CYOA out there.  Unfortunately, only about 40% of that I guess the public would see if they played the game to completion.  By the way, is there a way to check how much writing is in one of our published games?  I have a novel that I'm writing that is currently about 30,000 words.  I'm wondering how X2 compares.  Just curious.",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><cite>Marzipan wrote:</cite>Secondly, don't bite off more than you can chew. <!-- s:P --><img src=\"{SMILIES_PATH}/icon_razz.gif\" alt=\":P\" title=\"Razz\" /><!-- s:P --></blockquote><br/><br/>Don't worry.  My mouth is HUGE.  <!-- s:lol: --><img src=\"{SMILIES_PATH}/icon_lol.gif\" alt=\":lol:\" title=\"Laughing\" /><!-- s:lol: --> <br/><br/> I'd be willing to bet that X2 was far more complex (both branching and coding) with far more writing than 99% of any CYOA out there.  Unfortunately, only about 40% of that I guess the public would see if they played the game to completion.  By the way, is there a way to check how much writing is in one of our published games?  I have a novel that I'm writing that is currently about 30,000 words.  I'm wondering how X2 compares.  Just curious.",
      "PostDate": "2016-05-24T19:10:41+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "43077",
      "UserId": 0,
      "Username": "HegemonKhan",
      "UserAvatar": null,
      "UserGravatar": "a96cf34d8d97c57de38f54ee22b1759b",
      "EditableText": "do you mean the entire code length (lines and character count), or just the story/dialogue/plot parts that you wrote into the game? or do you mean to just see a published/online game's &quot;stats&quot; (lines and character count, or just the story/dialogue/plot) ???\n\n'notepad++' is a nice editor that shows you lines and character count, but I'm sure most editors and/or word processors do this too.\n\n------\n\nfor just your story/plot/dialogue/etc parts:\n\nyou could create a program that parses through your game code, looking for the 'msg' Scripts... and outputs their contents onto/into a file... and then you can get the lines and character count, lol.",
      "EditableFormat": "bbcode",
      "HTML": "do you mean the entire code length (lines and character count), or just the story/dialogue/plot parts that you wrote into the game? or do you mean to just see a published/online game's &quot;stats&quot; (lines and character count, or just the story/dialogue/plot) ???<br/><br/>'notepad++' is a nice editor that shows you lines and character count, but I'm sure most editors and/or word processors do this too.<br/><br/>------<br/><br/>for just your story/plot/dialogue/etc parts:<br/><br/>you could create a program that parses through your game code, looking for the 'msg' Scripts... and outputs their contents onto/into a file... and then you can get the lines and character count, lol.",
      "PostDate": "2016-05-24T20:16:27+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "43082",
      "UserId": 0,
      "Username": "Marzipan",
      "UserAvatar": null,
      "UserGravatar": "96db8d4d178365a7065b1872e874bc83",
      "EditableText": "I mentioned this conversation to one of the more prolific writers at chooseyourstory.com, and he had some stats to share on his CYOAs: \n\nEternal: 648,067 words 495 pages \nSuzy’s Strange Saga: 307,156 words 229 pages \nLegend: 234,162 words 1,313 pages \nGround Zero: 141,414 words 196 pages \nNecromancer: 69,783 words 107 pages \nInnkeeper: 62,420 words 75 pages \nAlpha Wolf: 61,532 words 143 pages \nDeath Song: 52,269 words 69 pages \nTales From The Basement: 41,916 words 109 pages \nParadise Violated: 39,997 words 130 pages \nTRASH: 37,970 words 113 pages \nGeek: 23,333 words 49 pages\nImagination: 21,182 words 32 pages \nAVSCYS: 20,633 words 50 pages \nExploitation Theater: 18,150 words 22 pages \nRepression 14,713 words 101 pages \nLove SICK: 9,792 words 32 pages",
      "EditableFormat": "bbcode",
      "HTML": "I mentioned this conversation to one of the more prolific writers at chooseyourstory.com, and he had some stats to share on his CYOAs: <br/><br/>Eternal: 648,067 words 495 pages <br/>Suzy’s Strange Saga: 307,156 words 229 pages <br/>Legend: 234,162 words 1,313 pages <br/>Ground Zero: 141,414 words 196 pages <br/>Necromancer: 69,783 words 107 pages <br/>Innkeeper: 62,420 words 75 pages <br/>Alpha Wolf: 61,532 words 143 pages <br/>Death Song: 52,269 words 69 pages <br/>Tales From The Basement: 41,916 words 109 pages <br/>Paradise Violated: 39,997 words 130 pages <br/>TRASH: 37,970 words 113 pages <br/>Geek: 23,333 words 49 pages<br/>Imagination: 21,182 words 32 pages <br/>AVSCYS: 20,633 words 50 pages <br/>Exploitation Theater: 18,150 words 22 pages <br/>Repression 14,713 words 101 pages <br/>Love SICK: 9,792 words 32 pages",
      "PostDate": "2016-05-24T21:51:14+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "43100",
      "UserId": 0,
      "Username": "jaynabonne",
      "UserAvatar": "6579_1344778256.jpg",
      "UserGravatar": "379859a7f1952a65399fc63997e68f0b",
      "EditableText": "Here's a timely posting by Emily Short:\n\n<!-- m --><a class=\"postlink\" href=\"https://emshort.wordpress.com/2016/05/25/not-all-choice-interfaces-are-alike/\">https://emshort.wordpress.com/2016/05/2 ... are-alike/</a><!-- m -->",
      "EditableFormat": "bbcode",
      "HTML": "Here's a timely posting by Emily Short:<br/><br/><!-- m --><a class=\"postlink\" href=\"https://emshort.wordpress.com/2016/05/25/not-all-choice-interfaces-are-alike/\">https://emshort.wordpress.com/2016/05/2 ... are-alike/</a><!-- m -->",
      "PostDate": "2016-05-25T23:13:27+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "43106",
      "UserId": 0,
      "Username": "Marzipan",
      "UserAvatar": null,
      "UserGravatar": "96db8d4d178365a7065b1872e874bc83",
      "EditableText": "Emily Short writes some good articles, I'll give that a read when I get home.\n\nUgh, but meanwhile I just figured out another edge IF has on CYOAs. Turns out CYOAs are much simpler for some random douche nozzle to just copy and paste and claim as their own. Endmaster, the guy I got all those words counts from, just found out a guy on some roleplay site was stealing his work.\n\nSo if any of you happen to have an account at warlight.net, feel free to tell 'Okabe' to gdiaf.",
      "EditableFormat": "bbcode",
      "HTML": "Emily Short writes some good articles, I'll give that a read when I get home.<br/><br/>Ugh, but meanwhile I just figured out another edge IF has on CYOAs. Turns out CYOAs are much simpler for some random douche nozzle to just copy and paste and claim as their own. Endmaster, the guy I got all those words counts from, just found out a guy on some roleplay site was stealing his work.<br/><br/>So if any of you happen to have an account at warlight.net, feel free to tell 'Okabe' to gdiaf.",
      "PostDate": "2016-05-26T02:08:35+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "43111",
      "UserId": 0,
      "Username": "XanMag",
      "UserAvatar": "7161_1436827710.jpg",
      "UserGravatar": "4b45a3afd18077f76f6569225c422bdb",
      "EditableText": "Gdiaf...? I had to look that up.  Lol...",
      "EditableFormat": "bbcode",
      "HTML": "Gdiaf...? I had to look that up.  Lol...",
      "PostDate": "2016-05-26T04:41:02+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "43112",
      "UserId": 0,
      "Username": "Marzipan",
      "UserAvatar": null,
      "UserGravatar": "96db8d4d178365a7065b1872e874bc83",
      "EditableText": "Catching up on the drama and the guy ripping off the story is apparently from Turkey, idk if there might be some cultural difference there where plagiarism of a story made available to read for free isn't as big a deal and doesn't immediately make you the scum of the earth or what. Either way, I don't quite understand where the appeal is in lying to everyone and accepting praise for something you had nothing to do with, but I don't want to derail this any farther.\n\nI'd kind of like to make a thread about plagiarism in general now, how common it is and what, if anything can realistically be done about it. But...I'm sleepy. So maybe later. <!-- s:P --><img src=\"{SMILIES_PATH}/icon_razz.gif\" alt=\":P\" title=\"Razz\" /><!-- s:P -->",
      "EditableFormat": "bbcode",
      "HTML": "Catching up on the drama and the guy ripping off the story is apparently from Turkey, idk if there might be some cultural difference there where plagiarism of a story made available to read for free isn't as big a deal and doesn't immediately make you the scum of the earth or what. Either way, I don't quite understand where the appeal is in lying to everyone and accepting praise for something you had nothing to do with, but I don't want to derail this any farther.<br/><br/>I'd kind of like to make a thread about plagiarism in general now, how common it is and what, if anything can realistically be done about it. But...I'm sleepy. So maybe later. <!-- s:P --><img src=\"{SMILIES_PATH}/icon_razz.gif\" alt=\":P\" title=\"Razz\" /><!-- s:P -->",
      "PostDate": "2016-05-26T06:11:17+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "43149",
      "UserId": 0,
      "Username": "TheDetails",
      "UserAvatar": null,
      "UserGravatar": "5a2fab185e3766767ad57fd12f0b369a",
      "EditableText": "[b:3mhse1e6]@jaynabonne:[/b:3mhse1e6]\n\nI've been hoping to address some of your very concerns in a new gamebook/world I'm making.  Specifically I'm building a gamebook right now that attempts to address the 'why am I even clicking on this crap?' problem in choose your own adventures.  That is to say, many of the actions you take all have a percentage chance of working or failing using the [random chance] tag.  And the bigger risk you take, the more you're rewarded.  I'm attempting to get the player to pay attention, essentially, and define who they are as a player, to capture some of the 'RPG' feel that CYOAs lack.\n\nSpecifically stuff like this:\n\n[80%] Block the throwing knife with your rucksack.\n[70%] Dodge the throwing knife and attack the onrushing bandit.\n[60%] Catch the throwing knife with your bare hand.\n\nIf you fail any of those, it will do increasing amounts of damage.  If you succeed, you'll have increasing rewards.  For instance, if you catch the throwing knife [60% chance] you win the combat outright: the attackers will stop in awe of your combat prowess and cede.   If you fail, the knife lodges into your hand and you lose more hit points than if you failed the dodge attempt in option two.  If you take the easiest option, 'block the knife with your rucksack,' the combat will simply continue afterward, and if you fail that one, it will do the least amount of damage.\n\nStuff like that.  I'd like to get feedback from this community when I go alpha.",
      "EditableFormat": "bbcode",
      "HTML": "<span style=\"font-weight:bold;\">@jaynabonne:</span><br/><br/>I've been hoping to address some of your very concerns in a new gamebook/world I'm making.  Specifically I'm building a gamebook right now that attempts to address the 'why am I even clicking on this crap?' problem in choose your own adventures.  That is to say, many of the actions you take all have a percentage chance of working or failing using the [random chance] tag.  And the bigger risk you take, the more you're rewarded.  I'm attempting to get the player to pay attention, essentially, and define who they are as a player, to capture some of the 'RPG' feel that CYOAs lack.<br/><br/>Specifically stuff like this:<br/><br/>[80%] Block the throwing knife with your rucksack.<br/>[70%] Dodge the throwing knife and attack the onrushing bandit.<br/>[60%] Catch the throwing knife with your bare hand.<br/><br/>If you fail any of those, it will do increasing amounts of damage.  If you succeed, you'll have increasing rewards.  For instance, if you catch the throwing knife [60% chance] you win the combat outright: the attackers will stop in awe of your combat prowess and cede.   If you fail, the knife lodges into your hand and you lose more hit points than if you failed the dodge attempt in option two.  If you take the easiest option, 'block the knife with your rucksack,' the combat will simply continue afterward, and if you fail that one, it will do the least amount of damage.<br/><br/>Stuff like that.  I'd like to get feedback from this community when I go alpha.",
      "PostDate": "2016-05-29T19:07:22+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "43151",
      "UserId": 0,
      "Username": "jaynabonne",
      "UserAvatar": "6579_1344778256.jpg",
      "UserGravatar": "379859a7f1952a65399fc63997e68f0b",
      "EditableText": "I'll be happy to try it out!",
      "EditableFormat": "bbcode",
      "HTML": "I'll be happy to try it out!",
      "PostDate": "2016-05-29T19:30:26+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "43686",
      "UserId": 0,
      "Username": "Deckrect",
      "UserAvatar": null,
      "UserGravatar": "13c7167a5f539c7d2d1ce248f7dbbdfe",
      "EditableText": "This article Jay linked is great! \n\nNow I see the huge scope the discussion covers and I see how it links to my work's current stage. \n\nI also am not even close to answer such question. However, at least for now, there is something I believe may be taken as true. \n\nRealizing the problem of covering every single possible option a player may want taking, I find important having a character at some level to be the protagonist in the game. \n\nThis way the game designer and the player as well only need to worry about what the given character would actually do at each given situation. Actually, also, I feel that &quot;situation &quot; or &quot;situational&quot; are key words for this kind of approach. From a whole universe of actions would be taken, during game design and even during playing, we could simply ignore those line of actions without a sense or meaning to the character during the situation in question. \n\nAnother factor I find very important is relevance. Sometimes adding a line of action - be it an option or a command - leading to pointless or useless actions may be used as a trick or trap. But there are games with tons of options which are presented only to lead into dead ends or not produce any result.  I think that if an option is given, it should produce something. It does not need to mean a real progress to the plot itself or a character bonus (but would be). Just a bit of extra information already justifies the choice in question. But every single option offered during game should contain relevance. \n\nI guess I gone far off topic by now. Typing at a smart phone, while people talk to you in a different language is a challenge. But as often it happens, I guess I am developing some skill. Lol.",
      "EditableFormat": "bbcode",
      "HTML": "This article Jay linked is great! <br/><br/>Now I see the huge scope the discussion covers and I see how it links to my work's current stage. <br/><br/>I also am not even close to answer such question. However, at least for now, there is something I believe may be taken as true. <br/><br/>Realizing the problem of covering every single possible option a player may want taking, I find important having a character at some level to be the protagonist in the game. <br/><br/>This way the game designer and the player as well only need to worry about what the given character would actually do at each given situation. Actually, also, I feel that &quot;situation &quot; or &quot;situational&quot; are key words for this kind of approach. From a whole universe of actions would be taken, during game design and even during playing, we could simply ignore those line of actions without a sense or meaning to the character during the situation in question. <br/><br/>Another factor I find very important is relevance. Sometimes adding a line of action - be it an option or a command - leading to pointless or useless actions may be used as a trick or trap. But there are games with tons of options which are presented only to lead into dead ends or not produce any result.  I think that if an option is given, it should produce something. It does not need to mean a real progress to the plot itself or a character bonus (but would be). Just a bit of extra information already justifies the choice in question. But every single option offered during game should contain relevance. <br/><br/>I guess I gone far off topic by now. Typing at a smart phone, while people talk to you in a different language is a challenge. But as often it happens, I guess I am developing some skill. Lol.",
      "PostDate": "2016-06-23T17:00:32+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "43702",
      "UserId": 0,
      "Username": "HegemonKhan",
      "UserAvatar": null,
      "UserGravatar": "a96cf34d8d97c57de38f54ee22b1759b",
      "EditableText": "Emily Short has a lot of really good articles to read on game making/designing, she's very knwoeldgeable, and has made many games, lots of expertise. Look under/at the 'interactive fiction resources' category drop down at the top, for her articles.",
      "EditableFormat": "bbcode",
      "HTML": "Emily Short has a lot of really good articles to read on game making/designing, she's very knwoeldgeable, and has made many games, lots of expertise. Look under/at the 'interactive fiction resources' category drop down at the top, for her articles.",
      "PostDate": "2016-06-23T20:53:53+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "43703",
      "UserId": 0,
      "Username": "Deckrect",
      "UserAvatar": null,
      "UserGravatar": "13c7167a5f539c7d2d1ce248f7dbbdfe",
      "EditableText": "Everyone should read this one.",
      "EditableFormat": "bbcode",
      "HTML": "Everyone should read this one.",
      "PostDate": "2016-06-23T21:20:24+01:00",
      "LastEditDate": null
    }
  ]
}
