{
  "Topic": {
    "TopicId": "h3um7sjgmkw0wgqckhyo0g",
    "ForumId": "20",
    "Title": "Anybody need an idea?",
    "LastUpdated": "2017-09-03T12:04:30.4299616Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "ea599ce0-2366-4b5a-8210-5e607a0c2122",
      "UserId": 319917,
      "Username": "mrangel",
      "AvatarUrl": "https://secure.gravatar.com/avatar/?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Hi folks!\r\nI started out learning scripting with Quest because it's too long since I've done any real programming, and creating something might help with my anxiety. Writing books used to be calming, until I'm at risk of losing my home if people don't buy them. So maybe a pure hobby would help again.\r\n\r\nI didn't have a strong idea, but I could play around with scripts, make interesting systems (like the random dungeon, and the characters who wander around doing their own thing without you), and sticking them together in a game that is playable, but doesn't really have a story behind it.\r\n\r\nNow, an idea strikes. I think it's a really good one. I'd love to make it, and I'd love to play it. I have a pretty good idea how I'd manage the scripting for the most important systems.\r\nBut then I realised, I have no idea where to start with the actual story. It needs strong characters, with a variety of personalities; character development through dialogue, and it needs to be very well written. And I know that's the weakest part of my writing - the characterisation. So I think as it stands, I won't be able to make this game.\r\n\r\nSo… does anybody want an idea to play with? Anybody love writing complex and detailed characters? (I think between five and eight named characters, one major location (haunted house), and maybe a couple of playable flashbacks that would take you out of the house).",
      "EditableFormat": "markdown",
      "HTML": "<p>Hi folks!<br>\nI started out learning scripting with Quest because it's too long since I've done any real programming, and creating something might help with my anxiety. Writing books used to be calming, until I'm at risk of losing my home if people don't buy them. So maybe a pure hobby would help again.</p>\n<p>I didn't have a strong idea, but I could play around with scripts, make interesting systems (like the random dungeon, and the characters who wander around doing their own thing without you), and sticking them together in a game that is playable, but doesn't really have a story behind it.</p>\n<p>Now, an idea strikes. I think it's a really good one. I'd love to make it, and I'd love to play it. I have a pretty good idea how I'd manage the scripting for the most important systems.<br>\nBut then I realised, I have no idea where to start with the actual story. It needs strong characters, with a variety of personalities; character development through dialogue, and it needs to be very well written. And I know that's the weakest part of my writing - the characterisation. So I think as it stands, I won't be able to make this game.</p>\n<p>So… does anybody want an idea to play with? Anybody love writing complex and detailed characters? (I think between five and eight named characters, one major location (haunted house), and maybe a couple of playable flashbacks that would take you out of the house).</p>\n\n",
      "PostDate": "2017-09-03T12:04:30.4299616Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "dc15100b-8576-4a48-94c8-e53f718df869",
      "UserId": 319917,
      "Username": "mrangel",
      "AvatarUrl": "https://secure.gravatar.com/avatar/?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Eh, may as well write it out.\r\n\r\nThe idea starts with the classic group of people who might be inheriting a big old house and its contents. Between them, they're expected to stay there for a week and make lists of the inventory; the stuff's supposed to be distributed according to some byzantine rules about each person getting a certain percentage of the total estate, but they each have to come up with their own lists of what's there and how much they think it's worth, prior to all the legal wrangling.\r\n\r\nThe house is supposed to be haunted. They mostly thought this was dumb, until people started dying. Some people are unwilling to leave because of the road, some because of their monsters, and some because they don't want to lose their share of the inheritance by not staying a week.\r\n\r\nThe game starts with you as the ghost, with no memory of who you were, and three bodies lying around in a house that's been cut off from the rest of the world by a blocked road in the woods, and rumours of monsters. You can watch the survivors moving around and talking to each other, but only one of them (the psychic) can kind of see you, and there's limits to how much you can communicate. Then you discover a magic mirror, which allows you to travel back in time to before the deaths. Thing is, the ghost is a gestalt of all the people who've died, so when you go back you can choose to be any of them. Each character has their own character development path, which has branches based on their encounters with the others. When there are two viable choices, the game picks one at random **but** once a choice has been made, the character will always make the same choice next time through, unless something else has changed to make them reconsider. For the one you're currently playing, the game records your choices from the dialog menus, and if you're playing someone else next time, the character will repeat your choices unless something else changes to influence them.\r\n\r\nRather than a single killer being responsible for the deaths, it turns out that most of the characters can be pushed to murder in the right circumstances, and a 'monster'. So it's like a butterfly effect thing, changing the path of a conversation early in the story can result in a different person being murdered by a different killer three days later.\r\n\r\nThe main monster is this thing called the Reaper. It can sense that someone is using magic to change history, but it doesn't quite know the rules. So, as long as someone \"is destined\" to die (the current decision trees will lead to a death unless you interact with them), the monsters in the woods will attack anyone leaving the house, will eventually come into the house on the last day, and at the end of the last day if you're still alive the Reaper will show up and kill you so that you can go back and do it again.\r\n\r\nThere's probably a few possible endings to this story.\r\n\r\nBad ending: Only one person dies (maybe two), and the magic is somehow locked so that their ghost can't go back in time. So the reaper doesn't show, and the survivors escape.\r\n\r\nBittersweet ending: You (whoever you were playing on this run) are the only one to die; and choose not to go back before everyone else has left. You resign yourself to haunting the place forever, in order to save the others from this endlessly repeating hell.\r\n\r\nGood ending: Nobody dies, it gets to the end, and all you've got to look forward to is a couple of years in court trying to sort out your inheritance with these assholes.\r\n\r\nPerfect ending(s): One or more characters get into a situation where they can get out their grudges and talk it through, or admit their secrets, or somehow resolve the issues they've brought to the house with them. Not just surviving, but actually making friends. You could have a 'perfect ending' for each character, unlocked through different paths. Getting all of them on the same cycle would be almost impossibly hard.",
      "EditableFormat": "markdown",
      "HTML": "<p>Eh, may as well write it out.</p>\n<p>The idea starts with the classic group of people who might be inheriting a big old house and its contents. Between them, they're expected to stay there for a week and make lists of the inventory; the stuff's supposed to be distributed according to some byzantine rules about each person getting a certain percentage of the total estate, but they each have to come up with their own lists of what's there and how much they think it's worth, prior to all the legal wrangling.</p>\n<p>The house is supposed to be haunted. They mostly thought this was dumb, until people started dying. Some people are unwilling to leave because of the road, some because of their monsters, and some because they don't want to lose their share of the inheritance by not staying a week.</p>\n<p>The game starts with you as the ghost, with no memory of who you were, and three bodies lying around in a house that's been cut off from the rest of the world by a blocked road in the woods, and rumours of monsters. You can watch the survivors moving around and talking to each other, but only one of them (the psychic) can kind of see you, and there's limits to how much you can communicate. Then you discover a magic mirror, which allows you to travel back in time to before the deaths. Thing is, the ghost is a gestalt of all the people who've died, so when you go back you can choose to be any of them. Each character has their own character development path, which has branches based on their encounters with the others. When there are two viable choices, the game picks one at random <strong>but</strong> once a choice has been made, the character will always make the same choice next time through, unless something else has changed to make them reconsider. For the one you're currently playing, the game records your choices from the dialog menus, and if you're playing someone else next time, the character will repeat your choices unless something else changes to influence them.</p>\n<p>Rather than a single killer being responsible for the deaths, it turns out that most of the characters can be pushed to murder in the right circumstances, and a 'monster'. So it's like a butterfly effect thing, changing the path of a conversation early in the story can result in a different person being murdered by a different killer three days later.</p>\n<p>The main monster is this thing called the Reaper. It can sense that someone is using magic to change history, but it doesn't quite know the rules. So, as long as someone \"is destined\" to die (the current decision trees will lead to a death unless you interact with them), the monsters in the woods will attack anyone leaving the house, will eventually come into the house on the last day, and at the end of the last day if you're still alive the Reaper will show up and kill you so that you can go back and do it again.</p>\n<p>There's probably a few possible endings to this story.</p>\n<p>Bad ending: Only one person dies (maybe two), and the magic is somehow locked so that their ghost can't go back in time. So the reaper doesn't show, and the survivors escape.</p>\n<p>Bittersweet ending: You (whoever you were playing on this run) are the only one to die; and choose not to go back before everyone else has left. You resign yourself to haunting the place forever, in order to save the others from this endlessly repeating hell.</p>\n<p>Good ending: Nobody dies, it gets to the end, and all you've got to look forward to is a couple of years in court trying to sort out your inheritance with these assholes.</p>\n<p>Perfect ending(s): One or more characters get into a situation where they can get out their grudges and talk it through, or admit their secrets, or somehow resolve the issues they've brought to the house with them. Not just surviving, but actually making friends. You could have a 'perfect ending' for each character, unlocked through different paths. Getting all of them on the same cycle would be almost impossibly hard.</p>\n\n",
      "PostDate": "2017-09-03T14:24:48.9631046Z",
      "LastEditDate": null,
      "link": null
    }
  ]
}
