{
  "Topic": {
    "TopicId": "1885",
    "ForumId": "3",
    "Title": "Wehn Revuwingg Gamz",
    "LastUpdated": "2008-08-17T18:20:27+01:00",
    "ReplyCount": 6
  },
  "Posts": [
    {
      "PostId": "15074",
      "UserId": 0,
      "Username": "Thanatos",
      "UserAvatar": "2160_1332681621.jpg",
      "UserGravatar": "c6621a24cf53876c4083bfb52afd2cc9",
      "EditableText": "Gamers are a finaky lot. In fact you could suggest without too much contraversy that they are a whiny bunch of nandy pandy assholes that given the chance they would become the most loud, foul mouthed complainers since, well since ever. \nIn fact there is such a huge amount of then that it comes at no suprise that the text adventure games on the site have come up against someone new, and he's running up against some pretty stiff competition. \n\nDavid W.\n\nI felt that I should critisize this self centered basterd. Self imitation is the most sincere form of flatery but the man surely doesn't need more ego to fill up his already massivly inflated head so he can fit through the door of his room to delliver the next weeks pillaging of the helpless innocent game. The man's already critisized us, so what better method to critisize him then to impale him with his own sword. \n(deep breath)\nSo Critisism number 1 has already been made. The world hasn't beaten him down with a giant repression stick since he was but a glint in his mothers postmans eye but that doesn't mean he has to shit over all the rest of us. Games could do with some healthy beating every now and then especially to the over enthusiastic fan boy toned written reviews but it doesn't follow that every game has to be spoiled with absurding wit and rodgering attitude that the site provides us for free.\nI admit that the man can be funny sometimes but so could George Bush if we gave him a headset mike and told him to read as fast as he could before he afixiated. \nWhile I quite enjoy reading some of his reviews to the crap games on the site it seems that Mr. W had been flipping through the careers handbook in his final year of school and mistook Critic for Critical, and has been industriusly been finding things to poke fun at ever since. Someone should point out to the man that it actually takes more time and thought to point out the positive things in a game whilst still being funny, since David seems to be unable to find out that he has enough inner kindness to maybe admit that a game isnt the spawn of Satan himself.  \nCritisism #2.\nWhile David shows off an obvious developed power for clever critisism for games, he could probly go from insulting the massive amounts of racism in a game to making an obnoxious gay joke in the same sentence. While the population of 5-year old man children on the site might find the gay jokes hilarious, the rest of the world has thoroughly moved on from the 1950's and into the real universe. Infact, and this might come as a shock to some of you over testosteroned freaks out there but some of them are actually gay. We know that David isnt afraid of pissing off everyone once in a while but he usually does it with some form of self reflected civity and ironicly points out that he isnt actually trying to piss us all off, and instead invites us into his lovely little cave filled with hilarious peseantism. This is not the case when he is communicating with the 5 year old man children. Infact from the uncomfortable tone of things you might have assumed that Davids inner indignified 5 year old man child has discovered that you can get away with calling people names and poking fun at their games by insulting their appaling grammer.\nI dont really have a 3rd critisism, but while the idea of attacking David W for being a loud mouthed negative nansy, being a loud mouthed negative nansy seemed ironicly juicy, so I thought I would set the standard and try something different for a change. Infact, I thought I would point out that ontop of being the loudest troll in the crowd of internet freaks David actually has some conception of what a game reviewer should actually be doing, which is not giving the popular game the hand job it usually recieves among gaming press. Infact he often has unique and insightful comments about the games he reviews so he probebly shouldn't really be written off as simply the cruelist reviewer on the site. But David, if your truely going to live up to the cruel game banger you are, you should probebly be doing something better than scoring cheap laughs at the expense of good games. Unless of course you take the title of bang as the sound your &quot;career&quot; is going to make when us nerds get sick of your annoying little voice.",
      "EditableFormat": "bbcode",
      "HTML": "Gamers are a finaky lot. In fact you could suggest without too much contraversy that they are a whiny bunch of nandy pandy assholes that given the chance they would become the most loud, foul mouthed complainers since, well since ever. <br/>In fact there is such a huge amount of then that it comes at no suprise that the text adventure games on the site have come up against someone new, and he's running up against some pretty stiff competition. <br/><br/>David W.<br/><br/>I felt that I should critisize this self centered basterd. Self imitation is the most sincere form of flatery but the man surely doesn't need more ego to fill up his already massivly inflated head so he can fit through the door of his room to delliver the next weeks pillaging of the helpless innocent game. The man's already critisized us, so what better method to critisize him then to impale him with his own sword. <br/>(deep breath)<br/>So Critisism number 1 has already been made. The world hasn't beaten him down with a giant repression stick since he was but a glint in his mothers postmans eye but that doesn't mean he has to shit over all the rest of us. Games could do with some healthy beating every now and then especially to the over enthusiastic fan boy toned written reviews but it doesn't follow that every game has to be spoiled with absurding wit and rodgering attitude that the site provides us for free.<br/>I admit that the man can be funny sometimes but so could George Bush if we gave him a headset mike and told him to read as fast as he could before he afixiated. <br/>While I quite enjoy reading some of his reviews to the crap games on the site it seems that Mr. W had been flipping through the careers handbook in his final year of school and mistook Critic for Critical, and has been industriusly been finding things to poke fun at ever since. Someone should point out to the man that it actually takes more time and thought to point out the positive things in a game whilst still being funny, since David seems to be unable to find out that he has enough inner kindness to maybe admit that a game isnt the spawn of Satan himself.  <br/>Critisism #2.<br/>While David shows off an obvious developed power for clever critisism for games, he could probly go from insulting the massive amounts of racism in a game to making an obnoxious gay joke in the same sentence. While the population of 5-year old man children on the site might find the gay jokes hilarious, the rest of the world has thoroughly moved on from the 1950's and into the real universe. Infact, and this might come as a shock to some of you over testosteroned freaks out there but some of them are actually gay. We know that David isnt afraid of pissing off everyone once in a while but he usually does it with some form of self reflected civity and ironicly points out that he isnt actually trying to piss us all off, and instead invites us into his lovely little cave filled with hilarious peseantism. This is not the case when he is communicating with the 5 year old man children. Infact from the uncomfortable tone of things you might have assumed that Davids inner indignified 5 year old man child has discovered that you can get away with calling people names and poking fun at their games by insulting their appaling grammer.<br/>I dont really have a 3rd critisism, but while the idea of attacking David W for being a loud mouthed negative nansy, being a loud mouthed negative nansy seemed ironicly juicy, so I thought I would set the standard and try something different for a change. Infact, I thought I would point out that ontop of being the loudest troll in the crowd of internet freaks David actually has some conception of what a game reviewer should actually be doing, which is not giving the popular game the hand job it usually recieves among gaming press. Infact he often has unique and insightful comments about the games he reviews so he probebly shouldn't really be written off as simply the cruelist reviewer on the site. But David, if your truely going to live up to the cruel game banger you are, you should probebly be doing something better than scoring cheap laughs at the expense of good games. Unless of course you take the title of bang as the sound your &quot;career&quot; is going to make when us nerds get sick of your annoying little voice.",
      "PostDate": "2008-06-20T14:14:51+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "15075",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "So you've been stewing over this reply for the past week since I told you off for being an idiot in the other thread? Jeez, your &quot;cutting&quot; reply certainly took a long time and didn't seem at all like an immature teenager throwing a tantrum because he was made to look a fool. No, not one bit. Well done. The other kids in your nursery class must be well proud of you.\n\nAny chance of running it through a spellcheck at some point though? I'd love to respond to every valid point you raised (all zilch of them) but my eyes started to bleed after the 85th typo.",
      "EditableFormat": "bbcode",
      "HTML": "So you've been stewing over this reply for the past week since I told you off for being an idiot in the other thread? Jeez, your &quot;cutting&quot; reply certainly took a long time and didn't seem at all like an immature teenager throwing a tantrum because he was made to look a fool. No, not one bit. Well done. The other kids in your nursery class must be well proud of you.<br/><br/>Any chance of running it through a spellcheck at some point though? I'd love to respond to every valid point you raised (all zilch of them) but my eyes started to bleed after the 85th typo.",
      "PostDate": "2008-06-20T21:53:10+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "15076",
      "UserId": 0,
      "Username": "Thanatos",
      "UserAvatar": "2160_1332681621.jpg",
      "UserGravatar": "c6621a24cf53876c4083bfb52afd2cc9",
      "EditableText": "[quote=&quot;Thanatos&quot;:6a61iawh]from the uncomfortable tone of things you might have assumed that Davids inner indignified 5 year old man child has discovered that you can get away with calling people names and poking fun at their games by insulting their appaling grammer.[/quote:6a61iawh]",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><cite>Thanatos wrote:</cite>from the uncomfortable tone of things you might have assumed that Davids inner indignified 5 year old man child has discovered that you can get away with calling people names and poking fun at their games by insulting their appaling grammer.</blockquote>",
      "PostDate": "2008-06-21T00:07:42+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "15077",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "Nice comeback. You're going to be a terror when you hit puberty.",
      "EditableFormat": "bbcode",
      "HTML": "Nice comeback. You're going to be a terror when you hit puberty.",
      "PostDate": "2008-06-21T09:28:01+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "15078",
      "UserId": 0,
      "Username": "Thanatos",
      "UserAvatar": "2160_1332681621.jpg",
      "UserGravatar": "c6621a24cf53876c4083bfb52afd2cc9",
      "EditableText": "Well when your mean Im a trampoline so everything you say bounces off of me and hits you in your big ugly head.  <!-- s:x --><img src=\"{SMILIES_PATH}/icon_mad.gif\" alt=\":x\" title=\"Mad\" /><!-- s:x -->",
      "EditableFormat": "bbcode",
      "HTML": "Well when your mean Im a trampoline so everything you say bounces off of me and hits you in your big ugly head.  <!-- s:x --><img src=\"{SMILIES_PATH}/icon_mad.gif\" alt=\":x\" title=\"Mad\" /><!-- s:x -->",
      "PostDate": "2008-06-21T11:17:37+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "15079",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "Well, for someone who used to mock MetalGod for being an illiterate idiot, you've certainly come a long way. He hacked your account or have you always been this dim and I've just never noticed before?",
      "EditableFormat": "bbcode",
      "HTML": "Well, for someone who used to mock MetalGod for being an illiterate idiot, you've certainly come a long way. He hacked your account or have you always been this dim and I've just never noticed before?",
      "PostDate": "2008-06-21T11:25:32+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "15236",
      "UserId": 0,
      "Username": "GameBoy",
      "UserAvatar": null,
      "UserGravatar": "554e89a053350b96f686f324a6049e9d",
      "EditableText": "Give it up. Nobody even cares about this website anymore.",
      "EditableFormat": "bbcode",
      "HTML": "Give it up. Nobody even cares about this website anymore.",
      "PostDate": "2008-08-17T18:20:27+01:00",
      "LastEditDate": null
    }
  ]
}
