{
  "Topic": {
    "TopicId": "o7gbh5uqjk2nj-8cajndng",
    "ForumId": "3",
    "Title": "ClickTeam Fusion 2.5",
    "LastUpdated": "2018-12-09T08:20:52.0085647Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "21b3a201-1d29-4768-ad81-5055e1184070",
      "UserId": 385800,
      "Username": "egoproctor",
      "AvatarUrl": "https://i.imgur.com/PLDGAZAb.jpg",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Chris Carson is the owner of a company called gamesare.  I worked with him at RadioShack years ago.  \r\n\r\nHis company specializes in modular game development, 8 and 16 bit games, with a modular programming environment like Quest has developed. \r\n\r\nhttps://www.clickteam.com/clickteam-fusion-2-5-free-edition\r\n\r\nHere is the free edition of the the entire game design sweet.  \r\n\r\nFree HTML5 game & app creation\r\nYou can create and publish HTML5 games & apps for free, with no royalties to pay, ever! Now anyone can create and publish fantastic browser based games totally free!\r\n\r\nPhysics objects with Box2D\r\nCreate games with super-realistic physics, from gravity to complex object interactions, ropes & particles. You want to make the next Angry Birds? No problem, you’re just a few clicks away!\r\n\r\nA simple and consistent interface\r\nAll of the editors are mouse operated. Simply click through and select from easy written descriptions and actions for each object. Can you read? Then you can program in Fusion 2.5!\r\n\r\nMake your first game in less than one hour!\r\nFollow one of our easy to understand tutorials which come included with the software and you will be playing your very own game within a hour. Amazing!\r\n\r\nOutstanding community and user support\r\nYou will have access to the Clickteam Community forums and live chat support, where you will find help direct from staff and our fantastic friendly user base around the clock.\r\n\r\nFree artwork library to get you started\r\nEven if you’re not an artist, you can use our exclusive library of royalty free graphics and artwork to help you through your first couple of games.\r\n\r\nHere is the SDK\r\nhttps://www.clickteam.com/extensions-sdks\r\n\r\nHis email address\r\n\r\nKisguri@gamesare.com\r\n\r\nI think this could be like Unity is for 3D game development.  A platform to build a Quest extension into, and from there develop apps for anything, also giving people the ability to use the same style of programming environment to make side scrollers, top down RPGs, and other styles of games. \r\n\r\nCheers guys, and thanks for all you help.\r\n\r\nTell Chris,\r\n\r\nI said hello.\r\nI emailed him to see what, if any involvement he is interested in having in Quest, even it is just my project.\r\n\r\n\"-\" egoproctor",
      "EditableFormat": "markdown",
      "HTML": "<p>Chris Carson is the owner of a company called gamesare.  I worked with him at RadioShack years ago.</p>\n<p>His company specializes in modular game development, 8 and 16 bit games, with a modular programming environment like Quest has developed.</p>\n<p>https://www.clickteam.com/clickteam-fusion-2-5-free-edition</p>\n<p>Here is the free edition of the the entire game design sweet.</p>\n<p>Free HTML5 game &amp; app creation<br>\nYou can create and publish HTML5 games &amp; apps for free, with no royalties to pay, ever! Now anyone can create and publish fantastic browser based games totally free!</p>\n<p>Physics objects with Box2D<br>\nCreate games with super-realistic physics, from gravity to complex object interactions, ropes &amp; particles. You want to make the next Angry Birds? No problem, you’re just a few clicks away!</p>\n<p>A simple and consistent interface<br>\nAll of the editors are mouse operated. Simply click through and select from easy written descriptions and actions for each object. Can you read? Then you can program in Fusion 2.5!</p>\n<p>Make your first game in less than one hour!<br>\nFollow one of our easy to understand tutorials which come included with the software and you will be playing your very own game within a hour. Amazing!</p>\n<p>Outstanding community and user support<br>\nYou will have access to the Clickteam Community forums and live chat support, where you will find help direct from staff and our fantastic friendly user base around the clock.</p>\n<p>Free artwork library to get you started<br>\nEven if you’re not an artist, you can use our exclusive library of royalty free graphics and artwork to help you through your first couple of games.</p>\n<p>Here is the SDK<br>\nhttps://www.clickteam.com/extensions-sdks</p>\n<p>His email address</p>\n<p>Kisguri@gamesare.com</p>\n<p>I think this could be like Unity is for 3D game development.  A platform to build a Quest extension into, and from there develop apps for anything, also giving people the ability to use the same style of programming environment to make side scrollers, top down RPGs, and other styles of games.</p>\n<p>Cheers guys, and thanks for all you help.</p>\n<p>Tell Chris,</p>\n<p>I said hello.<br>\nI emailed him to see what, if any involvement he is interested in having in Quest, even it is just my project.</p>\n<p>\"-\" egoproctor</p>\n\n",
      "PostDate": "2018-12-09T08:20:52.0085647Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "c4c48ac3-488a-4ea2-aba7-b12dd837681d",
      "UserId": 142763,
      "Username": "Forgewright",
      "AvatarUrl": "http://i.imgur.com/Ea6HecZb.png",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Moved here by me\r\n",
      "EditableFormat": "markdown",
      "HTML": "<p>Moved here by me</p>\n\n",
      "PostDate": "2018-12-10T08:17:03.4097537Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "7b3b20ac-2694-41aa-9388-ca186e88e478",
      "UserId": 385800,
      "Username": "egoproctor",
      "AvatarUrl": "https://i.imgur.com/PLDGAZAb.jpg",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Thank you.\r\n\r\nHey guys,\r\n\r\nI want to run an idea past you, to see what you think is the best way to integrate this following list of tools together.\r\n\r\nQuest: with a tutorial engine, as I described in the comment about a documentation project.\r\n\r\n<img src = \"https://i.imgur.com/okTe38C.png\">\r\n\r\nI don't know why I can't post that address, but that is what I wanted to share.\r\n\r\nClick team fusion 2.5 for a visual logical development space \r\nhttps://www.clickteam.com/clickteam-fusion-2-5-free-edition\r\nThere is an open source section to look at\r\nhttps://clickstore.clickteam.com/open-source\r\n\r\nand as far as this themed tool integration\r\nblender 3D https://www.blender.org/\r\n\r\nThe goal is to create a useful, adaptable, ecosystem of creativity surrounding an open source, self replicating, hemp and other public domain biomass Bio-Plastic filaments and Recycled Materials based 3D printing systems.\r\n\r\n3D printing can already produce everything we use on a daily basis and more.  It is becoming an industrial norm.\r\n\r\nHowever, it is a very difficult field to get into and excel when the market and understanding of the technology is so limited.\r\n\r\nWith an open source 3D pinter, especially made out of essentially free filament material, and an open source development environment, like what Quake, Fusion 2.5, and Blender each represent in their own markets, the potential is endless.\r\n\r\nWith a tutorial environment like Khan academy, with a school front, and a series of tasks to complete, perhaps even using Khan academy, an open source educational platform for k-12 in many subjects; people of all ages can learn to tell stories, or develop tools and apps for essentially anything.  That is, with a central focus in my world, with creating an engineering head quarters for a project that is manifesting.  \r\n\r\nI have met a master printer, a master mason, a couple with some land I can use next to a canyon that fills during rains, a man that builds houses out of horse manure and other materials, and many other interesting people.\r\n\r\nThere is a spark of interest in pool resources to make this 3D printing idea get to a proof of concept phase.  \r\n\r\nI think, I can envision, an environment like what Quest provides, along with the other tools, many people, young and old, can be taught new ways to create amazing art, in the form of stories. \r\n",
      "EditableFormat": "markdown",
      "HTML": "<p>Thank you.</p>\n<p>Hey guys,</p>\n<p>I want to run an idea past you, to see what you think is the best way to integrate this following list of tools together.</p>\n<p>Quest: with a tutorial engine, as I described in the comment about a documentation project.</p>\n<img src=\"https://i.imgur.com/okTe38C.png\">\n<p>I don't know why I can't post that address, but that is what I wanted to share.</p>\n<p>Click team fusion 2.5 for a visual logical development space<br>\nhttps://www.clickteam.com/clickteam-fusion-2-5-free-edition<br>\nThere is an open source section to look at<br>\nhttps://clickstore.clickteam.com/open-source</p>\n<p>and as far as this themed tool integration<br>\nblender 3D https://www.blender.org/</p>\n<p>The goal is to create a useful, adaptable, ecosystem of creativity surrounding an open source, self replicating, hemp and other public domain biomass Bio-Plastic filaments and Recycled Materials based 3D printing systems.</p>\n<p>3D printing can already produce everything we use on a daily basis and more.  It is becoming an industrial norm.</p>\n<p>However, it is a very difficult field to get into and excel when the market and understanding of the technology is so limited.</p>\n<p>With an open source 3D pinter, especially made out of essentially free filament material, and an open source development environment, like what Quake, Fusion 2.5, and Blender each represent in their own markets, the potential is endless.</p>\n<p>With a tutorial environment like Khan academy, with a school front, and a series of tasks to complete, perhaps even using Khan academy, an open source educational platform for k-12 in many subjects; people of all ages can learn to tell stories, or develop tools and apps for essentially anything.  That is, with a central focus in my world, with creating an engineering head quarters for a project that is manifesting.</p>\n<p>I have met a master printer, a master mason, a couple with some land I can use next to a canyon that fills during rains, a man that builds houses out of horse manure and other materials, and many other interesting people.</p>\n<p>There is a spark of interest in pool resources to make this 3D printing idea get to a proof of concept phase.</p>\n<p>I think, I can envision, an environment like what Quest provides, along with the other tools, many people, young and old, can be taught new ways to create amazing art, in the form of stories.</p>\n\n",
      "PostDate": "2018-12-11T08:29:03.9614478Z",
      "LastEditDate": "2018-12-11T08:35:07.4784325Z",
      "link": null
    },
    {
      "PostId": "63f88d5b-cf4e-4c84-88c3-b290385c6e51",
      "UserId": 385800,
      "Username": "egoproctor",
      "AvatarUrl": "https://i.imgur.com/PLDGAZAb.jpg",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "https://khan.github.io/\r\nthis is the khan academy open source collection.\r\n\r\nI will be examining what is here.  I see examples of using the khan academy api, how to build a web development coding environment in a browser, check the structure of JS code, many math utils and string utils and code formatting utils for various wrappers needed by certain protocols, etc.\r\n\r\nIt may be a strong enough set of tools to build an engine out of and make gamified educational environments, that can also be used as engineering tools.   and it is all open source.",
      "EditableFormat": "markdown",
      "HTML": "<p>https://khan.github.io/<br>\nthis is the khan academy open source collection.</p>\n<p>I will be examining what is here.  I see examples of using the khan academy api, how to build a web development coding environment in a browser, check the structure of JS code, many math utils and string utils and code formatting utils for various wrappers needed by certain protocols, etc.</p>\n<p>It may be a strong enough set of tools to build an engine out of and make gamified educational environments, that can also be used as engineering tools.   and it is all open source.</p>\n\n",
      "PostDate": "2018-12-12T14:32:31.8613441Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "60624f96-8426-4347-8057-d24c44973432",
      "UserId": 385800,
      "Username": "egoproctor",
      "AvatarUrl": "https://i.imgur.com/PLDGAZAb.jpg",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "This is the seed for the idea of a 3D printing system capable of creating a supporting an entire community.  It is open source, and it is designed to become completely self replicating.  \r\n\r\nhttps://3dprintboard.com/showthread.php?39841-I-need-some-advice-please-In-Texas-no-building-codes-thousands-of-acres\r\n\r\nI am currently in South West Texas, near the Mexican border, in a small plot of land, about 320 acres, of open desert, solar power, water catchment, and lots of creosote and dirt. (There is wifi!)I am been examining the various RepStrap designs, got distracted with moving because some of the local population thinks I should leave. I have also been reading The Pied Pipers of Babylon. www tuks nl/wiki/index php/Main/TheFascinatingHistoryOfCivilLawVersusDivineCommonL aw referenced from here, an interesting site. This explains some of the basic details of the creation, and then infiltration of Admiralty Law onto land, and its use to subvert Common Law and personal sovereignty. This is Talmudic Law in a different guise, the Laws of the Merchants. I want to build two different versions of the RepStrap style printers. I have seen the Mendel styles, with the pair of equilateral triangle supports, and another one that is square sign post and bolts. I want to reprint the plastic parts out of a 100% bioplastic filament.I want to learn how to grind up aluminium cans and do something with them, perhaps grinding them into a powder to then 3D print the metal frame parts with, and perhaps other more intricate parts, such as motor housings, nuts and bolts, etc. Also, when a laser cutter can be made available, just how to turn aluminium cans into a solid block and then cut them up with a laser.And more stuff, but that is really going to take some work. I don't have any income, or money. I have been riding a bicycle across America for the last year, starting in Chicago, now in SW Texas, with over 350 pounds of gear on a bike and a burley utility trailer. The property I am living on is owned by a man living on SSI retirement or disability, but he is the manager of a trust for an old man in Mexico who wanted to support desert, low cost, DIY survival. A school for this purpose has been proposed, and there is 60 acres dedicated to it, the trust, and some other investors interested as well as a young architect. Also, in a nearby town, due to corruption and theft, the town has allocated funds to research into new ways to manage farming, healthcare, perhaps construction, etc. That means I have access to potentially utilizing 380 acres of open desert, open source 3D printing to develop open source hemp houses, clothing, and farming, and perhaps solar panels, etc. along with two major sources of dedicated support and funding. I will need a 501C3 to start some kind of non profit to get access to seed from Canada, and register for grants and other support, as well as present a proposal to various groups for their investment and connections. If anyone at RepRap is interested in helping me figure out just what I need to make this project a Home Run, egoproctor at gmail, or just reply here, both, whatever. This seems like a once in the history of the planet and human race kind of thing.We can build a self sustaining, open source community here, we just need a working prototype, and a plan and presentations to get us into the game. A chance to build the world's first Hemp bioplastic and recycled material houses, farming systems, and clothing selections, and more. It will be completely open source, completely self sustaining, in one of the most remote and brutal desert environments on the planet; and it is self replicating. 99-120 degrees in summer, teens in winter, 5 percent humidity, 50-100 mile an hour winds and dust storms, monsoons and floods, endless seas of bentonite that fucks everything up, some of the most beautiful mountains in the world, and a chance to make something spectacular happen for the world. I am reaching out because I could use a lot of advice on what to study, what to plan for, how to communicate with various resources, maybe even help just getting the logistics and paper work filed. This has the potential to be just big if we just do it an don't bitch about how these things never work out, or whatever the justification for self defeating behavior is today.I have very little experience with official bureaucratic systems, I will fuck the duck on this one if I do it alone, is my gut feeling. Is there anyone, or a group of anyone's, who is willing to discuss this situation with me and create a plan of action. The land owner is willing to try just about anything. He has lived here for 15 years, an old land surveyor, tree hugger, political dissident, and all around good guy. What do you think. Sound like a sweet setup or what?Who wants to help make the world a different place?\"-\" egoproctor zen\r\n\r\n*edit, I added a picture of my bike in Terlingua Texas. I have since left the Terlingua Ghost town and am in the middle of nowhere in the desert, in a tent, with all my life's possessions that I want to worry about.\r\n\r\n\r\nAlso today, a friend said, I found someone in my country with money and land who's interested in the agricultural stuff we've discussed! So, looking forward to you making progress so that I can kickstart similar initiatives around here. \r\n\r\nThis can be fun.\r\n\r\nI also said>Some cool ideas came up about a game engine coupled with Khan academy to create a user interface that educates people on what they need to know use the 3D printer, math, chemistry, physics, whatever, all with videos, examples, tests, etc. and it is all open source.  \r\nIt is a text adventure game engine, combined with a 2D game engine, combined with Blender 3D engine, which can also make 3D printing files, also combined with Khan Academy online learning.  \r\n\r\nAll open source, from education to the technology you need to survive and thrive.  An entirely new infrastructure for mankind that uses the best of our current technology and helps people survive when others are focused on using the worst.\r\n\r\n\r\n\r\nJust looking for some help to get this to grow with more variety.  Cheers.  \r\n\r\n",
      "EditableFormat": "markdown",
      "HTML": "<p>This is the seed for the idea of a 3D printing system capable of creating a supporting an entire community.  It is open source, and it is designed to become completely self replicating.</p>\n<p>https://3dprintboard.com/showthread.php?39841-I-need-some-advice-please-In-Texas-no-building-codes-thousands-of-acres</p>\n<p>I am currently in South West Texas, near the Mexican border, in a small plot of land, about 320 acres, of open desert, solar power, water catchment, and lots of creosote and dirt. (There is wifi!)I am been examining the various RepStrap designs, got distracted with moving because some of the local population thinks I should leave. I have also been reading The Pied Pipers of Babylon. www tuks nl/wiki/index php/Main/TheFascinatingHistoryOfCivilLawVersusDivineCommonL aw referenced from here, an interesting site. This explains some of the basic details of the creation, and then infiltration of Admiralty Law onto land, and its use to subvert Common Law and personal sovereignty. This is Talmudic Law in a different guise, the Laws of the Merchants. I want to build two different versions of the RepStrap style printers. I have seen the Mendel styles, with the pair of equilateral triangle supports, and another one that is square sign post and bolts. I want to reprint the plastic parts out of a 100% bioplastic filament.I want to learn how to grind up aluminium cans and do something with them, perhaps grinding them into a powder to then 3D print the metal frame parts with, and perhaps other more intricate parts, such as motor housings, nuts and bolts, etc. Also, when a laser cutter can be made available, just how to turn aluminium cans into a solid block and then cut them up with a laser.And more stuff, but that is really going to take some work. I don't have any income, or money. I have been riding a bicycle across America for the last year, starting in Chicago, now in SW Texas, with over 350 pounds of gear on a bike and a burley utility trailer. The property I am living on is owned by a man living on SSI retirement or disability, but he is the manager of a trust for an old man in Mexico who wanted to support desert, low cost, DIY survival. A school for this purpose has been proposed, and there is 60 acres dedicated to it, the trust, and some other investors interested as well as a young architect. Also, in a nearby town, due to corruption and theft, the town has allocated funds to research into new ways to manage farming, healthcare, perhaps construction, etc. That means I have access to potentially utilizing 380 acres of open desert, open source 3D printing to develop open source hemp houses, clothing, and farming, and perhaps solar panels, etc. along with two major sources of dedicated support and funding. I will need a 501C3 to start some kind of non profit to get access to seed from Canada, and register for grants and other support, as well as present a proposal to various groups for their investment and connections. If anyone at RepRap is interested in helping me figure out just what I need to make this project a Home Run, egoproctor at gmail, or just reply here, both, whatever. This seems like a once in the history of the planet and human race kind of thing.We can build a self sustaining, open source community here, we just need a working prototype, and a plan and presentations to get us into the game. A chance to build the world's first Hemp bioplastic and recycled material houses, farming systems, and clothing selections, and more. It will be completely open source, completely self sustaining, in one of the most remote and brutal desert environments on the planet; and it is self replicating. 99-120 degrees in summer, teens in winter, 5 percent humidity, 50-100 mile an hour winds and dust storms, monsoons and floods, endless seas of bentonite that fucks everything up, some of the most beautiful mountains in the world, and a chance to make something spectacular happen for the world. I am reaching out because I could use a lot of advice on what to study, what to plan for, how to communicate with various resources, maybe even help just getting the logistics and paper work filed. This has the potential to be just big if we just do it an don't bitch about how these things never work out, or whatever the justification for self defeating behavior is today.I have very little experience with official bureaucratic systems, I will fuck the duck on this one if I do it alone, is my gut feeling. Is there anyone, or a group of anyone's, who is willing to discuss this situation with me and create a plan of action. The land owner is willing to try just about anything. He has lived here for 15 years, an old land surveyor, tree hugger, political dissident, and all around good guy. What do you think. Sound like a sweet setup or what?Who wants to help make the world a different place?\"-\" egoproctor zen</p>\n<p>*edit, I added a picture of my bike in Terlingua Texas. I have since left the Terlingua Ghost town and am in the middle of nowhere in the desert, in a tent, with all my life's possessions that I want to worry about.</p>\n<p>Also today, a friend said, I found someone in my country with money and land who's interested in the agricultural stuff we've discussed! So, looking forward to you making progress so that I can kickstart similar initiatives around here.</p>\n<p>This can be fun.</p>\n<p>I also said&gt;Some cool ideas came up about a game engine coupled with Khan academy to create a user interface that educates people on what they need to know use the 3D printer, math, chemistry, physics, whatever, all with videos, examples, tests, etc. and it is all open source.<br>\nIt is a text adventure game engine, combined with a 2D game engine, combined with Blender 3D engine, which can also make 3D printing files, also combined with Khan Academy online learning.</p>\n<p>All open source, from education to the technology you need to survive and thrive.  An entirely new infrastructure for mankind that uses the best of our current technology and helps people survive when others are focused on using the worst.</p>\n<p>Just looking for some help to get this to grow with more variety.  Cheers.</p>\n\n",
      "PostDate": "2018-12-25T08:34:58.8749583Z",
      "LastEditDate": null,
      "link": null
    }
  ]
}
