{
  "Topic": {
    "TopicId": "skezf_bbd0gtk91-daq29g",
    "ForumId": "3",
    "Title": "Montgomery Hallum",
    "LastUpdated": "2024-04-24T17:19:44.6981222Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "c2a687a1-b024-4879-ba30-b51bd6786b4c",
      "UserId": 685965,
      "Username": "wildmouse",
      "AvatarUrl": "https://secure.gravatar.com/avatar/?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "For many years, I've been searching for an old text adventure I played as a kid. I'm pretty sure it was called \"Montgomery Hallum\" or at least a variation of that was part of the title.\r\n\r\nBack in the mid nineties I had an old 386, DOS based PC that I picked up at a second hand computer store. I would use it nearly exclusively to play text adventures that I would download onto an internet capable laptop and transfer via floppy. Most of these games I can't recall a single detail of, but Montgomery Hallum was different. I remember that I found this particular game on some kind of geocities / anglefire / tripod type of personal webpage that contained a list of about 30 text adventures available to download as individual zip files. The game itself was memorable for several reasons.\r\n\r\n[SPOILERS]\r\n\r\nFirstly, the subject matter. You play as the titular Montgomery Hallum, who is a... priest? pastor? minister? ... a man of the cloth of some kind, IIRC. The game begins with Monty being murdered and going to hell, where, the remainder of the game takes place, save for the ending.\r\n\r\nSecondly, the presentation. A big reason why this game was so memorable was that it was presented with colored text. Different areas and words would have related colors and styles. A forested area would appear in green text, a puddle of blood would be red, etc. I don't know how common colored text styles were in text adventures overall, but I know that in the sample of games I played as a kid, this really stood out as unique to me.\r\n\r\nThirdly, the bugs. Possibly due to programming errors, file corruption, or code page incompatibility, the game was not completable. There were areas that, when entered, would cause the game to segfault. I remember this happening reliably when entering an area of the forest near a witch's house. The colored text styles would also seem to bug out, sometimes causing the text to blink for several screens of the game until some other style change caused it to reset.\r\n\r\nUnfortunately, due to the corruption, I was never able to organically finish the game. However, the game was so compelling that I needed to explore its contents in any way I could. So, I ended up opening the executable in a hex editor and reading through its strings manually. I know, there are much more readable ways of extracting strings from a binary, but this was the only solution I could think of as a kid. Through this, I found the game's appropriately creative ending. WARNING: the following is *really* spoilery. Monty is given the chance to \"come back\" to life via some form of possession in order to avenge his death. You can then name a member of Monty's parish, each person having their own unique story for how they kill Monty's murderer.\r\n\r\n[/SPOILERS]\r\n\r\nThere are a handful of other details about the game I remember vividly, including the very fun opening puzzle, however this post is probably long enough as it is. If anyone would like me to post more of my memories of this game, I can always do so in the future.\r\n\r\nI don't remember what happened to my old 386, but needless to say it is long gone. The reason I'm posting is that I think about this game a lot lately and I'm really curious if anyone else remembers playing it. If anyone else actually still *has* this game and can share it, I would be absolutely thrilled. Even though I spoiled the ending for myself, I'm pretty sure there is a lot more content in the game that would be completely fresh to me. I've tried to track it down via the usual things; Google, Wayback, IF archive. No luck there. If anyone has any ideas, please let me know.",
      "EditableFormat": "markdown",
      "HTML": "<p>For many years, I've been searching for an old text adventure I played as a kid. I'm pretty sure it was called \"Montgomery Hallum\" or at least a variation of that was part of the title.</p>\n<p>Back in the mid nineties I had an old 386, DOS based PC that I picked up at a second hand computer store. I would use it nearly exclusively to play text adventures that I would download onto an internet capable laptop and transfer via floppy. Most of these games I can't recall a single detail of, but Montgomery Hallum was different. I remember that I found this particular game on some kind of geocities / anglefire / tripod type of personal webpage that contained a list of about 30 text adventures available to download as individual zip files. The game itself was memorable for several reasons.</p>\n<p>[SPOILERS]</p>\n<p>Firstly, the subject matter. You play as the titular Montgomery Hallum, who is a... priest? pastor? minister? ... a man of the cloth of some kind, IIRC. The game begins with Monty being murdered and going to hell, where, the remainder of the game takes place, save for the ending.</p>\n<p>Secondly, the presentation. A big reason why this game was so memorable was that it was presented with colored text. Different areas and words would have related colors and styles. A forested area would appear in green text, a puddle of blood would be red, etc. I don't know how common colored text styles were in text adventures overall, but I know that in the sample of games I played as a kid, this really stood out as unique to me.</p>\n<p>Thirdly, the bugs. Possibly due to programming errors, file corruption, or code page incompatibility, the game was not completable. There were areas that, when entered, would cause the game to segfault. I remember this happening reliably when entering an area of the forest near a witch's house. The colored text styles would also seem to bug out, sometimes causing the text to blink for several screens of the game until some other style change caused it to reset.</p>\n<p>Unfortunately, due to the corruption, I was never able to organically finish the game. However, the game was so compelling that I needed to explore its contents in any way I could. So, I ended up opening the executable in a hex editor and reading through its strings manually. I know, there are much more readable ways of extracting strings from a binary, but this was the only solution I could think of as a kid. Through this, I found the game's appropriately creative ending. WARNING: the following is <em>really</em> spoilery. Monty is given the chance to \"come back\" to life via some form of possession in order to avenge his death. You can then name a member of Monty's parish, each person having their own unique story for how they kill Monty's murderer.</p>\n<p>[/SPOILERS]</p>\n<p>There are a handful of other details about the game I remember vividly, including the very fun opening puzzle, however this post is probably long enough as it is. If anyone would like me to post more of my memories of this game, I can always do so in the future.</p>\n<p>I don't remember what happened to my old 386, but needless to say it is long gone. The reason I'm posting is that I think about this game a lot lately and I'm really curious if anyone else remembers playing it. If anyone else actually still <em>has</em> this game and can share it, I would be absolutely thrilled. Even though I spoiled the ending for myself, I'm pretty sure there is a lot more content in the game that would be completely fresh to me. I've tried to track it down via the usual things; Google, Wayback, IF archive. No luck there. If anyone has any ideas, please let me know.</p>\n\n",
      "PostDate": "2024-04-24T17:19:44.6981222Z",
      "LastEditDate": null,
      "link": null
    }
  ]
}
