{
  "Topic": {
    "TopicId": "vhiil4l_70uqpjlsrr_b2q",
    "ForumId": "3",
    "Title": "Which website to post my stories?",
    "LastUpdated": "2023-08-09T13:11:47.3904423Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "44362193-9d91-4d40-a844-30b74239460a",
      "UserId": 31991,
      "Username": "daeun",
      "AvatarUrl": "https://i.imgur.com/cX50WTzb.jpg",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Well, things got complicated, I kept posting short stories on gaming forums and I am getting warned about it, I do not know if losing my gaming forum is equals to losing my game account, but whatever, I do not want to risk it.\r\n\r\nI have various fighting fantasy styled stories that I can placed in textadventures, which is here.\r\nBut many of my other stories do not have a player's choice, they are just short stories about medieval rpgs, future sci-fi livelihood possibilities, less-explored moralities and my favourite dystopia fiction and the characters dying one by one.\r\n\r\nOption 1 - Post unplayable stories on textadventures because who cares and I like this site anyway.\r\n\r\nOption 2 - Go visit and use the top 10 stories website, which I read some books and it was more like a powerpoint with few words and weird topic like music fans saying how thankful to their musicians, with like, no stories, and few words. Man this place is weird.\r\n\r\nOption 3 - RPG--------, I blurred out the rest because I do not want to be advertising, this site sells rpg, and usually their rpg books have lots of stories to make the book \"fat\" and worth of buying, however the site take 30% of my profits and who knows, it is opened wide for viewing, all the best authors are probably gathered here and can easily steal my ideas, stories and paraphrase, it sounds like a nightmare but my gut instinct always turned up to be right.\r\n\r\nOption 4 - You----, So these are video websites, I can easily generate a story picture using AI, but the text to speech thing is mind-boggling, the AI voice does not gets excited during climax and the AI voice does not get scared during pitfalls, it is like the AI voice have no emotions, and on top of that I have to pay a monthly fee to setup AI voice, sounds very bad but I visit video websites daily and there are other horror fiction writers there already.\r\n\r\nOption 5 - Open a blog, I have opened many blogs in the past, only one survived, and it is more in the form of beautiful pictures. Blog is very difficult to manage to edit and recategorize and redate and I have no idea how to generate blog visitors as well.\r\n\r\nOption 6 - Create more gaming accounts and post on their forums about my stories which they have no interest about, sounds like a lose lose situation.\r\n\r\nOption 7 - Keep it to myself, my grammar is bad and I like to use shortforms, people reading my stories will probably learn some bad english habits along the way.\r\n\r\nOption 8 - Red----, this is like many forums jumbled into one website. As much as I love this place, posting content here is going to be difficult, other people that post contents will push your content down until it vanishes. I do not want to force people to read my stories, but at least I want my readers to be easily able to navigate my contents, which is why I love textadventures, everything is organized in the author's page which is linked on every single posted story, awesome.\r\n\r\nOption 9 - Yeah, you did not read the whole thing did you, just remember E=MC squared, this is the whole point and summary of this forum post.\r\n",
      "EditableFormat": "markdown",
      "HTML": "<p>Well, things got complicated, I kept posting short stories on gaming forums and I am getting warned about it, I do not know if losing my gaming forum is equals to losing my game account, but whatever, I do not want to risk it.</p>\n<p>I have various fighting fantasy styled stories that I can placed in textadventures, which is here.<br>\nBut many of my other stories do not have a player's choice, they are just short stories about medieval rpgs, future sci-fi livelihood possibilities, less-explored moralities and my favourite dystopia fiction and the characters dying one by one.</p>\n<p>Option 1 - Post unplayable stories on textadventures because who cares and I like this site anyway.</p>\n<p>Option 2 - Go visit and use the top 10 stories website, which I read some books and it was more like a powerpoint with few words and weird topic like music fans saying how thankful to their musicians, with like, no stories, and few words. Man this place is weird.</p>\n<p>Option 3 - RPG--------, I blurred out the rest because I do not want to be advertising, this site sells rpg, and usually their rpg books have lots of stories to make the book \"fat\" and worth of buying, however the site take 30% of my profits and who knows, it is opened wide for viewing, all the best authors are probably gathered here and can easily steal my ideas, stories and paraphrase, it sounds like a nightmare but my gut instinct always turned up to be right.</p>\n<p>Option 4 - You----, So these are video websites, I can easily generate a story picture using AI, but the text to speech thing is mind-boggling, the AI voice does not gets excited during climax and the AI voice does not get scared during pitfalls, it is like the AI voice have no emotions, and on top of that I have to pay a monthly fee to setup AI voice, sounds very bad but I visit video websites daily and there are other horror fiction writers there already.</p>\n<p>Option 5 - Open a blog, I have opened many blogs in the past, only one survived, and it is more in the form of beautiful pictures. Blog is very difficult to manage to edit and recategorize and redate and I have no idea how to generate blog visitors as well.</p>\n<p>Option 6 - Create more gaming accounts and post on their forums about my stories which they have no interest about, sounds like a lose lose situation.</p>\n<p>Option 7 - Keep it to myself, my grammar is bad and I like to use shortforms, people reading my stories will probably learn some bad english habits along the way.</p>\n<p>Option 8 - Red----, this is like many forums jumbled into one website. As much as I love this place, posting content here is going to be difficult, other people that post contents will push your content down until it vanishes. I do not want to force people to read my stories, but at least I want my readers to be easily able to navigate my contents, which is why I love textadventures, everything is organized in the author's page which is linked on every single posted story, awesome.</p>\n<p>Option 9 - Yeah, you did not read the whole thing did you, just remember E=MC squared, this is the whole point and summary of this forum post.</p>\n\n",
      "PostDate": "2023-08-09T13:11:47.3904423Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "de5b6c13-47e3-4748-904c-f4ca71c52374",
      "UserId": 1142,
      "Username": "Cryophile",
      "AvatarUrl": "https://secure.gravatar.com/avatar/cbb093447274bd6d64613a0a60a7ab52?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "I don't really have a comment about which website to choose or the options here, but I wanted to say that as long as it's clear you're not a bot and the content is at least relevant to Interactive Fiction you're absolutely free to advertise your own games occasionally or to discuss competing systems and websites on these forums. We will never censor or restrict discussion that is IF-related as long as it at least follows common-sense etiquette (be nice, etc.).\r\n\r\nJust wanted to point this out since you're censoring names and you don't have to worry about that stuff here.",
      "EditableFormat": "markdown",
      "HTML": "<p>I don't really have a comment about which website to choose or the options here, but I wanted to say that as long as it's clear you're not a bot and the content is at least relevant to Interactive Fiction you're absolutely free to advertise your own games occasionally or to discuss competing systems and websites on these forums. We will never censor or restrict discussion that is IF-related as long as it at least follows common-sense etiquette (be nice, etc.).</p>\n<p>Just wanted to point this out since you're censoring names and you don't have to worry about that stuff here.</p>\n\n",
      "PostDate": "2023-08-09T19:14:53.8063395Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "3d1172fa-691f-4e53-beef-c6eb807087e8",
      "UserId": 31991,
      "Username": "daeun",
      "AvatarUrl": "https://i.imgur.com/cX50WTzb.jpg",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "The thing is that I am not talking about interactive fiction, but in a way, storywriting is indeed relevant to interactive fiction.\r\nWhen I make games on textadventures, I was not able to come up with stories on the fly, my head is being boggled with coding, player gameplay and possible outcomes. But if I have a nice app or website to publish my short stories, I can actually see who likes what, and reuse the stories when I am making interactive fiction on textadventure.\r\n\r\nBut the point of this new comment is that I had cold touch the new websites with my feet and experience it myself.\r\nInkitt is possibly germany, commaful and wattpad is possibly america.\r\n\r\nInkitt felt ridiculous, I could not tell whether or not my story was even published or not until today when I received an email saying I passed, \"dude, so if I do not pass, you are not going to publish it?\". But the truth might be deeper than what I think, there could be previous cases of copyrighted material being uploaded or similar acts.\r\n\r\nCommaful was ridiculous, it is an auto generated background image while you post mini stories inside that small powerpoint, most people are writing about their emotions, feelings or even admirations about their idols or TV characters being in imaginary romance with each other. But the stories I posted was given thanks and comments by people, it feels like happy hormones like those facebook type, but being unable to check who actually gave those thanks made me feel suspicious that it might just be bots from that website itself and not real people. But most importantly, I felt most welcome here.\r\n\r\nWattpad have an annoying premium button flashing at you wherever you go. The possibility to earn money as a book reader is a double-edged sword as I am faced with random paid books as well. It is the laggiest website for me as well, even though I am half the earth away, it is basically text, so I dun quite understand why. I know I am not a serious author, but having zero views on my published story seems as good as just keeping the document in my own pc.\r\n\r\nWhile I will continue to engage these sites and possibly post a few more stories, I can tell that by their main website page, they are only showing the hottest and most read stories, new authors like me, lol, is going to be hidden under the blanket.\r\nCommaful does have more reader engagement 30 views but when compared to 1000 views in pc gaming forum in day one, it is a far cry. And being forced to use a powerpoint template and an automated background picture might break the immersion of my story, imagine story of draculas fighting each other and strawberry pictures behind.\r\n",
      "EditableFormat": "markdown",
      "HTML": "<p>The thing is that I am not talking about interactive fiction, but in a way, storywriting is indeed relevant to interactive fiction.<br>\nWhen I make games on textadventures, I was not able to come up with stories on the fly, my head is being boggled with coding, player gameplay and possible outcomes. But if I have a nice app or website to publish my short stories, I can actually see who likes what, and reuse the stories when I am making interactive fiction on textadventure.</p>\n<p>But the point of this new comment is that I had cold touch the new websites with my feet and experience it myself.<br>\nInkitt is possibly germany, commaful and wattpad is possibly america.</p>\n<p>Inkitt felt ridiculous, I could not tell whether or not my story was even published or not until today when I received an email saying I passed, \"dude, so if I do not pass, you are not going to publish it?\". But the truth might be deeper than what I think, there could be previous cases of copyrighted material being uploaded or similar acts.</p>\n<p>Commaful was ridiculous, it is an auto generated background image while you post mini stories inside that small powerpoint, most people are writing about their emotions, feelings or even admirations about their idols or TV characters being in imaginary romance with each other. But the stories I posted was given thanks and comments by people, it feels like happy hormones like those facebook type, but being unable to check who actually gave those thanks made me feel suspicious that it might just be bots from that website itself and not real people. But most importantly, I felt most welcome here.</p>\n<p>Wattpad have an annoying premium button flashing at you wherever you go. The possibility to earn money as a book reader is a double-edged sword as I am faced with random paid books as well. It is the laggiest website for me as well, even though I am half the earth away, it is basically text, so I dun quite understand why. I know I am not a serious author, but having zero views on my published story seems as good as just keeping the document in my own pc.</p>\n<p>While I will continue to engage these sites and possibly post a few more stories, I can tell that by their main website page, they are only showing the hottest and most read stories, new authors like me, lol, is going to be hidden under the blanket.<br>\nCommaful does have more reader engagement 30 views but when compared to 1000 views in pc gaming forum in day one, it is a far cry. And being forced to use a powerpoint template and an automated background picture might break the immersion of my story, imagine story of draculas fighting each other and strawberry pictures behind.</p>\n\n",
      "PostDate": "2023-08-12T13:17:00.5710938Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "3ff7fa68-0023-4278-a6d1-33f6c3fa1a43",
      "UserId": 31991,
      "Username": "daeun",
      "AvatarUrl": "https://i.imgur.com/cX50WTzb.jpg",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "After 1 week, I have come to a conclusion that using commaful is the best for me as it helps to track the popularity of my short stories. Many other big publishing sites like Inkitt and Wattpad is not suitable for me as my stories are deemed too weak as compared to the other professionally written stories written there.\r\n\r\nOption 1 - Although it is possible to post not-interactive stories on textadventures, it will jam up the game directory and even my own personal list of games. But if anyone is doing so, it is recommended to just put \"Just story only\" along the game's description.\r\n\r\nOption 2 - Go visit and use the top 10 stories website. I published on wattpad and Inkitt but my stories have no views, this could be due to the fact that I am writing 1000 words whereas other writers are writing 20k words. After reading their novels and dozing off, I realized they are just prolonging their stories and not actually moving the whole story narrative forward, and I want my stories to be straight to the point despite being badly written. I published on commaful and I am getting page views, but seriously, just 15 seconds after publishing it, I get 30 views and then no views for the next 24 hours, the whole thing reeks of bots, it makes me rethink the whole of my life and decisions along the way being affected by bots.\r\n\r\nOption 3 - DriveThruRPG, this is where the top fictional rpg writers gather here. I lost the confidence to post after seeing other decent publishers getting scolded for typos, I literally treat typos as prove that I am not a bot and my works are of originality and many other excuses.\r\n\r\nOption 4 - Youtube, So these are video websites, I deemed it too much work to gather story picture from AI generator and speech tape from AI voice, all these works goes into editing and making sure everything does not fall apart is just unnecessary for me as an amateur story writer. Considering that the famous horror fiction writers are posting 1 long story a day, they might already have a vault of stories or helpers to do all that editing work for him, which I do not have.\r\n\r\nOption 5 - I determine that pictures generates more views for blogs. So text and stories cannot push the popularity fast enough to make it work. This is according to my personal experience as only my picture blog survived.\r\n\r\nOption 6 - Create more gaming accounts and post on their forums about my stories. This works but is unnecessary, it is like going to a teahouse and start doing pushups.\r\n\r\nOption 7 - Keep it to myself, this works and I will keep long stories to myself as commaful requires splitting of stories into short sentences into each powerpoint. And when I want to reuse the stories, I will need to copy all the powerpoint sites back one by one.\r\n\r\nOption 8 - Reddit, this is an easy place to post, just that your story will be pushed down by other stories and forgotten. So I tried to post a story and realized that there are no such community, perhaps they already knew what I am talking about and that this is not the best place to be posting stories.\r\n\r\nOption 9 - nanowrimo, this site is as unconvenient as it can be, unallowing page visitors to see the stories posted will ultimately reduce the story views, so I gave up before making an account.\r\n\r\nOption 10 - I love 750 words, yeah, write random junk everyday, yeah, clear thoughts and focus on life, yeah, I can see other people's stories, what? This is a free trial? You saying I need to pay you monthly just to post my stories? Ah ah, next option.\r\n\r\nOption 11 - I know I had only scratch the surface of story writing sites, so if you have more, just let me know. I had searched intensively for a week, while many sites works, I do have a few requirements. I want to be able track some history of some kind, like page views, so I actually know which of my story is more interesting and that I dun really want to be paying money or any sort of that thing.\r\n\r\n_____________________________________________________________________\r\n\r\nEdited new info on 17th august 2023\r\n\r\nUnfortunately Commaful seems to be a fraud or is playing with words.\r\nThe page views stated on stat analysis seems to refer to each powerpoint read instead, and that includes your own views.\r\nAnd another test have shown that other people that read my stories are not really shown on my page views, because I tested on not reading it at all, I am getting 0 page views but somehow I am getting 1 thanks? So, would someone gives thanks without reading a single page of my story?\r\n\r\nI am unfortunately quite attached to the site already and will remain on it unless I have or someone gives me something better.",
      "EditableFormat": "markdown",
      "HTML": "<p>After 1 week, I have come to a conclusion that using commaful is the best for me as it helps to track the popularity of my short stories. Many other big publishing sites like Inkitt and Wattpad is not suitable for me as my stories are deemed too weak as compared to the other professionally written stories written there.</p>\n<p>Option 1 - Although it is possible to post not-interactive stories on textadventures, it will jam up the game directory and even my own personal list of games. But if anyone is doing so, it is recommended to just put \"Just story only\" along the game's description.</p>\n<p>Option 2 - Go visit and use the top 10 stories website. I published on wattpad and Inkitt but my stories have no views, this could be due to the fact that I am writing 1000 words whereas other writers are writing 20k words. After reading their novels and dozing off, I realized they are just prolonging their stories and not actually moving the whole story narrative forward, and I want my stories to be straight to the point despite being badly written. I published on commaful and I am getting page views, but seriously, just 15 seconds after publishing it, I get 30 views and then no views for the next 24 hours, the whole thing reeks of bots, it makes me rethink the whole of my life and decisions along the way being affected by bots.</p>\n<p>Option 3 - DriveThruRPG, this is where the top fictional rpg writers gather here. I lost the confidence to post after seeing other decent publishers getting scolded for typos, I literally treat typos as prove that I am not a bot and my works are of originality and many other excuses.</p>\n<p>Option 4 - Youtube, So these are video websites, I deemed it too much work to gather story picture from AI generator and speech tape from AI voice, all these works goes into editing and making sure everything does not fall apart is just unnecessary for me as an amateur story writer. Considering that the famous horror fiction writers are posting 1 long story a day, they might already have a vault of stories or helpers to do all that editing work for him, which I do not have.</p>\n<p>Option 5 - I determine that pictures generates more views for blogs. So text and stories cannot push the popularity fast enough to make it work. This is according to my personal experience as only my picture blog survived.</p>\n<p>Option 6 - Create more gaming accounts and post on their forums about my stories. This works but is unnecessary, it is like going to a teahouse and start doing pushups.</p>\n<p>Option 7 - Keep it to myself, this works and I will keep long stories to myself as commaful requires splitting of stories into short sentences into each powerpoint. And when I want to reuse the stories, I will need to copy all the powerpoint sites back one by one.</p>\n<p>Option 8 - Reddit, this is an easy place to post, just that your story will be pushed down by other stories and forgotten. So I tried to post a story and realized that there are no such community, perhaps they already knew what I am talking about and that this is not the best place to be posting stories.</p>\n<p>Option 9 - nanowrimo, this site is as unconvenient as it can be, unallowing page visitors to see the stories posted will ultimately reduce the story views, so I gave up before making an account.</p>\n<p>Option 10 - I love 750 words, yeah, write random junk everyday, yeah, clear thoughts and focus on life, yeah, I can see other people's stories, what? This is a free trial? You saying I need to pay you monthly just to post my stories? Ah ah, next option.</p>\n<p>Option 11 - I know I had only scratch the surface of story writing sites, so if you have more, just let me know. I had searched intensively for a week, while many sites works, I do have a few requirements. I want to be able track some history of some kind, like page views, so I actually know which of my story is more interesting and that I dun really want to be paying money or any sort of that thing.</p>\n<hr>\n<p>Edited new info on 17th august 2023</p>\n<p>Unfortunately Commaful seems to be a fraud or is playing with words.<br>\nThe page views stated on stat analysis seems to refer to each powerpoint read instead, and that includes your own views.<br>\nAnd another test have shown that other people that read my stories are not really shown on my page views, because I tested on not reading it at all, I am getting 0 page views but somehow I am getting 1 thanks? So, would someone gives thanks without reading a single page of my story?</p>\n<p>I am unfortunately quite attached to the site already and will remain on it unless I have or someone gives me something better.</p>\n\n",
      "PostDate": "2023-08-15T04:30:31.3929003Z",
      "LastEditDate": "2023-08-16T16:04:18.6446543Z",
      "link": null
    }
  ]
}
