{
  "Topic": {
    "TopicId": "1221",
    "ForumId": "3",
    "Title": "Davidw",
    "LastUpdated": "2006-07-11T17:25:26+01:00",
    "ReplyCount": 6
  },
  "Posts": [
    {
      "PostId": "9606",
      "UserId": 0,
      "Username": "O_VAUGHAN",
      "UserAvatar": null,
      "UserGravatar": "7796ca0ef862f47da53ff41e1db62c5d",
      "EditableText": "Does Davidw's oversized ego demand that he fund a vast web of intrusive perverts, supercilious calumniators, and avaricious yokels? If you've ever wondered about the answer to that question, then read on. Those readers of brittle disposition might do well to await a ride on the next emotionally indulgent transport; this one is scheduled nonstop over rocky roads. As soon as you're strapped in, I'll announce something to the effect of how there is still hope for our society, real hope -- not the false sense of hope that comes from the mouths of disrespectful bloodsuckers, but the hope that makes you eager to advocate concrete action and specific quantifiable goals. Whenever davidw tries to promote promiscuity and obscene language, so do sinful megalomaniacs. Similarly, whenever he attempts to cause people to betray one another and hate one another, self-absorbed, insane jejune-types typically attempt the same. I do not seek to draw any causal scheme from these correlations. I mention them only because the irony is that his most impractical jokes are also his most hectoring. As the French say, &quot;Les extremes se touchent.&quot; \n\nSome inane tyrants are actually considering helping Davidw develop mind-control technology. How quickly such people forget that they were lied to, made fun of, and ridiculed by davidw on numerous occasions. Somebody has to advocate social change through dialogue, passive resistance, and nonviolence. That somebody can be you. In any case, I recently informed Davidw that his serfs flout all of society's rules. Davidw said he'd &quot;look further into the matter.&quot; Well, not too much further; after all, the justification he gave for seeking to develop a credible pretext to forcibly silence his opponents was one of the most irritating justifications I've ever heard. It was so irritating, in fact, that I will not repeat it here. Even without hearing the details you can still see my point quite clearly: Davidw's hypnopompic insights have been a millstone around our neck for quite some time. In fact, I have said that to Davidw on many occasions and I will keep on saying it until he stops trying to rip apart causes that others feel strongly about. Currently, Daviw's sentiments merely make us less united, less moral, less sensitive, less engaged, and more perversely temperamental. As you will see by next weekend, this is only the tip of a gigantic iceberg. \n\nWhen I look back I think, &quot;Devious Trotskyism is Davidw's preferred quick-fix solution to complex cultural problems.&quot; Don't get me wrong; Davidw does not hold himself answerable to any code of honor. But davidw's allegations are not our only concern. To state the matter in a few words, Davidw coins polysyllabic neologisms to make his histrionics sound like they're actually important. In fact, his treatises are filled to the brim with words that have yet to appear in any accepted dictionary. At the risk of repeating myself, I must reiterate that he keeps telling everyone within earshot that children should get into cars with strangers who wave lots of yummy candy at them. I'm guessing that Davidw read that on some Web site of dubious validity. More reliable sources generally indicate that if he thinks that he has achieved sainthood, then he's sadly mistaken. While the most vainglorious lotharios I've ever seen have previously relied on violence to get their way, their new manipulation of ruthless policies has combined with violence to sell quack pharmaceutical supplies (and you should be suspicious whenever you hear such tell-tale words and phrases as &quot;breakthrough&quot;, &quot;miracle&quot;, &quot;secret remedy&quot;, &quot;exclusive&quot;, and &quot;clinical studies prove that...&quot;). For your edification, I should sincerely point out that there are those who are informed and educated about the evils of misoneism, and there are those who are not. Davidw is one of the uninformed, naturally, and that's why one of the things I find quite interesting is listening to other people's takes on things. For instance, I recently overheard some folks remark that his secret police often reverse the normal process of interpretation. That is, they value the unsaid over the said, the obscure over the clear. \n\nDavidw has warned us that faster than you can say &quot;hyperconscientiousness&quot;, footling sods will spoil the whole Zen Buddhist New Age mystical rock-worshipping aura of our body chakras. If you think about it, you'll realize that Davidw's warning is a self-fulfilling prophecy in the sense that whatever your age, you now have only one choice. That choice is between a democratic, peace-loving regime that, you hope, may enable patriots to use their freedoms to save their freedoms and, as the alternative, the stupid and doctrinaire dirigisme currently being forced upon us by daavidw. Choose carefully, because if I wanted to brainwash and manipulate a large segment of the population, I would convince them that all it takes to solve our social woes are shotgun marriages, heavy-handed divorce laws, and a return to some mythical 1950s Shangri-la. In fact, that's exactly what Davidw does as part of his quest to dominate or intimidate others. Sure, Davidw can fabulize about how he has his moral compass in tact. That doesn't change the fact that he likes to enshrine irrational fears and fancies as truth. Such activity can flourish only in the dark, however. If you drag it into the open, Davidw and his adulators will run for cover, like cockroaches in a dirty kitchen when the light is turned on suddenly during the night. That's why we must listen to others. Far be it for me to interfere with my efforts to throw down the gauntlet and challenge his disciples to make the world safe for democracy. Ignorance is bliss. This may be why his drones are generally all smiles. \n\nMaybe it's just me, but don't you think that Davidw's philippics will send us to hell in a handbasket as soon as our backs are turned? Those who fail to learn from history are doomed to repeat it. Of course, if Davidw had learned anything from history, he'd know that only through education can individuals gain the independent tools they need to restore the world back to its original balance. But the first step is to acknowledge that Davidw once tried convincing me that two wrongs make a right. Does he think I was born yesterday? I mean, it seems pretty obvious that Davidw used to complain about being persecuted. Now he is our primary persecutor. This reversal of roles reminds me that Davidw's &quot;I'm right and you're wrong&quot; attitude is callous, because it leaves no room for compromise. davidw is terrified that there might be an absolute reality outside himself, a reality that is what it is, regardless of his wishes, theories, hopes, daydreams, or decrees. If there's a rule, and he keeps making exceptions to that rule, then what good is the rule? I mean, I cannot promise not to be angry at him. I do promise, however, to try to keep my anger under control, to keep it from leading me -- as it leads Davidw -- to undermine the current world order. \n\nYou should never forget the three most important facets of Davidw's hastily mounted campaigns, namely their ostentatious origins, their internal contradictions, and their tendentious nature. Viewing all this from a higher vantage point, we can see that Davidw is completely versipellous. When he's among plebeians, Davidw warms the cockles of their hearts by remonstrating against frotteurism. But when Davidw's safely surrounded by his collaborators, he instructs them to rewrite and reword much of humanity's formative works to favor immoralism. That type of cunning two-sidedness tells us that everything I've said so far is by way of introduction to the key point I want to make in this letter. My key point is that Davidw uses a rather unprofessional definition of &quot;superserviceableness&quot;. If you don't believe me, see for yourself. Because of Davidw's obsession with barbarism, his zingers are a house of mirrors. How are we to find the opening that leads to freedom? If you need help in answering that question, you may note that he is always trying to change the way we work. This annoys me, because Davidw's previous changes have always been for the worse. I'm positive that his new changes will be even more humorless, because Davidw's antics were never about tolerance and equality. That was just window dressing for the &quot;innocents&quot;. Rather, if davidw were to issue a flood of bogus legal documents, social upheaval and violence would follow. It is therefore clear that if you think that this is humorous or exaggerated, you're wrong. Davidw's habitués get a thrill out of protesting. They have no idea what causes they're fighting for or against. For them, going down to the local protest, carrying a sign, hanging out with Davidw, and meeting some other sappy bohemians is merely a social event. They're not even aware that Davidw's inveracities are a pitiful jumble of incoherent nonsense. In reaching that conclusion, I have made the usual assumption that there are some incomprehensible thought police who are rummy. There are also some who are Pecksniffian. Which category does Davidw fall into? If the question overwhelms you, I suggest you check &quot;both&quot;. What Davidw doesn't realize is that his lamentations are based on a denial of reality, on the substitution of a deliberately falsified picture of the world in place of reality. And this dishonesty, this refusal to admit the truth, will have some very serious consequences for all of us in the near future. \n\nMy argument is that it is better to remain silent and be thought a fool than to speak and remove all doubt. Ridiculous? Not so. \n\nThe space remaining in this letter will not suffice even to enumerate the ways in which Davidw has tried to condone universal oppression. Will his combative, ungrateful companions scapegoat easy, unpopular targets, thereby diverting responsibility from more culpable parties? Only time will tell. What I want to document now is that he is absolutely gung-ho about unilateralism because he lacks more pressing soapbox issues. Let me move now from the abstract to the concrete. That is, let me give you a (mercifully) few examples of Davidw's outrageous ineptitude. For starters, if he gets his way, we will soon be engulfed in a Dark Age of commercialism and indescribable horror. That's why I'm telling you that Davidw's objectives are a load of bunk. I use this delightfully pejorative term, &quot;bunk&quot; -- an alternative from the same page of my criminal-slang lexicon would serve just as well -- because Davidw should clarify his point so people like you and me can tell what the heck he's talking about. Without clarification, Davidw's perversions sound lofty and include some emotionally charged words but don't really seem to make any sense. \n\nJustice isn't served when Davidw's crimes go unpunished. That, in itself, will condemn us to live with pernicious palookas sometime soon. The final product of Davidw's cop-outs will be a dysfunctional society, wherein every natural self-defense mechanism has been short-circuited in some uncivilized effort to gain short-term financial benefits, the point being that he has been trying to convince us that his revenge fantasies won't be used for political retribution. This pathetic attempt to usher in the rule of the Antichrist and the apocalyptic end times deserves no comment other than to say that some people think it's a bit extreme of me to expose some of Davidw's unrestrained deeds -- a bit over the top, perhaps. Well, what I ought to remind such people is that those of us who are still sane, those of us who still have a firm grip on reality, those of us who still contend that Davidw's traducements are out of step with democratic practices of equity and fair play, have an obligation to do more than just observe what Davidw is doing from a safe distance. We have an obligation to do something good for others. We have an obligation to take the initiative to instill a sense of responsibility and maturity in those who capitalize on our needs and vulnerabilities. And we have an obligation to get us out of the hammerlock that he is holding us in. \n\nDo I want Davidw to open the floodgates of separatism? No, thank you very much; I would much rather discuss, openly and candidly, a vision for a harmonious, multiracial society. That's a very important point; his activities are built on lies and they depend on make-believe for their continuation. To summarize my views: I went puce with rage when I first heard Davidw say that he never engages in obstinate, pharisaical, or disagreeable politics.",
      "EditableFormat": "bbcode",
      "HTML": "Does Davidw's oversized ego demand that he fund a vast web of intrusive perverts, supercilious calumniators, and avaricious yokels? If you've ever wondered about the answer to that question, then read on. Those readers of brittle disposition might do well to await a ride on the next emotionally indulgent transport; this one is scheduled nonstop over rocky roads. As soon as you're strapped in, I'll announce something to the effect of how there is still hope for our society, real hope -- not the false sense of hope that comes from the mouths of disrespectful bloodsuckers, but the hope that makes you eager to advocate concrete action and specific quantifiable goals. Whenever davidw tries to promote promiscuity and obscene language, so do sinful megalomaniacs. Similarly, whenever he attempts to cause people to betray one another and hate one another, self-absorbed, insane jejune-types typically attempt the same. I do not seek to draw any causal scheme from these correlations. I mention them only because the irony is that his most impractical jokes are also his most hectoring. As the French say, &quot;Les extremes se touchent.&quot; <br/><br/>Some inane tyrants are actually considering helping Davidw develop mind-control technology. How quickly such people forget that they were lied to, made fun of, and ridiculed by davidw on numerous occasions. Somebody has to advocate social change through dialogue, passive resistance, and nonviolence. That somebody can be you. In any case, I recently informed Davidw that his serfs flout all of society's rules. Davidw said he'd &quot;look further into the matter.&quot; Well, not too much further; after all, the justification he gave for seeking to develop a credible pretext to forcibly silence his opponents was one of the most irritating justifications I've ever heard. It was so irritating, in fact, that I will not repeat it here. Even without hearing the details you can still see my point quite clearly: Davidw's hypnopompic insights have been a millstone around our neck for quite some time. In fact, I have said that to Davidw on many occasions and I will keep on saying it until he stops trying to rip apart causes that others feel strongly about. Currently, Daviw's sentiments merely make us less united, less moral, less sensitive, less engaged, and more perversely temperamental. As you will see by next weekend, this is only the tip of a gigantic iceberg. <br/><br/>When I look back I think, &quot;Devious Trotskyism is Davidw's preferred quick-fix solution to complex cultural problems.&quot; Don't get me wrong; Davidw does not hold himself answerable to any code of honor. But davidw's allegations are not our only concern. To state the matter in a few words, Davidw coins polysyllabic neologisms to make his histrionics sound like they're actually important. In fact, his treatises are filled to the brim with words that have yet to appear in any accepted dictionary. At the risk of repeating myself, I must reiterate that he keeps telling everyone within earshot that children should get into cars with strangers who wave lots of yummy candy at them. I'm guessing that Davidw read that on some Web site of dubious validity. More reliable sources generally indicate that if he thinks that he has achieved sainthood, then he's sadly mistaken. While the most vainglorious lotharios I've ever seen have previously relied on violence to get their way, their new manipulation of ruthless policies has combined with violence to sell quack pharmaceutical supplies (and you should be suspicious whenever you hear such tell-tale words and phrases as &quot;breakthrough&quot;, &quot;miracle&quot;, &quot;secret remedy&quot;, &quot;exclusive&quot;, and &quot;clinical studies prove that...&quot;). For your edification, I should sincerely point out that there are those who are informed and educated about the evils of misoneism, and there are those who are not. Davidw is one of the uninformed, naturally, and that's why one of the things I find quite interesting is listening to other people's takes on things. For instance, I recently overheard some folks remark that his secret police often reverse the normal process of interpretation. That is, they value the unsaid over the said, the obscure over the clear. <br/><br/>Davidw has warned us that faster than you can say &quot;hyperconscientiousness&quot;, footling sods will spoil the whole Zen Buddhist New Age mystical rock-worshipping aura of our body chakras. If you think about it, you'll realize that Davidw's warning is a self-fulfilling prophecy in the sense that whatever your age, you now have only one choice. That choice is between a democratic, peace-loving regime that, you hope, may enable patriots to use their freedoms to save their freedoms and, as the alternative, the stupid and doctrinaire dirigisme currently being forced upon us by daavidw. Choose carefully, because if I wanted to brainwash and manipulate a large segment of the population, I would convince them that all it takes to solve our social woes are shotgun marriages, heavy-handed divorce laws, and a return to some mythical 1950s Shangri-la. In fact, that's exactly what Davidw does as part of his quest to dominate or intimidate others. Sure, Davidw can fabulize about how he has his moral compass in tact. That doesn't change the fact that he likes to enshrine irrational fears and fancies as truth. Such activity can flourish only in the dark, however. If you drag it into the open, Davidw and his adulators will run for cover, like cockroaches in a dirty kitchen when the light is turned on suddenly during the night. That's why we must listen to others. Far be it for me to interfere with my efforts to throw down the gauntlet and challenge his disciples to make the world safe for democracy. Ignorance is bliss. This may be why his drones are generally all smiles. <br/><br/>Maybe it's just me, but don't you think that Davidw's philippics will send us to hell in a handbasket as soon as our backs are turned? Those who fail to learn from history are doomed to repeat it. Of course, if Davidw had learned anything from history, he'd know that only through education can individuals gain the independent tools they need to restore the world back to its original balance. But the first step is to acknowledge that Davidw once tried convincing me that two wrongs make a right. Does he think I was born yesterday? I mean, it seems pretty obvious that Davidw used to complain about being persecuted. Now he is our primary persecutor. This reversal of roles reminds me that Davidw's &quot;I'm right and you're wrong&quot; attitude is callous, because it leaves no room for compromise. davidw is terrified that there might be an absolute reality outside himself, a reality that is what it is, regardless of his wishes, theories, hopes, daydreams, or decrees. If there's a rule, and he keeps making exceptions to that rule, then what good is the rule? I mean, I cannot promise not to be angry at him. I do promise, however, to try to keep my anger under control, to keep it from leading me -- as it leads Davidw -- to undermine the current world order. <br/><br/>You should never forget the three most important facets of Davidw's hastily mounted campaigns, namely their ostentatious origins, their internal contradictions, and their tendentious nature. Viewing all this from a higher vantage point, we can see that Davidw is completely versipellous. When he's among plebeians, Davidw warms the cockles of their hearts by remonstrating against frotteurism. But when Davidw's safely surrounded by his collaborators, he instructs them to rewrite and reword much of humanity's formative works to favor immoralism. That type of cunning two-sidedness tells us that everything I've said so far is by way of introduction to the key point I want to make in this letter. My key point is that Davidw uses a rather unprofessional definition of &quot;superserviceableness&quot;. If you don't believe me, see for yourself. Because of Davidw's obsession with barbarism, his zingers are a house of mirrors. How are we to find the opening that leads to freedom? If you need help in answering that question, you may note that he is always trying to change the way we work. This annoys me, because Davidw's previous changes have always been for the worse. I'm positive that his new changes will be even more humorless, because Davidw's antics were never about tolerance and equality. That was just window dressing for the &quot;innocents&quot;. Rather, if davidw were to issue a flood of bogus legal documents, social upheaval and violence would follow. It is therefore clear that if you think that this is humorous or exaggerated, you're wrong. Davidw's habitués get a thrill out of protesting. They have no idea what causes they're fighting for or against. For them, going down to the local protest, carrying a sign, hanging out with Davidw, and meeting some other sappy bohemians is merely a social event. They're not even aware that Davidw's inveracities are a pitiful jumble of incoherent nonsense. In reaching that conclusion, I have made the usual assumption that there are some incomprehensible thought police who are rummy. There are also some who are Pecksniffian. Which category does Davidw fall into? If the question overwhelms you, I suggest you check &quot;both&quot;. What Davidw doesn't realize is that his lamentations are based on a denial of reality, on the substitution of a deliberately falsified picture of the world in place of reality. And this dishonesty, this refusal to admit the truth, will have some very serious consequences for all of us in the near future. <br/><br/>My argument is that it is better to remain silent and be thought a fool than to speak and remove all doubt. Ridiculous? Not so. <br/><br/>The space remaining in this letter will not suffice even to enumerate the ways in which Davidw has tried to condone universal oppression. Will his combative, ungrateful companions scapegoat easy, unpopular targets, thereby diverting responsibility from more culpable parties? Only time will tell. What I want to document now is that he is absolutely gung-ho about unilateralism because he lacks more pressing soapbox issues. Let me move now from the abstract to the concrete. That is, let me give you a (mercifully) few examples of Davidw's outrageous ineptitude. For starters, if he gets his way, we will soon be engulfed in a Dark Age of commercialism and indescribable horror. That's why I'm telling you that Davidw's objectives are a load of bunk. I use this delightfully pejorative term, &quot;bunk&quot; -- an alternative from the same page of my criminal-slang lexicon would serve just as well -- because Davidw should clarify his point so people like you and me can tell what the heck he's talking about. Without clarification, Davidw's perversions sound lofty and include some emotionally charged words but don't really seem to make any sense. <br/><br/>Justice isn't served when Davidw's crimes go unpunished. That, in itself, will condemn us to live with pernicious palookas sometime soon. The final product of Davidw's cop-outs will be a dysfunctional society, wherein every natural self-defense mechanism has been short-circuited in some uncivilized effort to gain short-term financial benefits, the point being that he has been trying to convince us that his revenge fantasies won't be used for political retribution. This pathetic attempt to usher in the rule of the Antichrist and the apocalyptic end times deserves no comment other than to say that some people think it's a bit extreme of me to expose some of Davidw's unrestrained deeds -- a bit over the top, perhaps. Well, what I ought to remind such people is that those of us who are still sane, those of us who still have a firm grip on reality, those of us who still contend that Davidw's traducements are out of step with democratic practices of equity and fair play, have an obligation to do more than just observe what Davidw is doing from a safe distance. We have an obligation to do something good for others. We have an obligation to take the initiative to instill a sense of responsibility and maturity in those who capitalize on our needs and vulnerabilities. And we have an obligation to get us out of the hammerlock that he is holding us in. <br/><br/>Do I want Davidw to open the floodgates of separatism? No, thank you very much; I would much rather discuss, openly and candidly, a vision for a harmonious, multiracial society. That's a very important point; his activities are built on lies and they depend on make-believe for their continuation. To summarize my views: I went puce with rage when I first heard Davidw say that he never engages in obstinate, pharisaical, or disagreeable politics.",
      "PostDate": "2006-07-11T15:10:40+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "9608",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "Well, I suppose I should be flattered that you've got nothing better to do with your time, Vaughan, than devote it to long and rambling posts about me... but, well, you're just plain weird.\n\nAnd also in breach of the new forum rules.\n\nMods, any chance he can be banned this time?",
      "EditableFormat": "bbcode",
      "HTML": "Well, I suppose I should be flattered that you've got nothing better to do with your time, Vaughan, than devote it to long and rambling posts about me... but, well, you're just plain weird.<br/><br/>And also in breach of the new forum rules.<br/><br/>Mods, any chance he can be banned this time?",
      "PostDate": "2006-07-11T15:27:40+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "9609",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "BTW, here's my careful and well thought out response to what you wrote/spewed:\n\nVaughan, you ****ing nutcase!",
      "EditableFormat": "bbcode",
      "HTML": "BTW, here's my careful and well thought out response to what you wrote/spewed:<br/><br/>Vaughan, you ****ing nutcase!",
      "PostDate": "2006-07-11T15:47:06+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "9610",
      "UserId": 0,
      "Username": "O_VAUGHAN",
      "UserAvatar": null,
      "UserGravatar": "7796ca0ef862f47da53ff41e1db62c5d",
      "EditableText": "Call me what you will, Davidw.  I doubt that you even took the time to read the whole thing.  You probably just looked at the length of it and formed your petty judgement.  I doubt that I will be banned for posting it and I stand behind every word.  I wouldn't be surprised if it weren't stickied to the top for all to read and as a reminder to you that you should seek some modicum of humility and abandon your blazing contrail of self-importance and cease your campaign of cyber-terror.  Your hubris knows no bounds as we all know, and your ego eclipses the scope of this forum almost every time you post on it.  Oh no, I am not alone in this, Davidw.  And please note that I have used no profanity in responding to you.",
      "EditableFormat": "bbcode",
      "HTML": "Call me what you will, Davidw.  I doubt that you even took the time to read the whole thing.  You probably just looked at the length of it and formed your petty judgement.  I doubt that I will be banned for posting it and I stand behind every word.  I wouldn't be surprised if it weren't stickied to the top for all to read and as a reminder to you that you should seek some modicum of humility and abandon your blazing contrail of self-importance and cease your campaign of cyber-terror.  Your hubris knows no bounds as we all know, and your ego eclipses the scope of this forum almost every time you post on it.  Oh no, I am not alone in this, Davidw.  And please note that I have used no profanity in responding to you.",
      "PostDate": "2006-07-11T15:59:16+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "9611",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "I hope it gets stickied myself. I've been trying to convince the rest of the forum how insane you are for a while now, and here you go and hand it to me on a platter. Thanks.\n\n[quote:3gihjtge]Davidw has warned us that faster than you can say &quot;hyperconscientiousness&quot;, footling sods will spoil the whole Zen Buddhist New Age mystical rock-worshipping aura of our body chakras.[/quote:3gihjtge]\n\nHa! Whatever drugs you're on, can I have some? It sounds like a blast.",
      "EditableFormat": "bbcode",
      "HTML": "I hope it gets stickied myself. I've been trying to convince the rest of the forum how insane you are for a while now, and here you go and hand it to me on a platter. Thanks.<br/><br/><blockquote><p>Davidw has warned us that faster than you can say &quot;hyperconscientiousness&quot;, footling sods will spoil the whole Zen Buddhist New Age mystical rock-worshipping aura of our body chakras.</p></blockquote><br/><br/>Ha! Whatever drugs you're on, can I have some? It sounds like a blast.",
      "PostDate": "2006-07-11T16:21:06+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "9612",
      "UserId": 0,
      "Username": "steve the gaming guy",
      "UserAvatar": null,
      "UserGravatar": "6577a0affcb6ea711c75baf052ffd08a",
      "EditableText": "*sees subject line and sighs while shaking head",
      "EditableFormat": "bbcode",
      "HTML": "*sees subject line and sighs while shaking head",
      "PostDate": "2006-07-11T16:26:34+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "9613",
      "UserId": 0,
      "Username": "Alex",
      "UserAvatar": null,
      "UserGravatar": "188b72c5e13327f4fde3989dca7d7d53",
      "EditableText": "Yawn. Shut up.",
      "EditableFormat": "bbcode",
      "HTML": "Yawn. Shut up.",
      "PostDate": "2006-07-11T17:25:26+01:00",
      "LastEditDate": null
    }
  ]
}
