{
  "Topic": {
    "TopicId": "1338",
    "ForumId": "3",
    "Title": "Hello, friends",
    "LastUpdated": "2006-10-25T15:50:20+01:00",
    "ReplyCount": 33
  },
  "Posts": [
    {
      "PostId": "11144",
      "UserId": 0,
      "Username": "O_VAUGHAN",
      "UserAvatar": null,
      "UserGravatar": "7796ca0ef862f47da53ff41e1db62c5d",
      "EditableText": "I'm sorry but I have been extremely busy at work and at home as well.  I have also been working on a little literary project that I believe some of you will be interested in.  I have chosen to share a small part of it here in hope of garnering some feedback about it.  \n\nThis exerpt is an analysis of McDonalds' advertising and how it has insidiously mocked Christianity to sell their products.  The overall scope of the book will have to do with the emerging NWO and the conspiracy of the Illuminati against the general population of the Earth.  I am sure that after you read this treatise you will be inspired to do some digging of your own.  At least I hope so.\n[quote:3a1xip9c]\nRonald McDonald: The figurehead \n\nHe is the mouthpiece of the machine. In order for Mcdonalds to have access to our inner space we must be assured and calmed to a point where we ingest their products with abandon. In their infinite wisdom, the Illuminati have chosen the seemingly benign clown to be the muse that delivers their bidding. RM is the interface between McDonalds and the human population of the world. Much like a modern King or Queen he is a figurehead who helps to create the image that the machine will have created. \n\nIn spite of any evil that might be perpetrated upon us, RM is there to divert our attention from it. Even though clowns are inherently evil they overtly come across as gentle comedians, safe for any audience. We are collectively duped by this ruse time and again. \n\nMayor McCheese The Keeper of Order\n\nMM is the real boss but he defers to his right hand man RM most of the time. On the surface, MM appears to be a mumbling, bumbling dolt, but as we know this is far from the truth. MM is, however, much more cunning than he leads us to believe and he is a force to be reconed with. Always there, even if in the background, he is the keeper of order always ready to make a speech if necessary to bring order should chaos become the order of the day. \n\nI would imagine that we would see a lot more of Mayor McCheese if Burger King started outselling McDonalds by any margin but normally, MM is quite content to operate in his shadow world allowing RM to have the public glory.\n\nBig Mac The keeper of the law\n\nBig Mac is there to make sure that the law is followed. It's a good thing, too because there is a surprisingly large criminal conspiracy at hand in this seemingly benign world of absurd characters. Largely he is around to keep RMs treasury of burgers intact and to run interference for him and MM in the midst of the spurrious activity that is always awash in the world of Mcdonaldland. More importantly, BM reassures the public that even though things might not always be Kosher there is law and it is enforced.\n\nTogether, the trinity of MM and BM and RM is highly symbolic and the fact that it elucidates the heart of Christianity is NO coincidence. RM is of course representative of Jesus Christ, MM is as the father and BM is as the Holy Spirit. The powers that be sought to conceal this through such trickery as what would at first glance appear to be silly costumes but when we delve further into this enquiry we see that this is clearly not the case.\n\nThe representations of BM amd MM are quite obvious. Each one is replete with the garb of it's profession, BM in a police uniform and MM in a politician's outfit complete with sash and spectacles in hand. MM is the visage of wisdom and BM is that of authority. The characters PERSONA is that their heads are huge burgers with eyes. MM's head is a Cheeseburger and BMs is a Big Mac respectively. These figures represent the products that McDonalds outwardly serves the public, but their existence is highly unlikely. \n\nI might take this a step further by saying that they are otherworldly, hence their being representations of God The Father and The Holy Spirit. RM is a clown but he is an Earthly character, nonetheless. I have come to the conclusion that the Clown persona is not only to endear him to us but also to give him an air of mystery that we will be even more compelled to listen to his message. In this way he becomes a teacher of the will of McDonalds.\n\nThere is certainly a lot more that can be discussed of those of the higher order of the McDonaldland inhabitants but I will defer on that for now. Let us now delve into the other characters and what they bring to the table.\n\nThe Hamburglar The thief of the land\nCaptain Crook The thief of the sea\nThe French Fry Goblins The evil in the Human Spirit\n\nHamburglar, like MM is seemingly a bumbling dolt. His vocabulary consists of nothing more than saying &quot;robble robble&quot;. The obvious reason for that is that, like a preacher, he more or less hypnotizes his audience with his rythmic chant. This insidious character also represents the Dark side of man. In their wisdom the creators of this propaganda machine also came up with HBs counterpart, Captain Crook. Both of them are perpetually engaged in the crime of stealing mass quantities of McDonald's sandwiches. HB by land and CC by sea. It would appear that their evil activities are tolerated by RM and written off as mere excentricities but once again, the Teachings of Jesus Christ come to mind. Love thy enemy... RM is in a constant state of forgiveness regarding these rogues. Let us also consider that these characters, Like RM are Human. They're real world and that they represent land and sea is no coincidence, either. They tell us that there is danger by land and by sea. The McDonalds trinity has our back, however. By understanding this symbology we begin to see that going in and BUYING McDonalds food that we are doing the bidding of RM and perhaps setting a good example for the representative criminality that s HB and CC. The French Fry Goblins are otherworldly representations of the evil within the Human spirit. They endear themselves to us as they shamelessly pilfer frenchfries from any and all.\n\nThe Grimace The goodness of the Human Spirit\n\nThere has been much debate over the years as to what The Grimace is. So far as I know, there has been no compelling arguement to solve this mystery. I will offer some insight as to what this about. When examining the Grimace one doesn't know what to make of it. It is a rotund sexless speechless being with a perpetual smile on its face. It doesn't really do anything in particular and you can't help but be drawn to it. What the Grimace is is not the question to be asking. The Grimace is NOT. Like MM and BM it is anotherwordly representation. His is that of the Human Spirit. The Grimace stands constantly within the temptatin of good and evil running back and forth not really knowing where to fit in. There is always a sense of unesayness regarding the Grimace due to his precarious nature and it is indeed the role of MM and BM to look out for him AND THEY DO. but they of course defer to RM for their earthly duties. \n\nThe collective lesson is that there is good and evil within all of us. In the Mcdonaldland scenario, the earthly creatures perpetrating evil are HB and CC. The Earthly creature representing the good is RM with the rest of the trinity in tow. As we know, Grimace is RM's best friend and it has also been suggested that &quot;Grimace believes that RM knows everything there is to know in this world&quot;. This, I believe, makes him a flollower of RM. That the goodness of the human spirit would cleave itself to the RM character makes all the more sense, especially when we examine this in the context in which I am presenting it here.\n\n\n\n\n***I WOULD ALSO LIKE TO POINT OUT THAT THE GRIMACE IS THE PROTOTYPE OF BARNEY***\n\nThe powers that be at McDonalds have created a microcasm of the civilized world, its strengths and weaknesses, temptation and salvation. On some level we all relate to this. They are well aware of what they're doing. Eating at McDonalds has become ritualistic. When Americans travel abroad they typically CHECK IN at the McDonalds at least once. When foreigners come to America they check in to the ones here. Like Mecca, Mcdonalds restaurants are important destinations for the initiated. Many will admit to &quot;eating there at least once a week&quot; for example.[/quote:3a1xip9c]",
      "EditableFormat": "bbcode",
      "HTML": "I'm sorry but I have been extremely busy at work and at home as well.  I have also been working on a little literary project that I believe some of you will be interested in.  I have chosen to share a small part of it here in hope of garnering some feedback about it.  <br/><br/>This exerpt is an analysis of McDonalds' advertising and how it has insidiously mocked Christianity to sell their products.  The overall scope of the book will have to do with the emerging NWO and the conspiracy of the Illuminati against the general population of the Earth.  I am sure that after you read this treatise you will be inspired to do some digging of your own.  At least I hope so.<br/><blockquote><p><br/>Ronald McDonald: The figurehead <br/><br/>He is the mouthpiece of the machine. In order for Mcdonalds to have access to our inner space we must be assured and calmed to a point where we ingest their products with abandon. In their infinite wisdom, the Illuminati have chosen the seemingly benign clown to be the muse that delivers their bidding. RM is the interface between McDonalds and the human population of the world. Much like a modern King or Queen he is a figurehead who helps to create the image that the machine will have created. <br/><br/>In spite of any evil that might be perpetrated upon us, RM is there to divert our attention from it. Even though clowns are inherently evil they overtly come across as gentle comedians, safe for any audience. We are collectively duped by this ruse time and again. <br/><br/>Mayor McCheese The Keeper of Order<br/><br/>MM is the real boss but he defers to his right hand man RM most of the time. On the surface, MM appears to be a mumbling, bumbling dolt, but as we know this is far from the truth. MM is, however, much more cunning than he leads us to believe and he is a force to be reconed with. Always there, even if in the background, he is the keeper of order always ready to make a speech if necessary to bring order should chaos become the order of the day. <br/><br/>I would imagine that we would see a lot more of Mayor McCheese if Burger King started outselling McDonalds by any margin but normally, MM is quite content to operate in his shadow world allowing RM to have the public glory.<br/><br/>Big Mac The keeper of the law<br/><br/>Big Mac is there to make sure that the law is followed. It's a good thing, too because there is a surprisingly large criminal conspiracy at hand in this seemingly benign world of absurd characters. Largely he is around to keep RMs treasury of burgers intact and to run interference for him and MM in the midst of the spurrious activity that is always awash in the world of Mcdonaldland. More importantly, BM reassures the public that even though things might not always be Kosher there is law and it is enforced.<br/><br/>Together, the trinity of MM and BM and RM is highly symbolic and the fact that it elucidates the heart of Christianity is NO coincidence. RM is of course representative of Jesus Christ, MM is as the father and BM is as the Holy Spirit. The powers that be sought to conceal this through such trickery as what would at first glance appear to be silly costumes but when we delve further into this enquiry we see that this is clearly not the case.<br/><br/>The representations of BM amd MM are quite obvious. Each one is replete with the garb of it's profession, BM in a police uniform and MM in a politician's outfit complete with sash and spectacles in hand. MM is the visage of wisdom and BM is that of authority. The characters PERSONA is that their heads are huge burgers with eyes. MM's head is a Cheeseburger and BMs is a Big Mac respectively. These figures represent the products that McDonalds outwardly serves the public, but their existence is highly unlikely. <br/><br/>I might take this a step further by saying that they are otherworldly, hence their being representations of God The Father and The Holy Spirit. RM is a clown but he is an Earthly character, nonetheless. I have come to the conclusion that the Clown persona is not only to endear him to us but also to give him an air of mystery that we will be even more compelled to listen to his message. In this way he becomes a teacher of the will of McDonalds.<br/><br/>There is certainly a lot more that can be discussed of those of the higher order of the McDonaldland inhabitants but I will defer on that for now. Let us now delve into the other characters and what they bring to the table.<br/><br/>The Hamburglar The thief of the land<br/>Captain Crook The thief of the sea<br/>The French Fry Goblins The evil in the Human Spirit<br/><br/>Hamburglar, like MM is seemingly a bumbling dolt. His vocabulary consists of nothing more than saying &quot;robble robble&quot;. The obvious reason for that is that, like a preacher, he more or less hypnotizes his audience with his rythmic chant. This insidious character also represents the Dark side of man. In their wisdom the creators of this propaganda machine also came up with HBs counterpart, Captain Crook. Both of them are perpetually engaged in the crime of stealing mass quantities of McDonald's sandwiches. HB by land and CC by sea. It would appear that their evil activities are tolerated by RM and written off as mere excentricities but once again, the Teachings of Jesus Christ come to mind. Love thy enemy... RM is in a constant state of forgiveness regarding these rogues. Let us also consider that these characters, Like RM are Human. They're real world and that they represent land and sea is no coincidence, either. They tell us that there is danger by land and by sea. The McDonalds trinity has our back, however. By understanding this symbology we begin to see that going in and BUYING McDonalds food that we are doing the bidding of RM and perhaps setting a good example for the representative criminality that s HB and CC. The French Fry Goblins are otherworldly representations of the evil within the Human spirit. They endear themselves to us as they shamelessly pilfer frenchfries from any and all.<br/><br/>The Grimace The goodness of the Human Spirit<br/><br/>There has been much debate over the years as to what The Grimace is. So far as I know, there has been no compelling arguement to solve this mystery. I will offer some insight as to what this about. When examining the Grimace one doesn't know what to make of it. It is a rotund sexless speechless being with a perpetual smile on its face. It doesn't really do anything in particular and you can't help but be drawn to it. What the Grimace is is not the question to be asking. The Grimace is NOT. Like MM and BM it is anotherwordly representation. His is that of the Human Spirit. The Grimace stands constantly within the temptatin of good and evil running back and forth not really knowing where to fit in. There is always a sense of unesayness regarding the Grimace due to his precarious nature and it is indeed the role of MM and BM to look out for him AND THEY DO. but they of course defer to RM for their earthly duties. <br/><br/>The collective lesson is that there is good and evil within all of us. In the Mcdonaldland scenario, the earthly creatures perpetrating evil are HB and CC. The Earthly creature representing the good is RM with the rest of the trinity in tow. As we know, Grimace is RM's best friend and it has also been suggested that &quot;Grimace believes that RM knows everything there is to know in this world&quot;. This, I believe, makes him a flollower of RM. That the goodness of the human spirit would cleave itself to the RM character makes all the more sense, especially when we examine this in the context in which I am presenting it here.<br/><br/><br/><br/><br/>***I WOULD ALSO LIKE TO POINT OUT THAT THE GRIMACE IS THE PROTOTYPE OF BARNEY***<br/><br/>The powers that be at McDonalds have created a microcasm of the civilized world, its strengths and weaknesses, temptation and salvation. On some level we all relate to this. They are well aware of what they're doing. Eating at McDonalds has become ritualistic. When Americans travel abroad they typically CHECK IN at the McDonalds at least once. When foreigners come to America they check in to the ones here. Like Mecca, Mcdonalds restaurants are important destinations for the initiated. Many will admit to &quot;eating there at least once a week&quot; for example.</p></blockquote>",
      "PostDate": "2006-09-30T19:29:14+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11145",
      "UserId": 0,
      "Username": "GameBoy",
      "UserAvatar": null,
      "UserGravatar": "554e89a053350b96f686f324a6049e9d",
      "EditableText": "Couldn't be bothered reading ALL of it since I personally think anybody who sits there deciding what the hell to complain about next just needs to be shot.\n\nYou're forgetting that we live in a world where marketing (And that's ALL marketing) businesses use a seductive method to sell their products.  That's how you [b:3vudukxv][u:3vudukxv]SELL[/u:3vudukxv][/b:3vudukxv] products, by appealing to people.\n\nMcDonalds used to (And most still do) appeal to children, which is why they used a clown character. (Clowns are usually used at childrens birthday parties), this is not to say that this is because children are vunerable, since most children don't get that free-will until a later age anyway.  Most big companies use a character, real or fictional in a lot of their promotional material, some may use several characters.\n\nJust because you don't think McDonalds taste nice, doesn't mean it's the root of all evil.  Money is the root of all evil.\n\nAnd what's all this &quot;Mocking christianity&quot; bullsh*t?  Who even cares?  If it's such a big deal then perhaps God can come and sort it out himself instead of being a coward and making his puppets do the work for him.  That is of course, if such &quot;God&quot; exists, but we won't get onto that.\n\nNow, you could say this about almost anything.  There are leaders, followers, and workers for the leaders, as well as other individual characters that help to build a fictional world.\n\nYou sound like one of those priests that would spend all day listening to rock music backwards (Probably on some crazy drugs, you'd have to be to sit there listening to rock music backwards), and pick out parts which they believed sounded like devil chanting and whatever.\n\nIf you've really got nothing better to do than complain and accuse large corporate bussiness for &quot;Mocking christianity&quot; or what-the-hell-ever, then try writing about something that we [b:3vudukxv]can't[/b:3vudukxv] avoid.  Nobody asks you to go to McDonalds, you're not forced to use it, unlike a lot of the bad things that we are [b:3vudukxv]forced[/b:3vudukxv] to do and use.",
      "EditableFormat": "bbcode",
      "HTML": "Couldn't be bothered reading ALL of it since I personally think anybody who sits there deciding what the hell to complain about next just needs to be shot.<br/><br/>You're forgetting that we live in a world where marketing (And that's ALL marketing) businesses use a seductive method to sell their products.  That's how you <span style=\"font-weight:bold;\"><span style=\"text-decoration:underline;\">SELL</span></span> products, by appealing to people.<br/><br/>McDonalds used to (And most still do) appeal to children, which is why they used a clown character. (Clowns are usually used at childrens birthday parties), this is not to say that this is because children are vunerable, since most children don't get that free-will until a later age anyway.  Most big companies use a character, real or fictional in a lot of their promotional material, some may use several characters.<br/><br/>Just because you don't think McDonalds taste nice, doesn't mean it's the root of all evil.  Money is the root of all evil.<br/><br/>And what's all this &quot;Mocking christianity&quot; bullsh*t?  Who even cares?  If it's such a big deal then perhaps God can come and sort it out himself instead of being a coward and making his puppets do the work for him.  That is of course, if such &quot;God&quot; exists, but we won't get onto that.<br/><br/>Now, you could say this about almost anything.  There are leaders, followers, and workers for the leaders, as well as other individual characters that help to build a fictional world.<br/><br/>You sound like one of those priests that would spend all day listening to rock music backwards (Probably on some crazy drugs, you'd have to be to sit there listening to rock music backwards), and pick out parts which they believed sounded like devil chanting and whatever.<br/><br/>If you've really got nothing better to do than complain and accuse large corporate bussiness for &quot;Mocking christianity&quot; or what-the-hell-ever, then try writing about something that we <span style=\"font-weight:bold;\">can't</span> avoid.  Nobody asks you to go to McDonalds, you're not forced to use it, unlike a lot of the bad things that we are <span style=\"font-weight:bold;\">forced</span> to do and use.",
      "PostDate": "2006-10-01T03:42:24+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11146",
      "UserId": 0,
      "Username": "O_VAUGHAN",
      "UserAvatar": null,
      "UserGravatar": "7796ca0ef862f47da53ff41e1db62c5d",
      "EditableText": "Look here, mate...\n\nDon't come around posting things like [quote:3fi67wgu]ICouldn't be bothered reading ALL of it since I personally think anybody who sits there deciding what the hell to complain about next just needs to be shot.[/quote:3fi67wgu] \n\nand then offer a commentary about it.  \n\nYour very words above negate anything that you have to say about my book exerpt.  If you want me to take you seriously then read the whole thing and post any exact questions about it that you might have.  At this time I am considering you a troll as well.  I read your attack on CheerleaderChick today too.  Great job, BIG GUY.\n\nNow GO BACK AND READ THE POST AND IF YOU HAVE ANY PERTINANT AND/OR SPECIFIC COMMENTARY THEN I WILL BE GLAD TO RESPOND.  IF YOU DON'T CHOOSE TO GO BACK ND READ IT THEN KINDLY DO NOT POST IN THIS THREAD ANY MORE.",
      "EditableFormat": "bbcode",
      "HTML": "Look here, mate...<br/><br/>Don't come around posting things like <blockquote><p>ICouldn't be bothered reading ALL of it since I personally think anybody who sits there deciding what the hell to complain about next just needs to be shot.</p></blockquote> <br/><br/>and then offer a commentary about it.  <br/><br/>Your very words above negate anything that you have to say about my book exerpt.  If you want me to take you seriously then read the whole thing and post any exact questions about it that you might have.  At this time I am considering you a troll as well.  I read your attack on CheerleaderChick today too.  Great job, BIG GUY.<br/><br/>Now GO BACK AND READ THE POST AND IF YOU HAVE ANY PERTINANT AND/OR SPECIFIC COMMENTARY THEN I WILL BE GLAD TO RESPOND.  IF YOU DON'T CHOOSE TO GO BACK ND READ IT THEN KINDLY DO NOT POST IN THIS THREAD ANY MORE.",
      "PostDate": "2006-10-01T05:47:50+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11147",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "Pssst, Vaughan, only small children and sexually repressed teens type whole sentences in capitals.\n\nFunnily enough, I can picture you as either.",
      "EditableFormat": "bbcode",
      "HTML": "Pssst, Vaughan, only small children and sexually repressed teens type whole sentences in capitals.<br/><br/>Funnily enough, I can picture you as either.",
      "PostDate": "2006-10-01T10:34:04+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11148",
      "UserId": 0,
      "Username": "O_VAUGHAN",
      "UserAvatar": null,
      "UserGravatar": "7796ca0ef862f47da53ff41e1db62c5d",
      "EditableText": "OK, Davidw.  I see you're still as smug as ever.  Even after I posted that long diatribe about you you never HAVE considered how you come across...  Oh well.  I expected as much from you.  \n\nDo you realise how stupid Gameboy's comment was?  He said that he didn't even read the exerpt yet he offered up quite a lively comentary about it.  I got a little bit emotional, that's all.  But you can't even give a guy an inch.  You're still nothing but a bully.",
      "EditableFormat": "bbcode",
      "HTML": "OK, Davidw.  I see you're still as smug as ever.  Even after I posted that long diatribe about you you never HAVE considered how you come across...  Oh well.  I expected as much from you.  <br/><br/>Do you realise how stupid Gameboy's comment was?  He said that he didn't even read the exerpt yet he offered up quite a lively comentary about it.  I got a little bit emotional, that's all.  But you can't even give a guy an inch.  You're still nothing but a bully.",
      "PostDate": "2006-10-01T14:08:15+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11149",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "And you're nothing but a demented idiot.\n\nI used to post comments about you being insane as a way of annoying you, but the more gibberish you post on this forum, the more I begin to realise I was right after all. You [i:1v24mha1]are[/i:1v24mha1] a demented idiot. If you've spent at least part of your life locked up in a lunatic asylum, I wouldn't be at all surprised.",
      "EditableFormat": "bbcode",
      "HTML": "And you're nothing but a demented idiot.<br/><br/>I used to post comments about you being insane as a way of annoying you, but the more gibberish you post on this forum, the more I begin to realise I was right after all. You <span style=\"font-style:italic;\">are</span> a demented idiot. If you've spent at least part of your life locked up in a lunatic asylum, I wouldn't be at all surprised.",
      "PostDate": "2006-10-01T14:14:48+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11152",
      "UserId": 0,
      "Username": "paul_one",
      "UserAvatar": null,
      "UserGravatar": "fef8a1875028f4300bb683f29c432894",
      "EditableText": "I read most of it, skimming over some of the more tedious rubbish.\n\n[quote:z9i4jqqa]an analysis of McDonalds' advertising and how it has insidiously mocked Christianity[/quote:z9i4jqqa]And where is this proof about McDonalds mocking Christianity?\nYou've given your take on the McDonald characters, and tried linking 3 of them to Christ/father/holy ghost.. Where's the rest of you &quot;analysis&quot;?\nWhere's the analysis about their ACTUAL advertising, you know, TV adverts, radio, posters? Instead of this 15-year old rubbish that they don't use anymore?\n\n[quote:z9i4jqqa]emerging NWO and the conspiracy of the Illuminati against the general population of the Earth[/quote:z9i4jqqa]You what? Who the hell are &quot;Illuminati&quot;?\n\n[quote:z9i4jqqa]Much like a modern King or Queen[/quote:z9i4jqqa]Read that again.. Most countries have disgarded their royal families a long time ago.\nTry to think of something which will actually go in here instead of that tripe.\n\n[quote:z9i4jqqa]Even though clowns are inherently evil[/quote:z9i4jqqa]Are you one of those people who are scared of clowns?\nClowns are comedy acts, to entertain the masses, so in which way do they contain an evil quality?\n\n[quote:z9i4jqqa]MM is quite content to operate in his shadow world allowing RM to have the public glory.[/quote:z9i4jqqa]Shadow world? What the HELL have you been smoking?\n\n[quote:z9i4jqqa]MM is as the father and BM is as the Holy Spirit.[/quote:z9i4jqqa]Why? .. How is MM &quot;the father&quot;? Why not BM?\nWhere's you linking them to the actual father/holy spirit using quotes from the bible? Or about Christian stories (I'd guess they'd be in the bible - but I wouldn't know as I'm not religious).\n\n[quote:z9i4jqqa]but their existence is highly unlikely[/quote:z9i4jqqa]Well let's see... Yes, a living being with a bun and cooked meat for a head does sound pretty &quot;unlikely&quot;... Like a -1 on the possibility charts! (yes, I know the lowest is a 0, but I want to express a point).\n\n[quote:z9i4jqqa]give him an air of mystery that we will be even more compelled to listen[/quote:z9i4jqqa]Air of mystery? He's a clown. What is the big bloody mysterious air?\nThat's like saying &quot;coco the monkey.. Wow, he's representing satan, because of his 'mysterious air'&quot; when talking about coco-pops advertising.\n\n[quote:z9i4jqqa]the higher order of the McDonaldland inhabitants[/quote:z9i4jqqa]There are more?\n\nI'd be suprised if any publisher offered to take your book.",
      "EditableFormat": "bbcode",
      "HTML": "I read most of it, skimming over some of the more tedious rubbish.<br/><br/><blockquote><p>an analysis of McDonalds' advertising and how it has insidiously mocked Christianity</p></blockquote>And where is this proof about McDonalds mocking Christianity?<br/>You've given your take on the McDonald characters, and tried linking 3 of them to Christ/father/holy ghost.. Where's the rest of you &quot;analysis&quot;?<br/>Where's the analysis about their ACTUAL advertising, you know, TV adverts, radio, posters? Instead of this 15-year old rubbish that they don't use anymore?<br/><br/><blockquote><p>emerging NWO and the conspiracy of the Illuminati against the general population of the Earth</p></blockquote>You what? Who the hell are &quot;Illuminati&quot;?<br/><br/><blockquote><p>Much like a modern King or Queen</p></blockquote>Read that again.. Most countries have disgarded their royal families a long time ago.<br/>Try to think of something which will actually go in here instead of that tripe.<br/><br/><blockquote><p>Even though clowns are inherently evil</p></blockquote>Are you one of those people who are scared of clowns?<br/>Clowns are comedy acts, to entertain the masses, so in which way do they contain an evil quality?<br/><br/><blockquote><p>MM is quite content to operate in his shadow world allowing RM to have the public glory.</p></blockquote>Shadow world? What the HELL have you been smoking?<br/><br/><blockquote><p>MM is as the father and BM is as the Holy Spirit.</p></blockquote>Why? .. How is MM &quot;the father&quot;? Why not BM?<br/>Where's you linking them to the actual father/holy spirit using quotes from the bible? Or about Christian stories (I'd guess they'd be in the bible - but I wouldn't know as I'm not religious).<br/><br/><blockquote><p>but their existence is highly unlikely</p></blockquote>Well let's see... Yes, a living being with a bun and cooked meat for a head does sound pretty &quot;unlikely&quot;... Like a -1 on the possibility charts! (yes, I know the lowest is a 0, but I want to express a point).<br/><br/><blockquote><p>give him an air of mystery that we will be even more compelled to listen</p></blockquote>Air of mystery? He's a clown. What is the big bloody mysterious air?<br/>That's like saying &quot;coco the monkey.. Wow, he's representing satan, because of his 'mysterious air'&quot; when talking about coco-pops advertising.<br/><br/><blockquote><p>the higher order of the McDonaldland inhabitants</p></blockquote>There are more?<br/><br/>I'd be suprised if any publisher offered to take your book.",
      "PostDate": "2006-10-01T20:25:40+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11153",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "I feel it's high time I chimed in with a few of my fave quotes from &quot;Vaughan's Insanest Rambles&quot;*:\n\nVaughan:\n[quote:1ajm96vo]Davidw has warned us that faster than you can say &quot;hyperconscientiousness&quot;, footling sods will spoil the whole Zen Buddhist New Age mystical rock-worshipping aura of our body chakras.[/quote:1ajm96vo]\n\nVaughan:\n[quote:1ajm96vo]I use this delightfully pejorative term, &quot;bunk&quot; -- an alternative from the same page of my criminal-slang lexicon would serve just as well[/quote:1ajm96vo]\n\nVaughan:\n[quote:1ajm96vo]Justice isn't served when Davidw's crimes go unpunished. That, in itself, will condemn us to live with pernicious palookas sometime soon.[/quote:1ajm96vo]\n\nVaughan:\n[quote:1ajm96vo]We have an obligation to do something good for others. We have an obligation to take the initiative to instill a sense of responsibility and maturity in those who capitalize on our needs and vulnerabilities. And we have an obligation to get us out of the hammerlock that he is holding us in. [/quote:1ajm96vo]\n\n* Not to be confused with &quot;Vaughan's Insan[i:1ajm96vo]er[/i:1ajm96vo] Rambles&quot; which I felt lacked his usual level of dementia.",
      "EditableFormat": "bbcode",
      "HTML": "I feel it's high time I chimed in with a few of my fave quotes from &quot;Vaughan's Insanest Rambles&quot;*:<br/><br/>Vaughan:<br/><blockquote><p>Davidw has warned us that faster than you can say &quot;hyperconscientiousness&quot;, footling sods will spoil the whole Zen Buddhist New Age mystical rock-worshipping aura of our body chakras.</p></blockquote><br/><br/>Vaughan:<br/><blockquote><p>I use this delightfully pejorative term, &quot;bunk&quot; -- an alternative from the same page of my criminal-slang lexicon would serve just as well</p></blockquote><br/><br/>Vaughan:<br/><blockquote><p>Justice isn't served when Davidw's crimes go unpunished. That, in itself, will condemn us to live with pernicious palookas sometime soon.</p></blockquote><br/><br/>Vaughan:<br/><blockquote><p>We have an obligation to do something good for others. We have an obligation to take the initiative to instill a sense of responsibility and maturity in those who capitalize on our needs and vulnerabilities. And we have an obligation to get us out of the hammerlock that he is holding us in. </p></blockquote><br/><br/>* Not to be confused with &quot;Vaughan's Insan<span style=\"font-style:italic;\">er</span> Rambles&quot; which I felt lacked his usual level of dementia.",
      "PostDate": "2006-10-01T20:34:31+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11156",
      "UserId": 0,
      "Username": "GameBoy",
      "UserAvatar": null,
      "UserGravatar": "554e89a053350b96f686f324a6049e9d",
      "EditableText": "I picture this guy as the stereotypical hillbilly preacher.",
      "EditableFormat": "bbcode",
      "HTML": "I picture this guy as the stereotypical hillbilly preacher.",
      "PostDate": "2006-10-02T11:08:38+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11158",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "That's derogatory towards hillbilly preachers. Most of them make more sense than Vaughan.",
      "EditableFormat": "bbcode",
      "HTML": "That's derogatory towards hillbilly preachers. Most of them make more sense than Vaughan.",
      "PostDate": "2006-10-02T11:35:25+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11162",
      "UserId": 0,
      "Username": "GameBoy",
      "UserAvatar": null,
      "UserGravatar": "554e89a053350b96f686f324a6049e9d",
      "EditableText": "The person above me makes helmets out of cheese",
      "EditableFormat": "bbcode",
      "HTML": "The person above me makes helmets out of cheese",
      "PostDate": "2006-10-03T00:02:31+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11166",
      "UserId": 0,
      "Username": "witch wyzwurd",
      "UserAvatar": null,
      "UserGravatar": "05e3fb359c040589d773db02decd0770",
      "EditableText": "O_Vaughan, I liked your excerpt, or what I've read of it so far.  I find a bit of humor with it.  It has an aire of social sarcasm, but a serious angle if one is inclined to lend credence to such a perspective.  Here, I'll lend you an anagrammatical translation that you may add into your data and consider for publication.  \n\nRONALD MCDONALD: ODD MAN: CLAN LORD (as JC)\nor... DO DAMN CLAN LORD!\n\nMAYOR MCCHEESE: MY MECCA, HEROES (as G-D)\n\nRM: The odd looking man is the clan lord, so do damn clan lord!\nMM: My mecca and my heroes.\n\nYou might find the science contolling the construction of destiny interesting... my website (being updated shortly):\n<!-- w --><a class=\"postlink\" href=\"http://www.globallablog.com/legi_cab2001.html\">http://www.globallablog.com/legi_cab2001.html</a><!-- w --> (immediate data)\n<!-- w --><a class=\"postlink\" href=\"http://www.globallablog.com\">http://www.globallablog.com</a><!-- w --> (homepage; follow instructions)\n\nand concerning religion:\nBIBLE: BE LIB (part of a coming section on my site)\n\n-Witch",
      "EditableFormat": "bbcode",
      "HTML": "O_Vaughan, I liked your excerpt, or what I've read of it so far.  I find a bit of humor with it.  It has an aire of social sarcasm, but a serious angle if one is inclined to lend credence to such a perspective.  Here, I'll lend you an anagrammatical translation that you may add into your data and consider for publication.  <br/><br/>RONALD MCDONALD: ODD MAN: CLAN LORD (as JC)<br/>or... DO DAMN CLAN LORD!<br/><br/>MAYOR MCCHEESE: MY MECCA, HEROES (as G-D)<br/><br/>RM: The odd looking man is the clan lord, so do damn clan lord!<br/>MM: My mecca and my heroes.<br/><br/>You might find the science contolling the construction of destiny interesting... my website (being updated shortly):<br/><!-- w --><a class=\"postlink\" href=\"http://www.globallablog.com/legi_cab2001.html\">http://www.globallablog.com/legi_cab2001.html</a><!-- w --> (immediate data)<br/><!-- w --><a class=\"postlink\" href=\"http://www.globallablog.com\">http://www.globallablog.com</a><!-- w --> (homepage; follow instructions)<br/><br/>and concerning religion:<br/>BIBLE: BE LIB (part of a coming section on my site)<br/><br/>-Witch",
      "PostDate": "2006-10-03T05:21:22+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11171",
      "UserId": 0,
      "Username": "Elexxorine",
      "UserAvatar": null,
      "UserGravatar": "a220ee44d8fe2f07029cf1f61b98bf40",
      "EditableText": "Zelimos said: Money is the root off all evil. FALSE! [i:g3ukuepl]Love[/i:g3ukuepl] of money is the root of all evil, money itself can be used for good, but greed is the biggest curuption in this world, stemming for our materilistic lives, where from birth we are taught the meaning of life to get good grades, get a good job, and earn lots of money to spend on things they don't need.",
      "EditableFormat": "bbcode",
      "HTML": "Zelimos said: Money is the root off all evil. FALSE! <span style=\"font-style:italic;\">Love</span> of money is the root of all evil, money itself can be used for good, but greed is the biggest curuption in this world, stemming for our materilistic lives, where from birth we are taught the meaning of life to get good grades, get a good job, and earn lots of money to spend on things they don't need.",
      "PostDate": "2006-10-03T11:43:08+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11177",
      "UserId": 0,
      "Username": "Sycophant",
      "UserAvatar": null,
      "UserGravatar": "a4c70de07ac0413534899d50b62c79ef",
      "EditableText": "Interesting read O_VAUGHAN,\nI noticed that davidw still dishing out insults. The hate continues.",
      "EditableFormat": "bbcode",
      "HTML": "Interesting read O_VAUGHAN,<br/>I noticed that davidw still dishing out insults. The hate continues.",
      "PostDate": "2006-10-03T18:04:24+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11180",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "So where was your IFComp game then, Unknown? Chickened out, did you? Gee. I bet no one saw [i:3ewc7892]that[/i:3ewc7892] coming.",
      "EditableFormat": "bbcode",
      "HTML": "So where was your IFComp game then, Unknown? Chickened out, did you? Gee. I bet no one saw <span style=\"font-style:italic;\">that</span> coming.",
      "PostDate": "2006-10-03T18:52:44+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11207",
      "UserId": 0,
      "Username": "O_VAUGHAN",
      "UserAvatar": null,
      "UserGravatar": "7796ca0ef862f47da53ff41e1db62c5d",
      "EditableText": "[quote=&quot;witch wyzwurd&quot;:1w0ks18f]O_Vaughan, I liked your excerpt, or what I've read of it so far.  I find a bit of humor with it.  It has an aire of social sarcasm, but a serious angle if one is inclined to lend credence to such a perspective.  Here, I'll lend you an anagrammatical translation that you may add into your data and consider for publication.  \n\nRONALD MCDONALD: ODD MAN: CLAN LORD (as JC)\nor... DO DAMN CLAN LORD!\n\nMAYOR MCCHEESE: MY MECCA, HEROES (as G-D)\n\nRM: The odd looking man is the clan lord, so do damn clan lord!\nMM: My mecca and my heroes.\n\nYou might find the science contolling the construction of destiny interesting... my website (being updated shortly):\n<!-- w --><a class=\"postlink\" href=\"http://www.globallablog.com/legi_cab2001.html\">http://www.globallablog.com/legi_cab2001.html</a><!-- w --> (immediate data)\n<!-- w --><a class=\"postlink\" href=\"http://www.globallablog.com\">http://www.globallablog.com</a><!-- w --> (homepage; follow instructions)\n\nand concerning religion:\nBIBLE: BE LIB (part of a coming section on my site)\n\n-Witch[/quote:1w0ks18f]\n\nThank you Witch.  You see it exactly as it meant to be seen.  I'm glad that you enjoyed it as well, Sycophant.  I have to say, Tron, that I did not expect an all-out attack at that level from you but as it has already done, then so be it.  I see that I now have another rabid stalker frothing at the mouth in this &quot;gameboy&quot; character.  You, Gameboy are obviously one of Davidw's minions.  As much as I feel that Davidw is my arch enemy around here I will give credit where credit is due.  He is held in very high regard on some other sites and he's earned his creds.  You, however, are so far as I can see no more than a sniveling sock puppet.  What the hell did I ever do to you?  Davidw, please try and restrain your pet.\n\nOh, and Davidw, I saw where you quoted me on your other site.  While I am not a member there I can rest assured that there are many there who agree with me.  your quoting me has only helped to spread my message.  \n\n_____________________________________\n\n\nTron,\n\nI do not have proof that Mcdonalds mocks Christianity.  It is a theory that you can at least consider.  I don't need to cite examples of specific ads because I an aware of the intended purpose of each character.  If you are unaware of them then this exerpt alone might get you lost.  I assumed that all of you were well-aware of these characters.  The book will be published in America BTW.  That's what I understand so far anyway.\n\nThe Illuminati are the people who are actually in control of the world.  It is what has happened to the &quot;Royal&quot; classes in actuality.  You just don't hear about them publically.  FYI, this new &quot;king&quot; character for the Burger King Company (Which is part of Pepsico) is particularly disturbing for that reason but the part about that is discussed later in the book.\n\nI am not scared of clowns.  Clowns are entertainers today but they actually represent ghouls.  That's why they are always white.  It goes way back in history.  I thought everyone knew that.\n\nMayor McCheese is the father because as Mayor, he is technically the head of state of McDonaldland.  If you were to claim that Big Mac were the God figure Then you would be implying that McDonaldland was a place of corruption.  In a healthy state, you can't have the head of state reporting to a policeman or a police force.  I don't think that the demigogues at the head of McDonalds Corporation wanted to get the subliminal message out there that there was some kind of Praetorian Gaurd at the helm.  \n\nI like to think of Ronald McDonald as having an air of mystery.  He's a pied piper of sorts surrounded by an unlikely crew who he has in tow.  They all have their roles to play in McDonaldland.  As I said it's a microcosm of our own world.  On some level we all get this and therefore consume their food on a mass scale.  Can't you see how this relates to Globalization?  True, I haven't shared more of my book than this here and it's yet to be finished.  \n\nThere is interest in the book by a few publishers, BTW, Tron.  Granted it's not been picked up but there is interest.  You shouldn't be so smug.  I'm beginning to think you've been over at &quot;The Smug Academy&quot; taking classes from the great Davidw.",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><cite>witch wyzwurd wrote:</cite>O_Vaughan, I liked your excerpt, or what I've read of it so far.  I find a bit of humor with it.  It has an aire of social sarcasm, but a serious angle if one is inclined to lend credence to such a perspective.  Here, I'll lend you an anagrammatical translation that you may add into your data and consider for publication.  <br/><br/>RONALD MCDONALD: ODD MAN: CLAN LORD (as JC)<br/>or... DO DAMN CLAN LORD!<br/><br/>MAYOR MCCHEESE: MY MECCA, HEROES (as G-D)<br/><br/>RM: The odd looking man is the clan lord, so do damn clan lord!<br/>MM: My mecca and my heroes.<br/><br/>You might find the science contolling the construction of destiny interesting... my website (being updated shortly):<br/><!-- w --><a class=\"postlink\" href=\"http://www.globallablog.com/legi_cab2001.html\">http://www.globallablog.com/legi_cab2001.html</a><!-- w --> (immediate data)<br/><!-- w --><a class=\"postlink\" href=\"http://www.globallablog.com\">http://www.globallablog.com</a><!-- w --> (homepage; follow instructions)<br/><br/>and concerning religion:<br/>BIBLE: BE LIB (part of a coming section on my site)<br/><br/>-Witch</blockquote><br/><br/>Thank you Witch.  You see it exactly as it meant to be seen.  I'm glad that you enjoyed it as well, Sycophant.  I have to say, Tron, that I did not expect an all-out attack at that level from you but as it has already done, then so be it.  I see that I now have another rabid stalker frothing at the mouth in this &quot;gameboy&quot; character.  You, Gameboy are obviously one of Davidw's minions.  As much as I feel that Davidw is my arch enemy around here I will give credit where credit is due.  He is held in very high regard on some other sites and he's earned his creds.  You, however, are so far as I can see no more than a sniveling sock puppet.  What the hell did I ever do to you?  Davidw, please try and restrain your pet.<br/><br/>Oh, and Davidw, I saw where you quoted me on your other site.  While I am not a member there I can rest assured that there are many there who agree with me.  your quoting me has only helped to spread my message.  <br/><br/>_____________________________________<br/><br/><br/>Tron,<br/><br/>I do not have proof that Mcdonalds mocks Christianity.  It is a theory that you can at least consider.  I don't need to cite examples of specific ads because I an aware of the intended purpose of each character.  If you are unaware of them then this exerpt alone might get you lost.  I assumed that all of you were well-aware of these characters.  The book will be published in America BTW.  That's what I understand so far anyway.<br/><br/>The Illuminati are the people who are actually in control of the world.  It is what has happened to the &quot;Royal&quot; classes in actuality.  You just don't hear about them publically.  FYI, this new &quot;king&quot; character for the Burger King Company (Which is part of Pepsico) is particularly disturbing for that reason but the part about that is discussed later in the book.<br/><br/>I am not scared of clowns.  Clowns are entertainers today but they actually represent ghouls.  That's why they are always white.  It goes way back in history.  I thought everyone knew that.<br/><br/>Mayor McCheese is the father because as Mayor, he is technically the head of state of McDonaldland.  If you were to claim that Big Mac were the God figure Then you would be implying that McDonaldland was a place of corruption.  In a healthy state, you can't have the head of state reporting to a policeman or a police force.  I don't think that the demigogues at the head of McDonalds Corporation wanted to get the subliminal message out there that there was some kind of Praetorian Gaurd at the helm.  <br/><br/>I like to think of Ronald McDonald as having an air of mystery.  He's a pied piper of sorts surrounded by an unlikely crew who he has in tow.  They all have their roles to play in McDonaldland.  As I said it's a microcosm of our own world.  On some level we all get this and therefore consume their food on a mass scale.  Can't you see how this relates to Globalization?  True, I haven't shared more of my book than this here and it's yet to be finished.  <br/><br/>There is interest in the book by a few publishers, BTW, Tron.  Granted it's not been picked up but there is interest.  You shouldn't be so smug.  I'm beginning to think you've been over at &quot;The Smug Academy&quot; taking classes from the great Davidw.",
      "PostDate": "2006-10-06T21:31:05+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11208",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "Interesting. It's quite amusing, Vaughan, the way you're impressed both Sycophant and Witch Wyzurd agree with you. They're the two forum members most like you, i.e. stark raving mad. Reminds me of my school days when all the weirdos in my class would stick together, despite the fact that they probably secretly hated each other.\n\n[quote:1hygcue6]Oh, and Davidw, I saw where you quoted me on your other site. While I am not a member there I can rest assured that there are many there who agree with me. your quoting me has only helped to spread my message. [/quote:1hygcue6]\n\nAlways happy to spread the message that you're bonkers, Vaughan. Not, I should add, that it really needs my help in spreading. You do an excellent job of convincing everyone you meet that you're a bit barmy.",
      "EditableFormat": "bbcode",
      "HTML": "Interesting. It's quite amusing, Vaughan, the way you're impressed both Sycophant and Witch Wyzurd agree with you. They're the two forum members most like you, i.e. stark raving mad. Reminds me of my school days when all the weirdos in my class would stick together, despite the fact that they probably secretly hated each other.<br/><br/><blockquote><p>Oh, and Davidw, I saw where you quoted me on your other site. While I am not a member there I can rest assured that there are many there who agree with me. your quoting me has only helped to spread my message. </p></blockquote><br/><br/>Always happy to spread the message that you're bonkers, Vaughan. Not, I should add, that it really needs my help in spreading. You do an excellent job of convincing everyone you meet that you're a bit barmy.",
      "PostDate": "2006-10-06T21:48:42+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11211",
      "UserId": 0,
      "Username": "GameBoy",
      "UserAvatar": null,
      "UserGravatar": "554e89a053350b96f686f324a6049e9d",
      "EditableText": "I simply stated my view on your post, if you can't handle it, don't post.  I disagree with the &quot;bashing&quot; of fast-food chains. Mocking christianity... please, you described a hierarchy which is similar to most real-life organisations.\n\nI'm DavidW's minion... yeah, all our previous &quot;discussions&quot; prove that to be true.  I'm nobody's minion, scumbag.  And if you're thinking about whining like a little bitch about this post, &quot;attacking&quot; you, then perhaps you should have thought about what you wrote in your other posts first.\n\nDon't bring this down to a personal level just because I disagree with your views, if you do, then prepare for some good old fashion flaming.  Asshole.",
      "EditableFormat": "bbcode",
      "HTML": "I simply stated my view on your post, if you can't handle it, don't post.  I disagree with the &quot;bashing&quot; of fast-food chains. Mocking christianity... please, you described a hierarchy which is similar to most real-life organisations.<br/><br/>I'm DavidW's minion... yeah, all our previous &quot;discussions&quot; prove that to be true.  I'm nobody's minion, scumbag.  And if you're thinking about whining like a little bitch about this post, &quot;attacking&quot; you, then perhaps you should have thought about what you wrote in your other posts first.<br/><br/>Don't bring this down to a personal level just because I disagree with your views, if you do, then prepare for some good old fashion flaming.  Asshole.",
      "PostDate": "2006-10-07T06:04:31+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11217",
      "UserId": 0,
      "Username": "paul_one",
      "UserAvatar": null,
      "UserGravatar": "fef8a1875028f4300bb683f29c432894",
      "EditableText": "[quote:2i3nnk2z]It is a theory that you can at least consider.[/quote:2i3nnk2z]\nA 'theory', without a substantial amount of backing - is not a theory. It's conjecture. A personal opinion or an idea.\n\nYou have merely said &quot;how fun would it be if these guys could fit in with my idea&quot;.. And then go about giving them extra things to fit in (mystery indeed)..\n\n[quote:2i3nnk2z]you described a hierarchy which is similar to most real-life organisations.[/quote:2i3nnk2z]\nI back that statement.\n\n[quote:2i3nnk2z]The book will be published in America BTW.[/quote:2i3nnk2z][quote:2i3nnk2z]Granted it's not been picked up but there is interest.[/quote:2i3nnk2z]\nSo it is - but it isn't?\nI'm sure there is interest.. But I shouldn't think it would be published.\n... Then again, we have books from celebrities simply because they are celebs.. *shudders*\n\n[quote:2i3nnk2z]You shouldn't be so smug.[/quote:2i3nnk2z]\nI thought being smug was more of a &quot;I'm great - you're not&quot; thing. Where have I said that?\nMy remark on it not being picked up by a publisher is both because of writing style and simply the fact that you get nowhere.\nYou point out parts that you make up, and don't even relate them into your 'theory'.\n\n[quote:2i3nnk2z]Clowns are entertainers today but they actually represent ghouls.[/quote:2i3nnk2z]\nWhere did you imagine that rubbish up?\nClowns evolved from jesters and fools.. They've been traced back to Egypt as one of the first cards (if not the first card) from a Tarot deck.\nClowns don't HAVE to wear white make-up, but they are usually the highest form of clown.\nGo read up, and if necissary post links.\n[http://en.wikipedia.org/wiki/Clown]\n\n[quote:2i3nnk2z]On some level we all get this and therefore consume their food[/quote:2i3nnk2z]\nSo you eat food based on the advertising?\nYEESH, and here was I basing what I put in my mouth, with something as silly as taste, smell, look and overall experience of cooking and eating a meal... How stupid of me!\n\n[quote:2i3nnk2z]Can't you see how this relates to Globalization?[/quote:2i3nnk2z]\nDo you actually know what you mean when you say this?\nNowhere in your above excerpt have you mentioned anything of the sort - and I doubt you will in your book - seeing as it's about mcdonalds advertising and it's relation to Christianity..\nUnless you're going to go into the history of Christianity, and McDonalds, and a few countries to see the effect that these two have had on the countries as they progressed.. And hell, you should throw in some other companies for comparison then, and religeon's - as it's unfair to really compare one company and one religeon (although that's not really any more fair).\n\nYou can continue trying to relate my actions to Davidw if you want.. Won't get you anywhere.",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><p>It is a theory that you can at least consider.</p></blockquote><br/>A 'theory', without a substantial amount of backing - is not a theory. It's conjecture. A personal opinion or an idea.<br/><br/>You have merely said &quot;how fun would it be if these guys could fit in with my idea&quot;.. And then go about giving them extra things to fit in (mystery indeed)..<br/><br/><blockquote><p>you described a hierarchy which is similar to most real-life organisations.</p></blockquote><br/>I back that statement.<br/><br/><blockquote><p>The book will be published in America BTW.</p></blockquote><blockquote><p>Granted it's not been picked up but there is interest.</p></blockquote><br/>So it is - but it isn't?<br/>I'm sure there is interest.. But I shouldn't think it would be published.<br/>... Then again, we have books from celebrities simply because they are celebs.. *shudders*<br/><br/><blockquote><p>You shouldn't be so smug.</p></blockquote><br/>I thought being smug was more of a &quot;I'm great - you're not&quot; thing. Where have I said that?<br/>My remark on it not being picked up by a publisher is both because of writing style and simply the fact that you get nowhere.<br/>You point out parts that you make up, and don't even relate them into your 'theory'.<br/><br/><blockquote><p>Clowns are entertainers today but they actually represent ghouls.</p></blockquote><br/>Where did you imagine that rubbish up?<br/>Clowns evolved from jesters and fools.. They've been traced back to Egypt as one of the first cards (if not the first card) from a Tarot deck.<br/>Clowns don't HAVE to wear white make-up, but they are usually the highest form of clown.<br/>Go read up, and if necissary post links.<br/>[http://en.wikipedia.org/wiki/Clown]<br/><br/><blockquote><p>On some level we all get this and therefore consume their food</p></blockquote><br/>So you eat food based on the advertising?<br/>YEESH, and here was I basing what I put in my mouth, with something as silly as taste, smell, look and overall experience of cooking and eating a meal... How stupid of me!<br/><br/><blockquote><p>Can't you see how this relates to Globalization?</p></blockquote><br/>Do you actually know what you mean when you say this?<br/>Nowhere in your above excerpt have you mentioned anything of the sort - and I doubt you will in your book - seeing as it's about mcdonalds advertising and it's relation to Christianity..<br/>Unless you're going to go into the history of Christianity, and McDonalds, and a few countries to see the effect that these two have had on the countries as they progressed.. And hell, you should throw in some other companies for comparison then, and religeon's - as it's unfair to really compare one company and one religeon (although that's not really any more fair).<br/><br/>You can continue trying to relate my actions to Davidw if you want.. Won't get you anywhere.",
      "PostDate": "2006-10-07T10:17:04+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11268",
      "UserId": 0,
      "Username": "witch wyzwurd",
      "UserAvatar": null,
      "UserGravatar": "05e3fb359c040589d773db02decd0770",
      "EditableText": "I'd like to propose a solution for the anger and hate spewing that devours our potentially useful discussions...\n\nFirst off, I think it's plain to see by anyone reading or writing posts here that at moments we are supportive of each other, but mostly we tear each others efforts apart.  I've dove into the fire to react to its heat, to understand its brame.  I've stood at the edge of the precipice that overlooks the fire, disgusted and ashamed.  I even have built bridges to lead us away from the fire, to bring us into a land of tranquility.  I've watched our population grow and diminish, but mostly diminish.  Why: Why does the tips of the flames burn us?  Why do we slice our words with alphabetical swords and cunning thoughts?\n\nWhy has the group expelled itself from a fruitful core?... To spread its seeds upon fertile ground? To influence the growth of and welcome in new spirits? Or to lay ourselves on the ground and be drenched by acid that is sure to corrode our meaning, to rot that which we desire to spread.\n\nO Vaughan, lo McD!\nGameBoy has his M:RPGe!\nTrOn, with your power to square-up ASL code!\nWW, hacking what destiny sewed!\nSycophant holding baby to its babble!\n- DavidW; contributes nothing but wild squabble!\n\nA forum of intellect in suicidal plot.\nTo destroy the intention of progression.\nSubtract your opinion and notice what to believe.\nEven if what you observe you can't one-hundred percent believe.\n\nMaybe Old Ron is just a simple clown.\nNo ghoul, no ghost, just a painted face in hamburger town.\nThe globalists: bankers? aliens? corporate moguls? Barney? Sponge Bob?\nDoesn't matter; O Vaughan is an inventive brother we must not snob.\n\nTo disagree is not to maim the reputation of Man.\nGameBoy, has your insults furthered your hard-worked plans?\nAnd DW, I would be glad to play your games.\nBut your condescending insights invoke them to flames.\n\nP.s. O Vaughan, are you a Coast to Coast AM listener? Art Bell? George Noory?",
      "EditableFormat": "bbcode",
      "HTML": "I'd like to propose a solution for the anger and hate spewing that devours our potentially useful discussions...<br/><br/>First off, I think it's plain to see by anyone reading or writing posts here that at moments we are supportive of each other, but mostly we tear each others efforts apart.  I've dove into the fire to react to its heat, to understand its brame.  I've stood at the edge of the precipice that overlooks the fire, disgusted and ashamed.  I even have built bridges to lead us away from the fire, to bring us into a land of tranquility.  I've watched our population grow and diminish, but mostly diminish.  Why: Why does the tips of the flames burn us?  Why do we slice our words with alphabetical swords and cunning thoughts?<br/><br/>Why has the group expelled itself from a fruitful core?... To spread its seeds upon fertile ground? To influence the growth of and welcome in new spirits? Or to lay ourselves on the ground and be drenched by acid that is sure to corrode our meaning, to rot that which we desire to spread.<br/><br/>O Vaughan, lo McD!<br/>GameBoy has his M:RPGe!<br/>TrOn, with your power to square-up ASL code!<br/>WW, hacking what destiny sewed!<br/>Sycophant holding baby to its babble!<br/>- DavidW; contributes nothing but wild squabble!<br/><br/>A forum of intellect in suicidal plot.<br/>To destroy the intention of progression.<br/>Subtract your opinion and notice what to believe.<br/>Even if what you observe you can't one-hundred percent believe.<br/><br/>Maybe Old Ron is just a simple clown.<br/>No ghoul, no ghost, just a painted face in hamburger town.<br/>The globalists: bankers? aliens? corporate moguls? Barney? Sponge Bob?<br/>Doesn't matter; O Vaughan is an inventive brother we must not snob.<br/><br/>To disagree is not to maim the reputation of Man.<br/>GameBoy, has your insults furthered your hard-worked plans?<br/>And DW, I would be glad to play your games.<br/>But your condescending insights invoke them to flames.<br/><br/>P.s. O Vaughan, are you a Coast to Coast AM listener? Art Bell? George Noory?",
      "PostDate": "2006-10-10T20:11:14+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11269",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "[quote=&quot;witch wyzwurd&quot;:16rmolc7]\nWhy has the group expelled itself from a fruitful core?... To spread its seeds upon fertile ground? To influence the growth of and welcome in new spirits? Or to lay ourselves on the ground and be drenched by acid that is sure to corrode our meaning, to rot that which we desire to spread.[/quote:16rmolc7]\n\nDamn, but I like you. Other people I have to really try to make them look stupid, but you hand it to me on a platter again and again.",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><cite>witch wyzwurd wrote:</cite><br/>Why has the group expelled itself from a fruitful core?... To spread its seeds upon fertile ground? To influence the growth of and welcome in new spirits? Or to lay ourselves on the ground and be drenched by acid that is sure to corrode our meaning, to rot that which we desire to spread.</blockquote><br/><br/>Damn, but I like you. Other people I have to really try to make them look stupid, but you hand it to me on a platter again and again.",
      "PostDate": "2006-10-10T20:30:35+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11272",
      "UserId": 0,
      "Username": "steve the gaming guy",
      "UserAvatar": null,
      "UserGravatar": "6577a0affcb6ea711c75baf052ffd08a",
      "EditableText": "[quote=&quot;GameBoy&quot;:d3ccfems]Just because you don't think McDonalds taste nice, doesn't mean it's the root of all evil.  Money is the root of all evil.\n[/quote:d3ccfems]\n\nJust wanted to point out that it's &quot;The [u:d3ccfems]love [/u:d3ccfems]of money is the root of all evil&quot;.\n\nNow carry on.   <!-- s:) --><img src=\"{SMILIES_PATH}/icon_e_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) -->",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><cite>GameBoy wrote:</cite>Just because you don't think McDonalds taste nice, doesn't mean it's the root of all evil.  Money is the root of all evil.<br/></blockquote><br/><br/>Just wanted to point out that it's &quot;The <span style=\"text-decoration:underline;\">love </span>of money is the root of all evil&quot;.<br/><br/>Now carry on.   <!-- s:) --><img src=\"{SMILIES_PATH}/icon_e_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) -->",
      "PostDate": "2006-10-11T22:00:48+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11274",
      "UserId": 0,
      "Username": "GameBoy",
      "UserAvatar": null,
      "UserGravatar": "554e89a053350b96f686f324a6049e9d",
      "EditableText": "[quote=&quot;steve the gaming guy&quot;:2ndoxddk][quote=&quot;GameBoy&quot;:2ndoxddk]Just because you don't think McDonalds taste nice, doesn't mean it's the root of all evil.  Money is the root of all evil.\n[/quote:2ndoxddk]\n\nJust wanted to point out that it's &quot;The [u:2ndoxddk]love [/u:2ndoxddk]of money is the root of all evil&quot;.\n\nNow carry on.   <!-- s:) --><img src=\"{SMILIES_PATH}/icon_e_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) -->[/quote:2ndoxddk]\n\nIf I had to be specific.",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><cite>steve the gaming guy wrote:</cite><blockquote><p><b>&quot;GameBoy&quot;</b></p><p>Just because you don't think McDonalds taste nice, doesn't mean it's the root of all evil.  Money is the root of all evil.<br/></blockquote><br/><br/>Just wanted to point out that it's &quot;The <span style=\"text-decoration:underline;\">love </span>of money is the root of all evil&quot;.<br/><br/>Now carry on.   <!-- s:) --><img src=\"{SMILIES_PATH}/icon_e_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) --></p></blockquote><br/><br/>If I had to be specific.",
      "PostDate": "2006-10-11T22:22:27+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11278",
      "UserId": 0,
      "Username": "Elexxorine",
      "UserAvatar": null,
      "UserGravatar": "a220ee44d8fe2f07029cf1f61b98bf40",
      "EditableText": "I [i:w00l4zdh]did[/i:w00l4zdh] actually point that out a while back but no-one took any notice...",
      "EditableFormat": "bbcode",
      "HTML": "I <span style=\"font-style:italic;\">did</span> actually point that out a while back but no-one took any notice...",
      "PostDate": "2006-10-12T14:41:31+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11279",
      "UserId": 0,
      "Username": "steve the gaming guy",
      "UserAvatar": null,
      "UserGravatar": "6577a0affcb6ea711c75baf052ffd08a",
      "EditableText": "oops, you sure did.  Credit goes to you for pointing that out first.  lol",
      "EditableFormat": "bbcode",
      "HTML": "oops, you sure did.  Credit goes to you for pointing that out first.  lol",
      "PostDate": "2006-10-12T16:12:29+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11280",
      "UserId": 0,
      "Username": "Elexxorine",
      "UserAvatar": null,
      "UserGravatar": "a220ee44d8fe2f07029cf1f61b98bf40",
      "EditableText": "Thank you. Glad to see some-one here cares about me... *sniff*",
      "EditableFormat": "bbcode",
      "HTML": "Thank you. Glad to see some-one here cares about me... *sniff*",
      "PostDate": "2006-10-12T16:58:35+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11281",
      "UserId": 0,
      "Username": "GameBoy",
      "UserAvatar": null,
      "UserGravatar": "554e89a053350b96f686f324a6049e9d",
      "EditableText": "I still stand correct, to a certain extent.  If money didn't exist, and coco beans were a currency (And a long time ago, they pretty much were!), Coco beans would be the root of all evil.  It's the value and purpose of money which [i:cidk3jmp]causes[/i:cidk3jmp] people to fall in love with it.  Money is a succubus, it's advantages draw people into it.  Money is evil...",
      "EditableFormat": "bbcode",
      "HTML": "I still stand correct, to a certain extent.  If money didn't exist, and coco beans were a currency (And a long time ago, they pretty much were!), Coco beans would be the root of all evil.  It's the value and purpose of money which <span style=\"font-style:italic;\">causes</span> people to fall in love with it.  Money is a succubus, it's advantages draw people into it.  Money is evil...",
      "PostDate": "2006-10-13T04:40:08+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11286",
      "UserId": 0,
      "Username": "Elexxorine",
      "UserAvatar": null,
      "UserGravatar": "a220ee44d8fe2f07029cf1f61b98bf40",
      "EditableText": "Money is an inanimate object and is not [i:2ho88fp0]capable[/i:2ho88fp0] of being evil, it is the materialist world that we live in that leads us to believe money is evil, when in fact it is ouselves and us blaming whatever else we can instead of ourselves for the faults we have created.",
      "EditableFormat": "bbcode",
      "HTML": "Money is an inanimate object and is not <span style=\"font-style:italic;\">capable</span> of being evil, it is the materialist world that we live in that leads us to believe money is evil, when in fact it is ouselves and us blaming whatever else we can instead of ourselves for the faults we have created.",
      "PostDate": "2006-10-13T09:07:31+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11290",
      "UserId": 0,
      "Username": "GameBoy",
      "UserAvatar": null,
      "UserGravatar": "554e89a053350b96f686f324a6049e9d",
      "EditableText": "[quote=&quot;elexxorine&quot;:t9akch25]Money is an inanimate object and is not [i:t9akch25]capable[/i:t9akch25] of being evil, it is the materialist world that we live in that leads us to believe money is evil, when in fact it is ouselves and us blaming whatever else we can instead of ourselves for the faults we have created.[/quote:t9akch25]\n\nSo you're saying that [b:t9akch25]WE[/b:t9akch25] are the root of all evil as it's ourselves that are convincing ourselves that money will give us power?",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><cite>elexxorine wrote:</cite>Money is an inanimate object and is not <span style=\"font-style:italic;\">capable</span> of being evil, it is the materialist world that we live in that leads us to believe money is evil, when in fact it is ouselves and us blaming whatever else we can instead of ourselves for the faults we have created.</blockquote><br/><br/>So you're saying that <span style=\"font-weight:bold;\">WE</span> are the root of all evil as it's ourselves that are convincing ourselves that money will give us power?",
      "PostDate": "2006-10-13T18:31:56+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11298",
      "UserId": 0,
      "Username": "paul_one",
      "UserAvatar": null,
      "UserGravatar": "fef8a1875028f4300bb683f29c432894",
      "EditableText": "[quote:28arpl0h]convincing ourselves that money will give us power?[/quote:28arpl0h].. I don't think we need convincing.\nMoney DOES give you power...\n\nIt gives you the power over your own life, and others, and also hiring muscle which is a different sort of power.\n\n... Although, personally I'd do without it.",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><p>convincing ourselves that money will give us power?</p></blockquote>.. I don't think we need convincing.<br/>Money DOES give you power...<br/><br/>It gives you the power over your own life, and others, and also hiring muscle which is a different sort of power.<br/><br/>... Although, personally I'd do without it.",
      "PostDate": "2006-10-13T21:55:43+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11299",
      "UserId": 0,
      "Username": "Elexxorine",
      "UserAvatar": null,
      "UserGravatar": "a220ee44d8fe2f07029cf1f61b98bf40",
      "EditableText": "That is the world we live in...",
      "EditableFormat": "bbcode",
      "HTML": "That is the world we live in...",
      "PostDate": "2006-10-13T22:39:59+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11302",
      "UserId": 0,
      "Username": "witch wyzwurd",
      "UserAvatar": null,
      "UserGravatar": "05e3fb359c040589d773db02decd0770",
      "EditableText": "O GOD, GO DO GOOD!  DO GO LIVE LIVE!  VEIL VILE EVIL!\n\nFirst &quot;live&quot; w/ short &quot;i&quot;\nSecond &quot;live&quot; w/ long &quot;i&quot;\n\n\nBIBLE BE LIB\n\nBB LIE: {A=1, B=2}: 22 LIE: {20=T, 21=U, 22=V}: V LIE: EVIL\n\n22 LIE: CATCH 22 (D.ILE.MMA; a type of falsehood for the experiencer):...\n\nCATCH: CC HAT (a veil): {A=1, B=2, C=3}: 33 HAT:{26=Z, 27=A, 28=B,... 33=G}: G HAT: GATH (Biblical town where David defeated Goliath): G.OLI.ATH: GATH OIL (oil as corporate giant): LO GATH I (Look and see I in Gath; my name is David)\n\nNAME MEAN AMEN\nNow how about that burning bush? Or Sodom?\n\n\nLord Word's World Spell:\nBe log... Globe: Whirled world. Planet: Plan it....\n\n\n-Witch",
      "EditableFormat": "bbcode",
      "HTML": "O GOD, GO DO GOOD!  DO GO LIVE LIVE!  VEIL VILE EVIL!<br/><br/>First &quot;live&quot; w/ short &quot;i&quot;<br/>Second &quot;live&quot; w/ long &quot;i&quot;<br/><br/><br/>BIBLE BE LIB<br/><br/>BB LIE: {A=1, B=2}: 22 LIE: {20=T, 21=U, 22=V}: V LIE: EVIL<br/><br/>22 LIE: CATCH 22 (D.ILE.MMA; a type of falsehood for the experiencer):...<br/><br/>CATCH: CC HAT (a veil): {A=1, B=2, C=3}: 33 HAT:{26=Z, 27=A, 28=B,... 33=G}: G HAT: GATH (Biblical town where David defeated Goliath): G.OLI.ATH: GATH OIL (oil as corporate giant): LO GATH I (Look and see I in Gath; my name is David)<br/><br/>NAME MEAN AMEN<br/>Now how about that burning bush? Or Sodom?<br/><br/><br/>Lord Word's World Spell:<br/>Be log... Globe: Whirled world. Planet: Plan it....<br/><br/><br/>-Witch",
      "PostDate": "2006-10-14T05:33:45+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11304",
      "UserId": 0,
      "Username": "GameBoy",
      "UserAvatar": null,
      "UserGravatar": "554e89a053350b96f686f324a6049e9d",
      "EditableText": "[quote=&quot;Tr0n&quot;:2eo4e49o]... Although, personally I'd do without it.[/quote:2eo4e49o]\n\nI said this once...",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><cite>Tr0n wrote:</cite>... Although, personally I'd do without it.</blockquote><br/><br/>I said this once...",
      "PostDate": "2006-10-14T06:06:47+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "11368",
      "UserId": 0,
      "Username": "darkgoddessnight",
      "UserAvatar": null,
      "UserGravatar": "f57470a3bc351d13c31f470219bbcaf8",
      "EditableText": "Having just read over this topic, I would just like to point out that anyone wishing to get rid of the root of all evil (their money!) can send it to me as I have to qualms about the root of all evil. <!-- s:D --><img src=\"{SMILIES_PATH}/icon_e_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D -->.  I will take it all gladly off your hands.\n\nShadow*",
      "EditableFormat": "bbcode",
      "HTML": "Having just read over this topic, I would just like to point out that anyone wishing to get rid of the root of all evil (their money!) can send it to me as I have to qualms about the root of all evil. <!-- s:D --><img src=\"{SMILIES_PATH}/icon_e_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D -->.  I will take it all gladly off your hands.<br/><br/>Shadow*",
      "PostDate": "2006-10-25T15:50:20+01:00",
      "LastEditDate": null
    }
  ]
}
