{
  "Topic": {
    "TopicId": "2824",
    "ForumId": "3",
    "Title": "Enter The Welsh Dragon",
    "LastUpdated": "2016-04-09T23:51:00+01:00",
    "ReplyCount": 5
  },
  "Posts": [
    {
      "PostId": "19566",
      "UserId": 0,
      "Username": "Xlithan",
      "UserAvatar": null,
      "UserGravatar": "4d0fe9a8dc165feee9dbd6daa504dbc1",
      "EditableText": "Good afternoon all! (Or prynhawn da! where I'm from).\n\nI'm Xlithan, I'm nearly 25 years old, and this is my story...\n\nBack in good old 1998 I acquired my first PC. This was a huge turning point in my life. Back then, most of you had only just learned how to talk, or even walk!  These were the days when having a PC was a novelty, because there was nothing on the internet that gave anybody the need to use one, unlike today where we have social networking, online banking, online booking offices and shopping.\nThe best social chat website back then was something called Teen Chat, which I started using when I was 11 years old (Even though you had to be 13). Teen Chat was later banned because people thought it was inappropriate for young people to be engaged in online socialising, talking to strangers who lied about who they were. Which is slightly ironic, considering the power and influence of todays social networking.\n\nI played many computer games at first, changed my wallpaper a few times, and downloaded a couple of screensavers on my dial-up connection. That's right kids, we used to plug a telephone cable into the back of our computers to get internet! Extremely expensive and so slow that it would take half an hour to load the Facebook page.\n\nIn 2000 I finally moved from Windows 98SE (Which was the better version of 98 of course) over to Windows 2000, which of course is based on the NT-Kernal frame. There was also Windows ME, which was similar to 2000 only it still used the MS-DOS framework, was very slow, and crashed a LOT.\nAlso at this point in 2000, my parents had given me the gift of Blueyonder Broadband, 100 times faster than dial-up, AND it meant that I could stay connected to the internet 24/7!\nAt this point, the majority of people in the UK owned a personal computer, and was connected to the internet.\n\nThis is where my online gaming experience starts.  Naturally being connected to the internet, I wanted more games to play, so I set off on my quest to download some games.\nIn 2000, computer gaming was good, graphics and technology weren't as good as they are today but you had a decent selection of games, and Diablo 2 had just been released.\n\nText-based games were still largely popular, and you could get 300 to even 1000 players on large servers at any given time. This lead me to my first serious online game, called Nightmist Online. Just saying the name right now sends me back. It was a real-time, multi-player online game, all the basics of hack n slash roleplay, based on a table top RPG game invented by one of the creators.\nThe only graphics were on the interface itself. If you had more than half a brain, you could imagine the world inside your head. Remembering directions was difficult at first but once you got into it you could sprint from town to town in a matter of seconds.\n<!-- m --><a class=\"postlink\" href=\"http://images.onlinegamesinn.com/Nightmist-Online2.jpg\">http://images.onlinegamesinn.com/Nightmist-Online2.jpg</a><!-- m -->\n\nI played this game from January 2001, for the next 10 years.\n\nThere were other similar games to Nightmist, Realms of Kaos had been around much longer, was a larger game over-all and had a much bigger player base.\nLater came Deity Online, which never took off and was abandoned, and later on Revelation, created by a former Nightmist Online player. All 3 games are still downloadable and playable today, but unfortunately, the player base just isn't there any more and that's what made the games what they were.\n\nYou can still download and play here:\n<!-- m --><a class=\"postlink\" href=\"http://www.nightmist-online.co.uk\">http://www.nightmist-online.co.uk</a><!-- m -->\n<!-- m --><a class=\"postlink\" href=\"http://realmsofkaos.net\">http://realmsofkaos.net</a><!-- m -->\n<!-- m --><a class=\"postlink\" href=\"http://www.kaldana.com\">http://www.kaldana.com</a><!-- m -->\n\nI also got into other text-based games along the way, such as Achaea and Imperian from <!-- m --><a class=\"postlink\" href=\"http://www.ironrealms.com\">http://www.ironrealms.com</a><!-- m -->\n-------------------------------------\n\nNaturally, I was inspired by the game, and how you could easily escape into another world, even it was fictional didn't matter, you could be whoever you wanted to be, and if you worked hard and gained the max level, you had respect from other players. which at 14 years old was great, and these were real people playing along side you.\n\nI decided I was going to create my own world like Nightmist, so I set out to find out how. I had no programming knowledge, no design skills, no graphics skills or anything that would help me to start this project.\n\nSo in 2002 I eventually came across some software from AxeUK (Later Axe Software, and now Text Adventures Ltd) called Quest. This software allowed me to create my own single player text-based games, using the editing software, and it had it's very own scripting language called ASL. QuestNet was also in the works, which would allow multiple players to connect to a game. FANTASTIC! And so I began to design my own online adventure game.\n<!-- m --><a class=\"postlink\" href=\"http://img.brothersoft.com/screenshots/softimage/q/quest-18410-1311820455.jpeg\">http://img.brothersoft.com/screenshots/ ... 20455.jpeg</a><!-- m -->\n<!-- m --><a class=\"postlink\" href=\"http://img.brothersoft.com/screenshots/softimage/q/quest-18410-1311820457.jpeg\">http://img.brothersoft.com/screenshots/ ... 20457.jpeg</a><!-- m -->\n\nQuest has really advanced over the years and is still a widely used software for text-based game competitions and educational uses.\n<!-- m --><a class=\"postlink\" href=\"http://www.textadventures.co.uk\">http://www.textadventures.co.uk</a><!-- m -->\n-------------------------------------\n\nThe problem with Quest, was that at the time it was fairly limited, in terms of to the extent of which I wanted to create a custom game. The online side of it hadn't really been developed enough, as far as interacting with other players went. I couldn't customise the client enough to make it how I wanted it, even if I paid the guy, it would still lack in many areas.\n\nSo, I asked the developer of Nightmist Online and Quest, what they used to make their software? They both answered, Visual Basic 6.\nBrilliant! How do I get this? Back in 2002, downloading software wasn't as easy as it is today. BitTorrent came out in 2001 but wasn't largely popular until later on. We had to make do with Peer 2 Peer software such as Kazaa, Morpheus and others, which were usually packed with viruses and spyware. It was also very slow, and would take a long long time to download large files.\n\nSo learning to program was out of the question for a while, and I turned back to Quest, and tried to encourage Alex (The creator) to improve on QuestNet.\n\nWhile still developing my game in Quest, I kept searching for similar game developing software. A few game up, ADRIFT, SUDS, both of which had no multiplayer support.\n\nI then came across BYOND, which is primarily made for developing multiplayer games. I gave it a whirl, but didn't like the scripting language much, and once again, it was based on a pre-developed client that couldn't be customised.\nNot sure how far BYOND has come these days, but I know it's still around, and judging by the latest games on their website it seems fairly good in terms of customising your own client, and creating some fantastic online RPG games.\n<!-- m --><a class=\"postlink\" href=\"http://www.byond.com/games/hubpic/96451_9192.png\">http://www.byond.com/games/hubpic/96451_9192.png</a><!-- m -->\n<!-- m --><a class=\"postlink\" href=\"http://www.byond.com/games/hubpic/37191_2880.png\">http://www.byond.com/games/hubpic/37191_2880.png</a><!-- m -->\n\nBYOND can be downloaded from <!-- m --><a class=\"postlink\" href=\"http://www.byond.com\">http://www.byond.com</a><!-- m -->\n-------------------------------------\n\nFinding BYOND changed my goals on game development completely. I knew that making a graphical online RPG game would be a MASSIVELY increased success over a text-based game.\n\nStill without any programming knowledge I searched for software similar to Quest, and BYOND, that would help me create my own online RPG game.\nI came across RPG Maker 2000 (Need I say more?), which wasn't able to make online games, but it helped to improve my game design and mapping skills. Another game making software I came across was RPG Toolkit from Toolkit Zone. Not seen much of this software for years but it's now available at <!-- m --><a class=\"postlink\" href=\"http://www.rpgtoolkit.net\">http://www.rpgtoolkit.net</a><!-- m -->.\n\nIt must have been in later 2002 or early 2003 that I came across Playerworlds. I won't go into the history too much, but was based off the original Mirage Source (Now [url=http&#58;//www&#46;source&#46;draignet&#46;com:3f5go8el]DragonSource[/url:3f5go8el]), and was developed to assist in online 2D game development without ANY programming knowledge.\n\nThis software was PERFECT. It didn't have the option to customise your interface, but the default interface was already pretty cool, and there was a MASSIVE community for it. Infact, OnRPG originally used to have it's own dedicated section for Playerworld created games, back when OnRPG was cool, and supported home-brewed and free games, much more than it does today.\n\nThe most famous game to come from Playerworlds was Jerrath Online, which IIRC was Shannara's game (One of the founders of Mirage Online/Mirage Source).\nJerrath can STILL be downloaded in Playerworlds format (But a MUCH later version of the software) from <!-- m --><a class=\"postlink\" href=\"http://www.jerrath.com\">http://www.jerrath.com</a><!-- m --> and as of this post, I can confirm you CAN log in and play online.\n<!-- m --><a class=\"postlink\" href=\"http://jerrath.com/screenshots/1.gif\">http://jerrath.com/screenshots/1.gif</a><!-- m -->\n\nI developed my own game, set up a free website and had players log in and play from time to time. I was still very new at game development so still had so much to learn. The idea that you could create games in a short amount of time was a huge misconception.\nMost of the games were generally the same in terms of looks but all unique in design and gameplay, and some of them quite addictive.\n\nI'd gained a copy of Visual Basic Studio and was learning to program. Shortly after I'd found Mirage Source, which was the base of Playerworlds. This was very exciting as I was now able to completely customise my own game client the way I wanted it.\n\nIn 2004 I released the source code to my game &quot;Cult of Ishkur&quot;. This source code had multiple tileset support, encryption, MP3 support, pets, quests, alpha blending, NPC abilities such as poison, full D&amp;D stats, day and night effects, and many other features that inspired the later released Konfuze engine. As some of you may know, Konfuze source code eventually lead to Elysium, which was used to create the very first Eclipse engines, later inspiring Eclipse Origins, and Mirage Creation (From Crystalshire source).\nThe source code is VERY buggy, and the one that has been released to the public (Not by me) doesn't work without MAJOR bug fixing. It is called M:RPGe (Moonripper RPG Engine, named after the original head programmer who worked along-side me) and can be downloaded here:\n<!-- m --><a class=\"postlink\" href=\"http://echostorms.net/RPG/M_RPGe_0_118325612232004.zip\">http://echostorms.net/RPG/M_RPGe_0_118325612232004.zip</a><!-- m -->\n\nYou will notice it was released by Nevets Group, Surprisingly enough, Nevets is my name spelled backwards <!-- s:) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) -->\n\nOver the years I have been the head community moderator for BaronSoft/QBite which was the creator of the ORE gaming engine (Used to create VbGORE), and the original Mirage Source community when it was run by Granite.\n\nDeloria Online was originally made using ORE. I now own and run a modern version of the Deloria Online game called Deloria Origins, created using Eclipse 2.0 and heavily modified.\nI ran and maintained the old version for 5 years, and created a new game from Deloria called Adventures of Virellia.\n\nOld Deloria Online:\n<!-- m --><a class=\"postlink\" href=\"http://www.draignet.com/hosted/deloriaold/newDO4.jpg\">http://www.draignet.com/hosted/deloriaold/newDO4.jpg</a><!-- m -->\n\nAdventure of Virellia:\n<!-- m --><a class=\"postlink\" href=\"http://www.draignet.com/hosted/virellia3.jpg\">http://www.draignet.com/hosted/virellia3.jpg</a><!-- m -->\n\nUnfortunately my external hard drive packed up and I lost everything I had, which meant starting over from scratch.\n\nI now run [url=http&#58;//www&#46;draignet&#46;com:3f5go8el]DraigNET[/url:3f5go8el] which is a collection of projects that I run and develop.\n\nMy current gaming projects are:\n[url=http&#58;//www&#46;deloria&#46;draignet&#46;com:3f5go8el]Deloria Origins[/url:3f5go8el] - Inspired by the original Deloria Online and earlier versions of Merrimint\n[url=http&#58;//www&#46;source&#46;draignet&#46;com:3f5go8el]DragonSource[/url:3f5go8el] - The new home and name of Mirage Source, also offering support for a modified version of Eclipse 2.0 and a modified version of the recently unsupported Mirage Creation.\n[url=http&#58;//www&#46;pokegen&#46;draignet&#46;com:3f5go8el]Pokegen[/url:3f5go8el] - Currently in design phase, Pokegen is an online game creation software for making your own multiplayer pokemon games.\n\nAlso in the works is a partially text-based online RPG game, inspired from Nightmist and Realms of Kaos. I had plans to turn it into a text-based game maker, but due to the lack of interest in text-based games these days, I've decided to continue to develop it as a game rather than an engine, but only purely for nostalgic purposes, as this is the reason I set out to make a game in the first place. I don't have plans to turn it into a successful games, but if I get around to finishing it, the goal I set out to achieve 12 years ago will have been made.\n<!-- m --><a class=\"postlink\" href=\"http://planetsourcecode.com/Upload_PSC/ScreenShots/PIC201111014138175.jpg\">http://planetsourcecode.com/Upload_PSC/ ... 138175.jpg</a><!-- m -->\n--------------------------------\n\nTo say I've been successful in game development wouldn't be true. And due to todays technology, and all the free 3D games coming out, it's impossible to make a successful 2D online game like it was years ago.\nBut I enjoy doing it, it's a fun hobby, and I still love to play 2D online games over 3D games. Infact, I don't play any 3D online adventure games.\n\nSo that's me! Hope you enjoyed the read.",
      "EditableFormat": "bbcode",
      "HTML": "Good afternoon all! (Or prynhawn da! where I'm from).<br/><br/>I'm Xlithan, I'm nearly 25 years old, and this is my story...<br/><br/>Back in good old 1998 I acquired my first PC. This was a huge turning point in my life. Back then, most of you had only just learned how to talk, or even walk!  These were the days when having a PC was a novelty, because there was nothing on the internet that gave anybody the need to use one, unlike today where we have social networking, online banking, online booking offices and shopping.<br/>The best social chat website back then was something called Teen Chat, which I started using when I was 11 years old (Even though you had to be 13). Teen Chat was later banned because people thought it was inappropriate for young people to be engaged in online socialising, talking to strangers who lied about who they were. Which is slightly ironic, considering the power and influence of todays social networking.<br/><br/>I played many computer games at first, changed my wallpaper a few times, and downloaded a couple of screensavers on my dial-up connection. That's right kids, we used to plug a telephone cable into the back of our computers to get internet! Extremely expensive and so slow that it would take half an hour to load the Facebook page.<br/><br/>In 2000 I finally moved from Windows 98SE (Which was the better version of 98 of course) over to Windows 2000, which of course is based on the NT-Kernal frame. There was also Windows ME, which was similar to 2000 only it still used the MS-DOS framework, was very slow, and crashed a LOT.<br/>Also at this point in 2000, my parents had given me the gift of Blueyonder Broadband, 100 times faster than dial-up, AND it meant that I could stay connected to the internet 24/7!<br/>At this point, the majority of people in the UK owned a personal computer, and was connected to the internet.<br/><br/>This is where my online gaming experience starts.  Naturally being connected to the internet, I wanted more games to play, so I set off on my quest to download some games.<br/>In 2000, computer gaming was good, graphics and technology weren't as good as they are today but you had a decent selection of games, and Diablo 2 had just been released.<br/><br/>Text-based games were still largely popular, and you could get 300 to even 1000 players on large servers at any given time. This lead me to my first serious online game, called Nightmist Online. Just saying the name right now sends me back. It was a real-time, multi-player online game, all the basics of hack n slash roleplay, based on a table top RPG game invented by one of the creators.<br/>The only graphics were on the interface itself. If you had more than half a brain, you could imagine the world inside your head. Remembering directions was difficult at first but once you got into it you could sprint from town to town in a matter of seconds.<br/><!-- m --><a class=\"postlink\" href=\"http://images.onlinegamesinn.com/Nightmist-Online2.jpg\">http://images.onlinegamesinn.com/Nightmist-Online2.jpg</a><!-- m --><br/><br/>I played this game from January 2001, for the next 10 years.<br/><br/>There were other similar games to Nightmist, Realms of Kaos had been around much longer, was a larger game over-all and had a much bigger player base.<br/>Later came Deity Online, which never took off and was abandoned, and later on Revelation, created by a former Nightmist Online player. All 3 games are still downloadable and playable today, but unfortunately, the player base just isn't there any more and that's what made the games what they were.<br/><br/>You can still download and play here:<br/><!-- m --><a class=\"postlink\" href=\"http://www.nightmist-online.co.uk\">http://www.nightmist-online.co.uk</a><!-- m --><br/><!-- m --><a class=\"postlink\" href=\"http://realmsofkaos.net\">http://realmsofkaos.net</a><!-- m --><br/><!-- m --><a class=\"postlink\" href=\"http://www.kaldana.com\">http://www.kaldana.com</a><!-- m --><br/><br/>I also got into other text-based games along the way, such as Achaea and Imperian from <!-- m --><a class=\"postlink\" href=\"http://www.ironrealms.com\">http://www.ironrealms.com</a><!-- m --><br/>-------------------------------------<br/><br/>Naturally, I was inspired by the game, and how you could easily escape into another world, even it was fictional didn't matter, you could be whoever you wanted to be, and if you worked hard and gained the max level, you had respect from other players. which at 14 years old was great, and these were real people playing along side you.<br/><br/>I decided I was going to create my own world like Nightmist, so I set out to find out how. I had no programming knowledge, no design skills, no graphics skills or anything that would help me to start this project.<br/><br/>So in 2002 I eventually came across some software from AxeUK (Later Axe Software, and now Text Adventures Ltd) called Quest. This software allowed me to create my own single player text-based games, using the editing software, and it had it's very own scripting language called ASL. QuestNet was also in the works, which would allow multiple players to connect to a game. FANTASTIC! And so I began to design my own online adventure game.<br/><!-- m --><a class=\"postlink\" href=\"http://img.brothersoft.com/screenshots/softimage/q/quest-18410-1311820455.jpeg\">http://img.brothersoft.com/screenshots/ ... 20455.jpeg</a><!-- m --><br/><!-- m --><a class=\"postlink\" href=\"http://img.brothersoft.com/screenshots/softimage/q/quest-18410-1311820457.jpeg\">http://img.brothersoft.com/screenshots/ ... 20457.jpeg</a><!-- m --><br/><br/>Quest has really advanced over the years and is still a widely used software for text-based game competitions and educational uses.<br/><!-- m --><a class=\"postlink\" href=\"http://www.textadventures.co.uk\">http://www.textadventures.co.uk</a><!-- m --><br/>-------------------------------------<br/><br/>The problem with Quest, was that at the time it was fairly limited, in terms of to the extent of which I wanted to create a custom game. The online side of it hadn't really been developed enough, as far as interacting with other players went. I couldn't customise the client enough to make it how I wanted it, even if I paid the guy, it would still lack in many areas.<br/><br/>So, I asked the developer of Nightmist Online and Quest, what they used to make their software? They both answered, Visual Basic 6.<br/>Brilliant! How do I get this? Back in 2002, downloading software wasn't as easy as it is today. BitTorrent came out in 2001 but wasn't largely popular until later on. We had to make do with Peer 2 Peer software such as Kazaa, Morpheus and others, which were usually packed with viruses and spyware. It was also very slow, and would take a long long time to download large files.<br/><br/>So learning to program was out of the question for a while, and I turned back to Quest, and tried to encourage Alex (The creator) to improve on QuestNet.<br/><br/>While still developing my game in Quest, I kept searching for similar game developing software. A few game up, ADRIFT, SUDS, both of which had no multiplayer support.<br/><br/>I then came across BYOND, which is primarily made for developing multiplayer games. I gave it a whirl, but didn't like the scripting language much, and once again, it was based on a pre-developed client that couldn't be customised.<br/>Not sure how far BYOND has come these days, but I know it's still around, and judging by the latest games on their website it seems fairly good in terms of customising your own client, and creating some fantastic online RPG games.<br/><!-- m --><a class=\"postlink\" href=\"http://www.byond.com/games/hubpic/96451_9192.png\">http://www.byond.com/games/hubpic/96451_9192.png</a><!-- m --><br/><!-- m --><a class=\"postlink\" href=\"http://www.byond.com/games/hubpic/37191_2880.png\">http://www.byond.com/games/hubpic/37191_2880.png</a><!-- m --><br/><br/>BYOND can be downloaded from <!-- m --><a class=\"postlink\" href=\"http://www.byond.com\">http://www.byond.com</a><!-- m --><br/>-------------------------------------<br/><br/>Finding BYOND changed my goals on game development completely. I knew that making a graphical online RPG game would be a MASSIVELY increased success over a text-based game.<br/><br/>Still without any programming knowledge I searched for software similar to Quest, and BYOND, that would help me create my own online RPG game.<br/>I came across RPG Maker 2000 (Need I say more?), which wasn't able to make online games, but it helped to improve my game design and mapping skills. Another game making software I came across was RPG Toolkit from Toolkit Zone. Not seen much of this software for years but it's now available at <!-- m --><a class=\"postlink\" href=\"http://www.rpgtoolkit.net\">http://www.rpgtoolkit.net</a><!-- m -->.<br/><br/>It must have been in later 2002 or early 2003 that I came across Playerworlds. I won't go into the history too much, but was based off the original Mirage Source (Now <a href=\"http&#58;//www&#46;source&#46;draignet&#46;com\" rel=\"nofollow\">DragonSource</a>), and was developed to assist in online 2D game development without ANY programming knowledge.<br/><br/>This software was PERFECT. It didn't have the option to customise your interface, but the default interface was already pretty cool, and there was a MASSIVE community for it. Infact, OnRPG originally used to have it's own dedicated section for Playerworld created games, back when OnRPG was cool, and supported home-brewed and free games, much more than it does today.<br/><br/>The most famous game to come from Playerworlds was Jerrath Online, which IIRC was Shannara's game (One of the founders of Mirage Online/Mirage Source).<br/>Jerrath can STILL be downloaded in Playerworlds format (But a MUCH later version of the software) from <!-- m --><a class=\"postlink\" href=\"http://www.jerrath.com\">http://www.jerrath.com</a><!-- m --> and as of this post, I can confirm you CAN log in and play online.<br/><!-- m --><a class=\"postlink\" href=\"http://jerrath.com/screenshots/1.gif\">http://jerrath.com/screenshots/1.gif</a><!-- m --><br/><br/>I developed my own game, set up a free website and had players log in and play from time to time. I was still very new at game development so still had so much to learn. The idea that you could create games in a short amount of time was a huge misconception.<br/>Most of the games were generally the same in terms of looks but all unique in design and gameplay, and some of them quite addictive.<br/><br/>I'd gained a copy of Visual Basic Studio and was learning to program. Shortly after I'd found Mirage Source, which was the base of Playerworlds. This was very exciting as I was now able to completely customise my own game client the way I wanted it.<br/><br/>In 2004 I released the source code to my game &quot;Cult of Ishkur&quot;. This source code had multiple tileset support, encryption, MP3 support, pets, quests, alpha blending, NPC abilities such as poison, full D&amp;D stats, day and night effects, and many other features that inspired the later released Konfuze engine. As some of you may know, Konfuze source code eventually lead to Elysium, which was used to create the very first Eclipse engines, later inspiring Eclipse Origins, and Mirage Creation (From Crystalshire source).<br/>The source code is VERY buggy, and the one that has been released to the public (Not by me) doesn't work without MAJOR bug fixing. It is called M:RPGe (Moonripper RPG Engine, named after the original head programmer who worked along-side me) and can be downloaded here:<br/><!-- m --><a class=\"postlink\" href=\"http://echostorms.net/RPG/M_RPGe_0_118325612232004.zip\">http://echostorms.net/RPG/M_RPGe_0_118325612232004.zip</a><!-- m --><br/><br/>You will notice it was released by Nevets Group, Surprisingly enough, Nevets is my name spelled backwards <!-- s:) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) --><br/><br/>Over the years I have been the head community moderator for BaronSoft/QBite which was the creator of the ORE gaming engine (Used to create VbGORE), and the original Mirage Source community when it was run by Granite.<br/><br/>Deloria Online was originally made using ORE. I now own and run a modern version of the Deloria Online game called Deloria Origins, created using Eclipse 2.0 and heavily modified.<br/>I ran and maintained the old version for 5 years, and created a new game from Deloria called Adventures of Virellia.<br/><br/>Old Deloria Online:<br/><!-- m --><a class=\"postlink\" href=\"http://www.draignet.com/hosted/deloriaold/newDO4.jpg\">http://www.draignet.com/hosted/deloriaold/newDO4.jpg</a><!-- m --><br/><br/>Adventure of Virellia:<br/><!-- m --><a class=\"postlink\" href=\"http://www.draignet.com/hosted/virellia3.jpg\">http://www.draignet.com/hosted/virellia3.jpg</a><!-- m --><br/><br/>Unfortunately my external hard drive packed up and I lost everything I had, which meant starting over from scratch.<br/><br/>I now run <a href=\"http&#58;//www&#46;draignet&#46;com\" rel=\"nofollow\">DraigNET</a> which is a collection of projects that I run and develop.<br/><br/>My current gaming projects are:<br/><a href=\"http&#58;//www&#46;deloria&#46;draignet&#46;com\" rel=\"nofollow\">Deloria Origins</a> - Inspired by the original Deloria Online and earlier versions of Merrimint<br/><a href=\"http&#58;//www&#46;source&#46;draignet&#46;com\" rel=\"nofollow\">DragonSource</a> - The new home and name of Mirage Source, also offering support for a modified version of Eclipse 2.0 and a modified version of the recently unsupported Mirage Creation.<br/><a href=\"http&#58;//www&#46;pokegen&#46;draignet&#46;com\" rel=\"nofollow\">Pokegen</a> - Currently in design phase, Pokegen is an online game creation software for making your own multiplayer pokemon games.<br/><br/>Also in the works is a partially text-based online RPG game, inspired from Nightmist and Realms of Kaos. I had plans to turn it into a text-based game maker, but due to the lack of interest in text-based games these days, I've decided to continue to develop it as a game rather than an engine, but only purely for nostalgic purposes, as this is the reason I set out to make a game in the first place. I don't have plans to turn it into a successful games, but if I get around to finishing it, the goal I set out to achieve 12 years ago will have been made.<br/><!-- m --><a class=\"postlink\" href=\"http://planetsourcecode.com/Upload_PSC/ScreenShots/PIC201111014138175.jpg\">http://planetsourcecode.com/Upload_PSC/ ... 138175.jpg</a><!-- m --><br/>--------------------------------<br/><br/>To say I've been successful in game development wouldn't be true. And due to todays technology, and all the free 3D games coming out, it's impossible to make a successful 2D online game like it was years ago.<br/>But I enjoy doing it, it's a fun hobby, and I still love to play 2D online games over 3D games. Infact, I don't play any 3D online adventure games.<br/><br/>So that's me! Hope you enjoyed the read.",
      "PostDate": "2012-02-11T18:11:51+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "19645",
      "UserId": 0,
      "Username": "zizou98",
      "UserAvatar": null,
      "UserGravatar": "19d3f1a24659d7cce4c2973f82ed9ca7",
      "EditableText": "I read everything and enjoyed <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D -->\nI may go around to trying your games sooner or later. I have a question though: how did you learn programming? I would be interested to learn too. <!-- s:) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) -->",
      "EditableFormat": "bbcode",
      "HTML": "I read everything and enjoyed <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D --><br/>I may go around to trying your games sooner or later. I have a question though: how did you learn programming? I would be interested to learn too. <!-- s:) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) -->",
      "PostDate": "2012-02-21T17:50:18+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "19700",
      "UserId": 0,
      "Username": "Xlithan",
      "UserAvatar": null,
      "UserGravatar": "4d0fe9a8dc165feee9dbd6daa504dbc1",
      "EditableText": "Got a copy of Visual Basic, got a book, and learned.",
      "EditableFormat": "bbcode",
      "HTML": "Got a copy of Visual Basic, got a book, and learned.",
      "PostDate": "2012-03-01T06:42:59+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "19704",
      "UserId": 0,
      "Username": "mattroks101",
      "UserAvatar": null,
      "UserGravatar": "4db6c71e753ea87688fa9062be7ea980",
      "EditableText": "Wow, that was a very interesting story. Thanks for sharing.",
      "EditableFormat": "bbcode",
      "HTML": "Wow, that was a very interesting story. Thanks for sharing.",
      "PostDate": "2012-03-01T18:22:09+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "42149",
      "UserId": 0,
      "Username": "Faqeer1",
      "UserAvatar": null,
      "UserGravatar": "83654ef498a69739278f9bb0aa0792ef",
      "EditableText": "inspired from Nightmist and Realms of Kaos. I had plans to turn it into a text-based game maker, but due to the lack of interest in text-based games these days, I've decided to continue to develop it as a game rather than an engine, but only purely for nostalgic purposes,????\n\n\n\n== [url=http&#58;//www&#46;solitairecardgame&#46;info/:30gui4zk]Solitaire[/url:30gui4zk] ==",
      "EditableFormat": "bbcode",
      "HTML": "inspired from Nightmist and Realms of Kaos. I had plans to turn it into a text-based game maker, but due to the lack of interest in text-based games these days, I've decided to continue to develop it as a game rather than an engine, but only purely for nostalgic purposes,????<br/><br/><br/><br/>== <a href=\"http&#58;//www&#46;solitairecardgame&#46;info/\" rel=\"nofollow\">Solitaire</a> ==",
      "PostDate": "2016-04-09T07:41:08+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "42157",
      "UserId": 0,
      "Username": "HegemonKhan",
      "UserAvatar": null,
      "UserGravatar": "a96cf34d8d97c57de38f54ee22b1759b",
      "EditableText": "I learned to program from quest (I too had no programming knowledge), I learned of quest only ~4 years ago (I too wanted to learn to program/make games and was looking for free software, until I finally found quest, hehe), and then from quest, I'm now taking programming classes, and was shocked at how much quest taught me in terms of basic programming scripting and design concepts. I'm not learning as fast as the OP, as I'm not as smart, but I'm making progress. Don't know how to do any of the online/networking aspects that the OP learned, but maybe someday I'll get there... I'd like to ask how the OP went about learning the online/networking and etc-like aspects of game making.\n\nAt some point, I'd like to get into learning Unity (engine able to make 3d graphics), but not sure if I can learn graphical programming... that's it's own field, separate from just normal (basic/design) game programming. And there's also the Unreal engine too...\n\npersonally though, graphics are over-rated, once you're actually playing, it's been scientifically proven that you become completely unaware of the graphics (as you're busy trying to stay alive and etc, playing the game, lol), thus a graphical game, actually boils down to a game no different than a non-graphical game (a text adventure), as what makes the game actually good, is it's mechanics/play/story/plot and etc aspects (RPG type stuff).\n\nDon't get me wrong though, graphics are quite nice, especially in cool/sexy characters, laughs, and exotic beautiful worlds/environments/etc. But, without fail, those cool graphics become invisible/common/dull after you have been playing awhile, and especially when you're actually playing the game, you're literally blocking out the graphics entirely, as your brain is engaged/engrossed/immersed in the playing of the game, not admiring the game and its graphics.",
      "EditableFormat": "bbcode",
      "HTML": "I learned to program from quest (I too had no programming knowledge), I learned of quest only ~4 years ago (I too wanted to learn to program/make games and was looking for free software, until I finally found quest, hehe), and then from quest, I'm now taking programming classes, and was shocked at how much quest taught me in terms of basic programming scripting and design concepts. I'm not learning as fast as the OP, as I'm not as smart, but I'm making progress. Don't know how to do any of the online/networking aspects that the OP learned, but maybe someday I'll get there... I'd like to ask how the OP went about learning the online/networking and etc-like aspects of game making.<br/><br/>At some point, I'd like to get into learning Unity (engine able to make 3d graphics), but not sure if I can learn graphical programming... that's it's own field, separate from just normal (basic/design) game programming. And there's also the Unreal engine too...<br/><br/>personally though, graphics are over-rated, once you're actually playing, it's been scientifically proven that you become completely unaware of the graphics (as you're busy trying to stay alive and etc, playing the game, lol), thus a graphical game, actually boils down to a game no different than a non-graphical game (a text adventure), as what makes the game actually good, is it's mechanics/play/story/plot and etc aspects (RPG type stuff).<br/><br/>Don't get me wrong though, graphics are quite nice, especially in cool/sexy characters, laughs, and exotic beautiful worlds/environments/etc. But, without fail, those cool graphics become invisible/common/dull after you have been playing awhile, and especially when you're actually playing the game, you're literally blocking out the graphics entirely, as your brain is engaged/engrossed/immersed in the playing of the game, not admiring the game and its graphics.",
      "PostDate": "2016-04-09T23:51:00+01:00",
      "LastEditDate": null
    }
  ]
}
