{
  "Topic": {
    "TopicId": "4020",
    "ForumId": "16",
    "Title": "QuestComp for 2014?",
    "LastUpdated": "2014-04-23T17:12:15+01:00",
    "ReplyCount": 37
  },
  "Posts": [
    {
      "PostId": "26930",
      "UserId": 0,
      "Username": "TriangleGames",
      "UserAvatar": null,
      "UserGravatar": "134d9e995777da65c5cf8efda551d579",
      "EditableText": "Hi all,\nI haven't been around for a while, but I have been thinking about what to do with QuestComp, if anything.\nMy biggest concerns are timing and interest. I don't [i:4yi65u4n]really[/i:4yi65u4n] know how many Quest users usually enter the other big comps, or when people would be most likely to have time for QuestComp, concerning college finals, the holidays, etc.\n\nThe other issues, such as clarity of rules and deadlines, aren't hard to fix with a little attention to detail and proper planning. Things were sort of last minute and hasty before. Supposing that people are interested in doing QuestComp for 2014, I would be happy to provide a revision of all that to whomever will be the organizer, or organize it again myself.\n\nI feel the purpose of QuestComp should remain, [i:4yi65u4n]in part[/i:4yi65u4n], to be using Quest's features in an appreciable way. Other than that, I'm curious to know how people see, or [i:4yi65u4n]would like[/i:4yi65u4n] to see, QuestComp being formatted and fitting in with the schedule of other comps.\n\nI realize this is probably one of the worst times to start a poll, but it will permit re-voting, to allow for the influence of debate, and be listed as a &quot;never ending&quot; poll. I will &quot;bump&quot; it with some additional discussion after Thanksgiving weekend is over.\nIt is designed with three &quot;categories&quot; and allows three options to be chosen for that reason, but you can vote however you want, and remember you can change your votes later.",
      "EditableFormat": "bbcode",
      "HTML": "Hi all,<br/>I haven't been around for a while, but I have been thinking about what to do with QuestComp, if anything.<br/>My biggest concerns are timing and interest. I don't <span style=\"font-style:italic;\">really</span> know how many Quest users usually enter the other big comps, or when people would be most likely to have time for QuestComp, concerning college finals, the holidays, etc.<br/><br/>The other issues, such as clarity of rules and deadlines, aren't hard to fix with a little attention to detail and proper planning. Things were sort of last minute and hasty before. Supposing that people are interested in doing QuestComp for 2014, I would be happy to provide a revision of all that to whomever will be the organizer, or organize it again myself.<br/><br/>I feel the purpose of QuestComp should remain, <span style=\"font-style:italic;\">in part</span>, to be using Quest's features in an appreciable way. Other than that, I'm curious to know how people see, or <span style=\"font-style:italic;\">would like</span> to see, QuestComp being formatted and fitting in with the schedule of other comps.<br/><br/>I realize this is probably one of the worst times to start a poll, but it will permit re-voting, to allow for the influence of debate, and be listed as a &quot;never ending&quot; poll. I will &quot;bump&quot; it with some additional discussion after Thanksgiving weekend is over.<br/>It is designed with three &quot;categories&quot; and allows three options to be chosen for that reason, but you can vote however you want, and remember you can change your votes later.",
      "PostDate": "2013-11-27T18:08:18+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "26931",
      "UserId": 0,
      "Username": "tbritton",
      "UserAvatar": null,
      "UserGravatar": "aa3d953baab30b778c1351a982d82eb8",
      "EditableText": "Sounds great, and I cast my votes.  I would be glad to help in any way that I can.",
      "EditableFormat": "bbcode",
      "HTML": "Sounds great, and I cast my votes.  I would be glad to help in any way that I can.",
      "PostDate": "2013-11-27T19:39:35+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "26934",
      "UserId": 0,
      "Username": "george",
      "UserAvatar": null,
      "UserGravatar": "dc6fe8e6172303d85249a13c9a49c1ff",
      "EditableText": "I voted for a flash-fiction/challenged-creativity/minimal-overlap comp. I don't think there should be a rule to emphasize the use of Quest's special features though, but rather a creative prompt/theme or genre. I feel that this combination has the best chance of producing a decent number of games, and also is the most friendly to newcomers who want to bang out a game. It also makes it easier to advertise and possibly draw in some people from intfiction.org.",
      "EditableFormat": "bbcode",
      "HTML": "I voted for a flash-fiction/challenged-creativity/minimal-overlap comp. I don't think there should be a rule to emphasize the use of Quest's special features though, but rather a creative prompt/theme or genre. I feel that this combination has the best chance of producing a decent number of games, and also is the most friendly to newcomers who want to bang out a game. It also makes it easier to advertise and possibly draw in some people from intfiction.org.",
      "PostDate": "2013-11-28T02:01:52+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "26991",
      "UserId": 0,
      "Username": "TriangleGames",
      "UserAvatar": null,
      "UserGravatar": "134d9e995777da65c5cf8efda551d579",
      "EditableText": "[quote=&quot;george&quot;:10lmmb8r] ... I don't think there should be a rule to emphasize the use of Quest's special features though, but rather a creative prompt/theme or genre. I feel that this combination has the best chance of producing a decent number of games, and also is the most friendly to newcomers who want to bang out a game. It also makes it easier to advertise and possibly draw in some people from intfiction.org.[/quote:10lmmb8r]\n\nI thought about this for a while, and I decided you're right. Given the reasons that the &quot;features usage requirement&quot; was originally put in, we might better achieve the desired effect without it, for all the reasons you stated.\n\nI'm glad to see such a quick response even during a holiday weekend, but I have since remembered that some of you are likely in Europe, and so [i:10lmmb8r]probably[/i:10lmmb8r] don't put a lot of time aside for Thanksgiving, at least not in the sense of the American holiday. I sometimes forget where holidays come from and who celebrates them. At any rate, we've got five sets of votes already, counting mine, and it looks fairly consistent so far ...\n\nAt current: short competition, not to interfere with entering the bigger ones, with a theme.\n\nSo, here's what I'm thinking. While [b:10lmmb8r]IF Comp[/b:10lmmb8r] sets a time-line for people to work on their games, [b:10lmmb8r]Spring Thing[/b:10lmmb8r] does not, and there's nothing to stop people from working on their games year round for either. In trying to avoid &quot;overlap&quot; of working time, I would like to know when people generally start working on their [b:10lmmb8r]Spring Thing[/b:10lmmb8r] games. Also, whether it's really going to be amenable to have to go from submitting for [b:10lmmb8r]Spring Thing[/b:10lmmb8r] directly to working on [b:10lmmb8r]QuestComp[/b:10lmmb8r] just in time to start on [b:10lmmb8r]IF Comp[/b:10lmmb8r], one right after another.\n\nThere's basically two times of year that we could do [b:10lmmb8r]QuestComp[/b:10lmmb8r], after [b:10lmmb8r]Spring Thing[/b:10lmmb8r] or after [b:10lmmb8r]IF Comp[/b:10lmmb8r].\nA) If we go after [b:10lmmb8r]Spring Thing[/b:10lmmb8r], that leaves only the month of April between the submissions deadline for [b:10lmmb8r]Spring Thing[/b:10lmmb8r] (April 4th) and the &quot;suggested&quot; working time for [b:10lmmb8r]IF Comp[/b:10lmmb8r] (May-August). That [i:10lmmb8r]should[/i:10lmmb8r] be enough time to make a decent flash-fiction game, but it's definitely wedged in very tightly. In fact, it means it's during the judging period for [b:10lmmb8r]Spring Thing[/b:10lmmb8r].\nB) If after [b:10lmmb8r]IF Comp[/b:10lmmb8r], that leaves everything from the start of October through ... whenever people want to start working on [b:10lmmb8r]Spring Thing[/b:10lmmb8r]. That's way more time, but there are some problems there. For starters, it would be a little late for this year, although we could give people all of January and February, [i:10lmmb8r]in theory[/i:10lmmb8r]. There's also lots of holiday stuff all throughout, Fall semester finals in there somewhere, and the open-ended starting time of [b:10lmmb8r]Spring Thing[/b:10lmmb8r]. The first date mentioned is the &quot;Deadline for authors' intents to enter&quot; on March 1st, but that's only one month before the deadline for game submissions, and I would assume most people don't wait until then to start working on their games. Especially since [b:10lmmb8r]Spring Thing[/b:10lmmb8r] defines part of it's purpose as &quot;To provide a place for promoting [u:10lmmb8r]medium-sized to long works[/u:10lmmb8r] of interactive fiction.&quot;\n\nI'm not against having QuestComp 2014 be in April and starting the schedule for 2015 in October. If we actually say October through January, that would give people four whole months to find time to work on their games. Even with other things going on along the way, that should be plenty of time to make a very polished flash-fiction game. So, that's what is running around in my head at the moment. Thoughts?\n\nPS: I'm happy to be the organizer again this year unless someone else wants to do it, and while I expect the organizer to make the final decision, I'm open to suggestions on themes. In particular, whether a genre (i.e. comedy, spy, horror, etc.) or some other kind of theme would be preferred, such as an emotion, a story element, etc.\nTwo ideas that have been in my head since last year were inspired by &quot;Zombie Spaceship Wasteland: A Book by Patton Oswalt.&quot; In the book, he says that at some point in every nerd's youth, they try to write a story about one of three things: zombies, a spaceship, or a wasteland, and that which one they choose says something about them. He also talks about the tendency of getting in over your head creatively and not finishing things. The book is really more about his life, but those are themes that stood out to me. So it made me think it could be fun to have a comp where people choose one of those three things, [i:10lmmb8r]or[/i:10lmmb8r] a comp that suggests entrants dig up some &quot;great old idea&quot; they never finished and use that. Those are just ideas though, I'm not totally invested in them or anything.",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><cite>george wrote:</cite> ... I don't think there should be a rule to emphasize the use of Quest's special features though, but rather a creative prompt/theme or genre. I feel that this combination has the best chance of producing a decent number of games, and also is the most friendly to newcomers who want to bang out a game. It also makes it easier to advertise and possibly draw in some people from intfiction.org.</blockquote><br/><br/>I thought about this for a while, and I decided you're right. Given the reasons that the &quot;features usage requirement&quot; was originally put in, we might better achieve the desired effect without it, for all the reasons you stated.<br/><br/>I'm glad to see such a quick response even during a holiday weekend, but I have since remembered that some of you are likely in Europe, and so <span style=\"font-style:italic;\">probably</span> don't put a lot of time aside for Thanksgiving, at least not in the sense of the American holiday. I sometimes forget where holidays come from and who celebrates them. At any rate, we've got five sets of votes already, counting mine, and it looks fairly consistent so far ...<br/><br/>At current: short competition, not to interfere with entering the bigger ones, with a theme.<br/><br/>So, here's what I'm thinking. While <span style=\"font-weight:bold;\">IF Comp</span> sets a time-line for people to work on their games, <span style=\"font-weight:bold;\">Spring Thing</span> does not, and there's nothing to stop people from working on their games year round for either. In trying to avoid &quot;overlap&quot; of working time, I would like to know when people generally start working on their <span style=\"font-weight:bold;\">Spring Thing</span> games. Also, whether it's really going to be amenable to have to go from submitting for <span style=\"font-weight:bold;\">Spring Thing</span> directly to working on <span style=\"font-weight:bold;\">QuestComp</span> just in time to start on <span style=\"font-weight:bold;\">IF Comp</span>, one right after another.<br/><br/>There's basically two times of year that we could do <span style=\"font-weight:bold;\">QuestComp</span>, after <span style=\"font-weight:bold;\">Spring Thing</span> or after <span style=\"font-weight:bold;\">IF Comp</span>.<br/>A) If we go after <span style=\"font-weight:bold;\">Spring Thing</span>, that leaves only the month of April between the submissions deadline for <span style=\"font-weight:bold;\">Spring Thing</span> (April 4th) and the &quot;suggested&quot; working time for <span style=\"font-weight:bold;\">IF Comp</span> (May-August). That <span style=\"font-style:italic;\">should</span> be enough time to make a decent flash-fiction game, but it's definitely wedged in very tightly. In fact, it means it's during the judging period for <span style=\"font-weight:bold;\">Spring Thing</span>.<br/>B) If after <span style=\"font-weight:bold;\">IF Comp</span>, that leaves everything from the start of October through ... whenever people want to start working on <span style=\"font-weight:bold;\">Spring Thing</span>. That's way more time, but there are some problems there. For starters, it would be a little late for this year, although we could give people all of January and February, <span style=\"font-style:italic;\">in theory</span>. There's also lots of holiday stuff all throughout, Fall semester finals in there somewhere, and the open-ended starting time of <span style=\"font-weight:bold;\">Spring Thing</span>. The first date mentioned is the &quot;Deadline for authors' intents to enter&quot; on March 1st, but that's only one month before the deadline for game submissions, and I would assume most people don't wait until then to start working on their games. Especially since <span style=\"font-weight:bold;\">Spring Thing</span> defines part of it's purpose as &quot;To provide a place for promoting <span style=\"text-decoration:underline;\">medium-sized to long works</span> of interactive fiction.&quot;<br/><br/>I'm not against having QuestComp 2014 be in April and starting the schedule for 2015 in October. If we actually say October through January, that would give people four whole months to find time to work on their games. Even with other things going on along the way, that should be plenty of time to make a very polished flash-fiction game. So, that's what is running around in my head at the moment. Thoughts?<br/><br/>PS: I'm happy to be the organizer again this year unless someone else wants to do it, and while I expect the organizer to make the final decision, I'm open to suggestions on themes. In particular, whether a genre (i.e. comedy, spy, horror, etc.) or some other kind of theme would be preferred, such as an emotion, a story element, etc.<br/>Two ideas that have been in my head since last year were inspired by &quot;Zombie Spaceship Wasteland: A Book by Patton Oswalt.&quot; In the book, he says that at some point in every nerd's youth, they try to write a story about one of three things: zombies, a spaceship, or a wasteland, and that which one they choose says something about them. He also talks about the tendency of getting in over your head creatively and not finishing things. The book is really more about his life, but those are themes that stood out to me. So it made me think it could be fun to have a comp where people choose one of those three things, <span style=\"font-style:italic;\">or</span> a comp that suggests entrants dig up some &quot;great old idea&quot; they never finished and use that. Those are just ideas though, I'm not totally invested in them or anything.",
      "PostDate": "2013-12-03T17:36:10+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "26993",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "As far as I know, the IFComp doesn't have a timeline for people to work on their games. In theory you could work on something for 10 years and it would still be eligible for the comp provided it hasn't been released or you haven't publicly discussed it in any great detail.",
      "EditableFormat": "bbcode",
      "HTML": "As far as I know, the IFComp doesn't have a timeline for people to work on their games. In theory you could work on something for 10 years and it would still be eligible for the comp provided it hasn't been released or you haven't publicly discussed it in any great detail.",
      "PostDate": "2013-12-03T19:54:52+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "26997",
      "UserId": 0,
      "Username": "TriangleGames",
      "UserAvatar": null,
      "UserGravatar": "134d9e995777da65c5cf8efda551d579",
      "EditableText": "There is nothing in the [u:ls9b5hgi]rules[/u:ls9b5hgi] of IF Comp that says authors have to follow any time-line for when they work on their games,\nand indeed authors [i:ls9b5hgi]could[/i:ls9b5hgi] spend all year, or even multiple years, working on a single game entry.\nAt the same time, their annual schedule begins with,\n&quot;May - August: Authors work on their entries.&quot;\nWhich suggests to me that, to an extent, that is when they &quot;expect&quot; people to work on entries, but it is [u:ls9b5hgi]NOT[/u:ls9b5hgi] a rule.\n\nWhile I'm clarifying, I would like to point out that until the organizer uses the phrase: &quot;This is the official [i:ls9b5hgi]whatever[/i:ls9b5hgi],&quot;\nwhatever it is, is [i:ls9b5hgi]not[/i:ls9b5hgi] official. So, when I say that 'April is the only time between Spring Thing and IF Comp,' that doesn't necessarily mean that I wouldn't let QuestComp go on through May. I'm just pointing out when and where the overlap would happen for the sake of discussion. Of course, that's based on the listed schedules, without knowing when people would actually be working on their games, but I've gotta by [i:ls9b5hgi]something[/i:ls9b5hgi].",
      "EditableFormat": "bbcode",
      "HTML": "There is nothing in the <span style=\"text-decoration:underline;\">rules</span> of IF Comp that says authors have to follow any time-line for when they work on their games,<br/>and indeed authors <span style=\"font-style:italic;\">could</span> spend all year, or even multiple years, working on a single game entry.<br/>At the same time, their annual schedule begins with,<br/>&quot;May - August: Authors work on their entries.&quot;<br/>Which suggests to me that, to an extent, that is when they &quot;expect&quot; people to work on entries, but it is <span style=\"text-decoration:underline;\">NOT</span> a rule.<br/><br/>While I'm clarifying, I would like to point out that until the organizer uses the phrase: &quot;This is the official <span style=\"font-style:italic;\">whatever</span>,&quot;<br/>whatever it is, is <span style=\"font-style:italic;\">not</span> official. So, when I say that 'April is the only time between Spring Thing and IF Comp,' that doesn't necessarily mean that I wouldn't let QuestComp go on through May. I'm just pointing out when and where the overlap would happen for the sake of discussion. Of course, that's based on the listed schedules, without knowing when people would actually be working on their games, but I've gotta by <span style=\"font-style:italic;\">something</span>",
      "PostDate": "2013-12-04T00:56:04+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27000",
      "UserId": 0,
      "Username": "george",
      "UserAvatar": null,
      "UserGravatar": "dc6fe8e6172303d85249a13c9a49c1ff",
      "EditableText": "I agree that the post-IFComp months into the holidays isn't the best choice; not to mention Ectocomp which is the month of October. \n\nThat leaves January to mid-September. I wouldn't worry a whole lot about overlapping with Spring Thing since the idea here is shorter games, but then again you probably don't want it right on top of it. Also I wouldn't worry about overlapping with the working time for IFComp as long as we're before late July. So I think that leaves January-March and mid-April to mid-July as good options. Of those I'd pick January-March -- April to July is probably a bit busier with end of school, summer holidays and what not. \n\nAs far as theme goes I like that idea Triangle has of three options, though tbh I think zombies are overdone. There are a couple of game comps such as Ludum Dare where entrants vote to narrow the options down from a wider pool (so for example it'll start with 9, then you vote to 6, then to 3). That might be a fun way to do it.",
      "EditableFormat": "bbcode",
      "HTML": "I agree that the post-IFComp months into the holidays isn't the best choice; not to mention Ectocomp which is the month of October. <br/><br/>That leaves January to mid-September. I wouldn't worry a whole lot about overlapping with Spring Thing since the idea here is shorter games, but then again you probably don't want it right on top of it. Also I wouldn't worry about overlapping with the working time for IFComp as long as we're before late July. So I think that leaves January-March and mid-April to mid-July as good options. Of those I'd pick January-March -- April to July is probably a bit busier with end of school, summer holidays and what not. <br/><br/>As far as theme goes I like that idea Triangle has of three options, though tbh I think zombies are overdone. There are a couple of game comps such as Ludum Dare where entrants vote to narrow the options down from a wider pool (so for example it'll start with 9, then you vote to 6, then to 3). That might be a fun way to do it.",
      "PostDate": "2013-12-04T01:34:16+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27002",
      "UserId": 0,
      "Username": "TriangleGames",
      "UserAvatar": null,
      "UserGravatar": "134d9e995777da65c5cf8efda551d579",
      "EditableText": "BTW: I'm just going to assume that I'm the organizer unless someone else volunteers.\n\nI've just skimmed through the original topics regarding the creation of the first QuestComp, as well as an old post I made around the same time regarding flash-fiction games. I was surprised how much of that I had forgotten and/or remembered wrong.\n\nFor one thing, I had been thinking that QuestComp was meant to draw more interest to Quest from potential new users and showcase its capabilities. That was barely talked about, and it was not the original reason that QuestComp was suggested. It was more about just having our own comp for us Questers to have fun. Requiring features of the Quest program was suggested to add a uniqueness to the comp, and it was debated a fair amount.\n\nWhen I suggested people try making flash-fiction Quest games, part of my definition was a limit of 6 rooms, and homeeman proceeded to make a game in less than a day which was very well received. Even if we make the rules for QuestComp allow a game of twice that size, two months should be plenty of time, no matter what else is going on.\n\nI also noticed that of the people who expressed interest in last year's QuestComp but ultimately expressed being too busy with other things, the most common reasons were work and preexisting game projects. In fact, homeeman was the only person who specifically mentioned exams, and that was in reference to not having time to be the organizer. It was also in [i:3pryeg7r]March[/i:3pryeg7r], while I've mostly been worried about finals in May. So, at this point, I'm not really worried about schedule conflicts.\n\nI want to allow more time for making people aware of the comp than we did last time, and I want to make sure everything is ironed out and made clear well in advance. Right now I'm looking at just keeping it roughly were it was last year. So, I'd announce it by early January to get the word out, reveal the theme and kick-off the comp around the start of April, expect intent submission by May 1st, and game submissions by sometime in June. As for requiring Quest features, I'm leaning towards simply pointing out some of Quest's features to encourage people to look into them, but not making them a requirement in the rules. My only concern there is that it might be confusing to people, so I'd want to be very clear about it.\n\nStill just talking over here. You'll notice the &quot;O&quot; word was never used.\n\nEDIT: We could throw up a bunch of theme options in January and narrow it down by votes leading up to April. That could be fun.",
      "EditableFormat": "bbcode",
      "HTML": "BTW: I'm just going to assume that I'm the organizer unless someone else volunteers.<br/><br/>I've just skimmed through the original topics regarding the creation of the first QuestComp, as well as an old post I made around the same time regarding flash-fiction games. I was surprised how much of that I had forgotten and/or remembered wrong.<br/><br/>For one thing, I had been thinking that QuestComp was meant to draw more interest to Quest from potential new users and showcase its capabilities. That was barely talked about, and it was not the original reason that QuestComp was suggested. It was more about just having our own comp for us Questers to have fun. Requiring features of the Quest program was suggested to add a uniqueness to the comp, and it was debated a fair amount.<br/><br/>When I suggested people try making flash-fiction Quest games, part of my definition was a limit of 6 rooms, and homeeman proceeded to make a game in less than a day which was very well received. Even if we make the rules for QuestComp allow a game of twice that size, two months should be plenty of time, no matter what else is going on.<br/><br/>I also noticed that of the people who expressed interest in last year's QuestComp but ultimately expressed being too busy with other things, the most common reasons were work and preexisting game projects. In fact, homeeman was the only person who specifically mentioned exams, and that was in reference to not having time to be the organizer. It was also in <span style=\"font-style:italic;\">March</span>, while I've mostly been worried about finals in May. So, at this point, I'm not really worried about schedule conflicts.<br/><br/>I want to allow more time for making people aware of the comp than we did last time, and I want to make sure everything is ironed out and made clear well in advance. Right now I'm looking at just keeping it roughly were it was last year. So, I'd announce it by early January to get the word out, reveal the theme and kick-off the comp around the start of April, expect intent submission by May 1st, and game submissions by sometime in June. As for requiring Quest features, I'm leaning towards simply pointing out some of Quest's features to encourage people to look into them, but not making them a requirement in the rules. My only concern there is that it might be confusing to people, so I'd want to be very clear about it.<br/><br/>Still just talking over here. You'll notice the &quot;O&quot; word was never used.<br/><br/>EDIT: We could throw up a bunch of theme options in January and narrow it down by votes leading up to April. That could be fun.",
      "PostDate": "2013-12-04T15:04:39+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27003",
      "UserId": 0,
      "Username": "george",
      "UserAvatar": null,
      "UserGravatar": "dc6fe8e6172303d85249a13c9a49c1ff",
      "EditableText": "I think making the period from announcement, to theme, to intent, to games in hand that long (January to June) for short games might be counter-productive. Based on comps I've seen in other forums (mainly TIGSource) it seems to work better to compress the momentum into a shorter time span. Perhaps you build more interest that way by not letting it dissipate over multiple months?",
      "EditableFormat": "bbcode",
      "HTML": "I think making the period from announcement, to theme, to intent, to games in hand that long (January to June) for short games might be counter-productive. Based on comps I've seen in other forums (mainly TIGSource) it seems to work better to compress the momentum into a shorter time span. Perhaps you build more interest that way by not letting it dissipate over multiple months?",
      "PostDate": "2013-12-04T16:17:08+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27019",
      "UserId": 0,
      "Username": "TriangleGames",
      "UserAvatar": null,
      "UserGravatar": "134d9e995777da65c5cf8efda551d579",
      "EditableText": "I can see the logic there. So, maybe we make the formal announcement around late February or the beginning of March.\n\nI don't think any drastic changes to the rules need to be made, other than defining it as a Micro-Game contest with a theme and removing the features requirement. I still like that idea, and I know Alex did too, but it has started to remind me of a character or scene that I'm trying to force into a story where it doesn't belong just because I think it's cool.\n\nI want to issue a &quot;guideline&quot; for judging on a point scale to help keep things consistent from one judge to the next, but I don't plan on [i:3ounrq7v]forcing[/i:3ounrq7v] them to follow it. It'll probably look something like this:\n\nBest possible = 10\nWriting: 0 to 3 points (0=full of errors, 1=poor, 2=fair, 3=great) yes, this means you can earn 1 whole point by running a spell-checker\nOverall/Fun: 0—3\nDifficulty: 0—2\nUse of Theme: 0—2\nIncomplete: -2\nToo big/small: -2 (I'm thinking games should be at least 8 rooms and no more than 12)",
      "EditableFormat": "bbcode",
      "HTML": "I can see the logic there. So, maybe we make the formal announcement around late February or the beginning of March.<br/><br/>I don't think any drastic changes to the rules need to be made, other than defining it as a Micro-Game contest with a theme and removing the features requirement. I still like that idea, and I know Alex did too, but it has started to remind me of a character or scene that I'm trying to force into a story where it doesn't belong just because I think it's cool.<br/><br/>I want to issue a &quot;guideline&quot; for judging on a point scale to help keep things consistent from one judge to the next, but I don't plan on <span style=\"font-style:italic;\">forcing</span> them to follow it. It'll probably look something like this:<br/><br/>Best possible = 10<br/>Writing: 0 to 3 points (0=full of errors, 1=poor, 2=fair, 3=great) yes, this means you can earn 1 whole point by running a spell-checker<br/>Overall/Fun: 0—3<br/>Difficulty: 0—2<br/>Use of Theme: 0—2<br/>Incomplete: -2<br/>Too big/small: -2 (I'm thinking games should be at least 8 rooms and no more than 12)",
      "PostDate": "2013-12-05T20:40:35+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27020",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "Knocking points off because there's a few too many / too few locations seems a tad harsh. You'll either have people cutting out locations vital to the game or adding extra ones simply to bring the total up to the necessary amount. And judging something on difficulty will be tricky as difficulty is subjective - what one person finds difficult, another might find easy.",
      "EditableFormat": "bbcode",
      "HTML": "Knocking points off because there's a few too many / too few locations seems a tad harsh. You'll either have people cutting out locations vital to the game or adding extra ones simply to bring the total up to the necessary amount. And judging something on difficulty will be tricky as difficulty is subjective - what one person finds difficult, another might find easy.",
      "PostDate": "2013-12-05T22:00:02+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27021",
      "UserId": 0,
      "Username": "TriangleGames",
      "UserAvatar": null,
      "UserGravatar": "134d9e995777da65c5cf8efda551d579",
      "EditableText": "We can just say to aim for &quot;approximately 10 rooms&quot; in the rules and leave it at that, without a penalty.\nAnybody think incomplete games should just be disqualified instead of penalized?\n\nDifficulty may not be the best word for what I was thinking of. So I could rename that or replace it with something else.\nWhat I was looking at was the difficulty of the verb usage in particular.\nIn other words, if every item in the game is activated by the verb &quot;use,&quot; that's too easy.\nIf people end up playing &quot;guess the verb,&quot; that's too hard and for the wrong reason.\nSo, it's less about how easy or hard the game is and more about [i:3nkop937]why[/i:3nkop937]. If you compare it to other kinds of video games, it's sort of the IF version of play-control, which is commonly used in reviews (or it was, before I had grey hairs).\n\nI'm working on a big old list of genres and writing themes to whittle down. People can feel free to start tossing ideas on the table for that as well.",
      "EditableFormat": "bbcode",
      "HTML": "We can just say to aim for &quot;approximately 10 rooms&quot; in the rules and leave it at that, without a penalty.<br/>Anybody think incomplete games should just be disqualified instead of penalized?<br/><br/>Difficulty may not be the best word for what I was thinking of. So I could rename that or replace it with something else.<br/>What I was looking at was the difficulty of the verb usage in particular.<br/>In other words, if every item in the game is activated by the verb &quot;use,&quot; that's too easy.<br/>If people end up playing &quot;guess the verb,&quot; that's too hard and for the wrong reason.<br/>So, it's less about how easy or hard the game is and more about <span style=\"font-style:italic;\">why</span>. If you compare it to other kinds of video games, it's sort of the IF version of play-control, which is commonly used in reviews (or it was, before I had grey hairs).<br/><br/>I'm working on a big old list of genres and writing themes to whittle down. People can feel free to start tossing ideas on the table for that as well.",
      "PostDate": "2013-12-06T01:16:47+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27022",
      "UserId": 0,
      "Username": "george",
      "UserAvatar": null,
      "UserGravatar": "dc6fe8e6172303d85249a13c9a49c1ff",
      "EditableText": "I think rather than a number of rooms, it would be better to ask for a length of play time (like, 1 hour or less or something). This is certainly more subjective than number of rooms but I think it's a little friendlier to work with.",
      "EditableFormat": "bbcode",
      "HTML": "I think rather than a number of rooms, it would be better to ask for a length of play time (like, 1 hour or less or something). This is certainly more subjective than number of rooms but I think it's a little friendlier to work with.",
      "PostDate": "2013-12-06T01:43:24+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27025",
      "UserId": 0,
      "Username": "tbritton",
      "UserAvatar": null,
      "UserGravatar": "aa3d953baab30b778c1351a982d82eb8",
      "EditableText": "I agree on making the number or rooms a guideline with no penalty.\n\nI think incomplete games should be disqualified.\n\nI presume you do not intend on penalizing someone who chooses to have simple puzzles.  On the other hand, I agree with your point about the &quot;use&quot; verb.  I would consider this in the same category as when 90% of the commands you enter get a default response, and other similar issues.  I would just group them together and call it game play.\n\nI'm OK with rooms or time, but if you go with time I think 2 hours would be a minimum.  Less than that and you don't have enough time to create a story, develop the character(s) and throw in a few puzzles.",
      "EditableFormat": "bbcode",
      "HTML": "I agree on making the number or rooms a guideline with no penalty.<br/><br/>I think incomplete games should be disqualified.<br/><br/>I presume you do not intend on penalizing someone who chooses to have simple puzzles.  On the other hand, I agree with your point about the &quot;use&quot; verb.  I would consider this in the same category as when 90% of the commands you enter get a default response, and other similar issues.  I would just group them together and call it game play.<br/><br/>I'm OK with rooms or time, but if you go with time I think 2 hours would be a minimum.  Less than that and you don't have enough time to create a story, develop the character(s) and throw in a few puzzles.",
      "PostDate": "2013-12-06T02:17:28+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27026",
      "UserId": 0,
      "Username": "TriangleGames",
      "UserAvatar": null,
      "UserGravatar": "134d9e995777da65c5cf8efda551d579",
      "EditableText": "I think games with simple puzzles and complex puzzles can both be fun as long as they're well done. I've enjoyed most of the Zelda games; there's not a lot of mind-bogglers there. The first Silent Hill had some serious stumpers though, and I liked those too (oh man, that piano).\nI like the broader definition of game-play as a replacement for difficulty.\n\nNot accepting incomplete games would be the norm. I was probably just being too nice or trying to get more games in, but it is flash-fiction. Not finished is not finished.\n\nFINAL EDIT, I'm so sorry:\nI had a lot of stuff written here that mostly added up to me &quot;thinking out loud.&quot; Since I don't want to go around deleting things I've said, I've put it in a code box to save space. Here's the gist of it. I still feel like designing to a certain play-time feels weird, but apparently it's not unusual. After much thought, I think the idea of a rooms limit is interesting, but &quot;approximately one hour to complete&quot; is probably fine.\n\nThe &quot;# of rooms VS play-time&quot; question is one I'd definitely like to hear more opinions on. So, if anyone's been reading this quietly, that would be a great topic to speak up about. Also, if anyone knows of any other micro-game or flash-fiction style competitions that have been done before, please point me to them for reference. And thank you! thank you! thank you! to everyone who's been helping out with this whole discussion. It's helping me a lot to hear other opinions.\n\nOLD TEXT:\n[code:231b60wc]I'm really not sure about the time thing&#46; A simple, easy game could pack a LOT of stuff into a short time, which kind of goes against concept here&#46; Fitting a complete story into a short space is the basic challenge of flash-fiction&#46; If I picture myself making an entry with a target game-play time, it kind of frightens me&#46; How do I know how long it is before it's done? What do I do if my beta testers tell me it's taking way more or less time than I expected? Different people have different play-styles&#46; Some people ignore everything that looks like a distraction and run to the end&#46; Other people are &quot;completionists&quot; that may take their time reading ALL the scenery descriptions and trying silly things to see what happens (me)&#46; Some people even just read faster than others&#46;\n\nOut of curiosity, I'd appreciate hearing from anyone who played my game &quot;Day Of Honor&quot; to tell me roughly how long it took them&#46;\nOr Adam Holbrook's &quot;Captain Jumbo&#46;&quot; They were designed with a 6 room limit, along with some other restrictions&#46; Since I'm familiar with how they were made, the time it took people to play them might tell me something useful&#46; Just a thought&#46; If you haven't played Captain Jumbo, it is a trip&#46;\n\nAfter doing some googling and looking at genre definitions on ifwiki, I'm seeing that what I had in mind is, well, not typical of the IF community&#46; Part of the point was to make games that would be shorter than &quot;the big comps&quot; to fit with a shorter time-frame for the competition&#46; That immediately put me back to thinking about text-adventures as flash-fiction&#46; I see two relevant catagories&#58; IF competition entries (&quot;typically designed to be played in under two hours&quot;), and mini-comp entries (&quot;typically small in scope, but need not be&quot;)&#46; I was not planning a &quot;mini-comp&quot; in the sense that it is defined on ifwiki&#46; What I was picturing was restrictively short games that are well put together, which, like flash-fiction (typically anywhere from 200-1000 words), are intended to challenge the author's ability to tell a &#91;u&#93;complete&#91;/u&#93; story with few words&#46; Although, in this case, it would be a short game, with as many words as it takes&#46; Now, we don't have to do that, it's still all up in the air, but I want to make sure we're all talking about the same thing&#46;[/code:231b60wc]",
      "EditableFormat": "bbcode",
      "HTML": "I think games with simple puzzles and complex puzzles can both be fun as long as they're well done. I've enjoyed most of the Zelda games; there's not a lot of mind-bogglers there. The first Silent Hill had some serious stumpers though, and I liked those too (oh man, that piano).<br/>I like the broader definition of game-play as a replacement for difficulty.<br/><br/>Not accepting incomplete games would be the norm. I was probably just being too nice or trying to get more games in, but it is flash-fiction. Not finished is not finished.<br/><br/>FINAL EDIT, I'm so sorry:<br/>I had a lot of stuff written here that mostly added up to me &quot;thinking out loud.&quot; Since I don't want to go around deleting things I've said, I've put it in a code box to save space. Here's the gist of it. I still feel like designing to a certain play-time feels weird, but apparently it's not unusual. After much thought, I think the idea of a rooms limit is interesting, but &quot;approximately one hour to complete&quot; is probably fine.<br/><br/>The &quot;# of rooms VS play-time&quot; question is one I'd definitely like to hear more opinions on. So, if anyone's been reading this quietly, that would be a great topic to speak up about. Also, if anyone knows of any other micro-game or flash-fiction style competitions that have been done before, please point me to them for reference. And thank you! thank you! thank you! to everyone who's been helping out with this whole discussion. It's helping me a lot to hear other opinions.<br/><br/>OLD TEXT:<br/><pre><code>I'm really not sure about the time thing&#46; A simple, easy game could pack a LOT of stuff into a short time, which kind of goes against concept here&#46; Fitting a complete story into a short space is the basic challenge of flash-fiction&#46; If I picture myself making an entry with a target game-play time, it kind of frightens me&#46; How do I know how long it is before it's done? What do I do if my beta testers tell me it's taking way more or less time than I expected? Different people have different play-styles&#46; Some people ignore everything that looks like a distraction and run to the end&#46; Other people are &quot;completionists&quot; that may take their time reading ALL the scenery descriptions and trying silly things to see what happens (me)&#46; Some people even just read faster than others&#46;<br/><br/>Out of curiosity, I'd appreciate hearing from anyone who played my game &quot;Day Of Honor&quot; to tell me roughly how long it took them&#46;<br/>Or Adam Holbrook's &quot;Captain Jumbo&#46;&quot; They were designed with a 6 room limit, along with some other restrictions&#46; Since I'm familiar with how they were made, the time it took people to play them might tell me something useful&#46; Just a thought&#46; If you haven't played Captain Jumbo, it is a trip&#46;<br/><br/>After doing some googling and looking at genre definitions on ifwiki, I'm seeing that what I had in mind is, well, not typical of the IF community&#46; Part of the point was to make games that would be shorter than &quot;the big comps&quot; to fit with a shorter time-frame for the competition&#46; That immediately put me back to thinking about text-adventures as flash-fiction&#46; I see two relevant catagories&#58; IF competition entries (&quot;typically designed to be played in under two hours&quot;), and mini-comp entries (&quot;typically small in scope, but need not be&quot;)&#46; I was not planning a &quot;mini-comp&quot; in the sense that it is defined on ifwiki&#46; What I was picturing was restrictively short games that are well put together, which, like flash-fiction (typically anywhere from 200-1000 words), are intended to challenge the author's ability to tell a &#91;u&#93;complete&#91;/u&#93; story with few words&#46; Although, in this case, it would be a short game, with as many words as it takes&#46; Now, we don't have to do that, it's still all up in the air, but I want to make sure we're all talking about the same thing&#46;</code></pre>",
      "PostDate": "2013-12-06T03:18:06+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27027",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "The amount of time it takes to finish a game is also subjective. It might take you an hour to finish it, but if the player gets stuck on a certain puzzle, or just naturally plays slower than you, is it right for him to knock points off because it took him longer than an hour?\n\nWhat advantage is there to all the extra rules over, say, a simple rule which states your game must be complete and not impossible to finish? Generally, the more rules a comp has, the less likely it is people will enter it.\n\nMaybe a simple 1 - 10 voting system with 1 being terrible and 10 being great would be the way to go?",
      "EditableFormat": "bbcode",
      "HTML": "The amount of time it takes to finish a game is also subjective. It might take you an hour to finish it, but if the player gets stuck on a certain puzzle, or just naturally plays slower than you, is it right for him to knock points off because it took him longer than an hour?<br/><br/>What advantage is there to all the extra rules over, say, a simple rule which states your game must be complete and not impossible to finish? Generally, the more rules a comp has, the less likely it is people will enter it.<br/><br/>Maybe a simple 1 - 10 voting system with 1 being terrible and 10 being great would be the way to go?",
      "PostDate": "2013-12-06T06:49:55+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27030",
      "UserId": 0,
      "Username": "TriangleGames",
      "UserAvatar": null,
      "UserGravatar": "134d9e995777da65c5cf8efda551d579",
      "EditableText": "Be it a room count or play time, the point is only to communicate that the games should be [i:17hovoae]short[/i:17hovoae] short. It may not even need to be in the rules at all. It could just be mentioned in the description of the contest. There wouldn't be any penalty to assign if it were just based on play-time, because that IS too subjective to judge in that way. A penalty based on room count, or some other technical measurement, would make sense if it was seriously meant to be a [u:17hovoae]flash-fiction[/u:17hovoae] contest. It's about skillfully crafted brevity. In a literary flash-fiction contest, going over the word count [i:17hovoae]might[/i:17hovoae] just disqualify a person. Since it's about the challenge of the size, the size has to be enforced somehow for it to work.\n\nSo I guess part of the question here is, do people really want to do an IF equivalent of a flash-fiction contest, or will I just be pointing out to people &quot;hey, you've only got so much time to design, so don't let your games get so long that you can't finish them.&quot; That was part of my reasoning for doing it as flash-fiction, to make sure people finish their games by telling them to make it very short. (Btw, after reading the ifwiki on mini-comps, I would like to avoid using that term for this contest.) Now, before anyone goes answering that question, I should point out that a room count was only one of several ideas I've had for how to translate flash-fiction into IF. [b:17hovoae]If[/b:17hovoae] it was entirely up to me, and I was [b:17hovoae]dead-serious[/b:17hovoae] about doing ... (dag-nabit, I really need a term for this ...) ... MicroQuests, I would probably make several restrictions or put more thought into a more effective single restriction. I'm talking about things like:\n\n\n• No more than approximately [i:17hovoae]X[/i:17hovoae] rooms (perhaps 8-12)\n\n• No more than approximately [i:17hovoae]X[/i:17hovoae] “take” items (perhaps 15-20) [b:17hovoae][i:17hovoae]AND[/i:17hovoae][/b:17hovoae]\n• Limit unneeded items to a few red herrings (don't waste your time making items for everything in the kitchen cabinets)\n\n• Exposition should be no more than about &quot;half a page&quot; or &quot;one page&quot; at a time (make those &quot;walls of text&quot; be more like a low fence)\n\n• Completable in approximately [i:17hovoae]X[/i:17hovoae] actions, not counting [i:17hovoae]LOOK, TAKE, OPEN, MOVE[/i:17hovoae] or conversation cues (perhaps 20-25)\n\n• No more than approximately [i:17hovoae]X[/i:17hovoae] core puzzles (perhaps 2-3)\n(finding a key under a vase to unlock a door is [i:17hovoae]not[/i:17hovoae] a &quot;core puzzle&quot;, use all the simple puzzles of that sort you want\nassembling a unique key from multiple components which must each be found [i:17hovoae]is[/i:17hovoae] a core puzzle)\n\n\nAgain, those are just thoughts I've had on how flash-fiction might translate to text-adventures. It may be that it just doesn't translate well, and I should just say, &quot;keep it short.&quot; But when I suggested the idea last year, homeeman, sgreig, and I all produced fairly good games. So, I believe that it [i:17hovoae]can[/i:17hovoae] work. Whether there's enough people interested in [i:17hovoae]doing[/i:17hovoae] it is another issue.\n\nThe guidelines I presented for judging in this contest would only be that, guidelines to put similar ideas in the judges minds so that one doesn't judge primarily on story-telling while another is judging on mostly technical stuff. I don't want to put off judges by dictating any actual rules for them that would be that specific.",
      "EditableFormat": "bbcode",
      "HTML": "Be it a room count or play time, the point is only to communicate that the games should be <span style=\"font-style:italic;\">short</span> short. It may not even need to be in the rules at all. It could just be mentioned in the description of the contest. There wouldn't be any penalty to assign if it were just based on play-time, because that IS too subjective to judge in that way. A penalty based on room count, or some other technical measurement, would make sense if it was seriously meant to be a <span style=\"text-decoration:underline;\">flash-fiction</span> contest. It's about skillfully crafted brevity. In a literary flash-fiction contest, going over the word count <span style=\"font-style:italic;\">might</span> just disqualify a person. Since it's about the challenge of the size, the size has to be enforced somehow for it to work.<br/><br/>So I guess part of the question here is, do people really want to do an IF equivalent of a flash-fiction contest, or will I just be pointing out to people &quot;hey, you've only got so much time to design, so don't let your games get so long that you can't finish them.&quot; That was part of my reasoning for doing it as flash-fiction, to make sure people finish their games by telling them to make it very short. (Btw, after reading the ifwiki on mini-comps, I would like to avoid using that term for this contest.) Now, before anyone goes answering that question, I should point out that a room count was only one of several ideas I've had for how to translate flash-fiction into IF. <span style=\"font-weight:bold;\">If</span> it was entirely up to me, and I was <span style=\"font-weight:bold;\">dead-serious</span> about doing ... (dag-nabit, I really need a term for this ...) ... MicroQuests, I would probably make several restrictions or put more thought into a more effective single restriction. I'm talking about things like:<br/><br/><br/>• No more than approximately <span style=\"font-style:italic;\">X</span> rooms (perhaps 8-12)<br/><br/>• No more than approximately <span style=\"font-style:italic;\">X</span> “take” items (perhaps 15-20) <span style=\"font-weight:bold;\"><span style=\"font-style:italic;\">AND</span></span><br/>• Limit unneeded items to a few red herrings (don't waste your time making items for everything in the kitchen cabinets)<br/><br/>• Exposition should be no more than about &quot;half a page&quot; or &quot;one page&quot; at a time (make those &quot;walls of text&quot; be more like a low fence)<br/><br/>• Completable in approximately <span style=\"font-style:italic;\">X</span> actions, not counting <span style=\"font-style:italic;\">LOOK, TAKE, OPEN, MOVE</span> or conversation cues (perhaps 20-25)<br/><br/>• No more than approximately <span style=\"font-style:italic;\">X</span> core puzzles (perhaps 2-3)<br/>(finding a key under a vase to unlock a door is <span style=\"font-style:italic;\">not</span> a &quot;core puzzle&quot;, use all the simple puzzles of that sort you want<br/>assembling a unique key from multiple components which must each be found <span style=\"font-style:italic;\">is</span> a core puzzle)<br/><br/><br/>Again, those are just thoughts I've had on how flash-fiction might translate to text-adventures. It may be that it just doesn't translate well, and I should just say, &quot;keep it short.&quot; But when I suggested the idea last year, homeeman, sgreig, and I all produced fairly good games. So, I believe that it <span style=\"font-style:italic;\">can</span> work. Whether there's enough people interested in <span style=\"font-style:italic;\">doing</span> it is another issue.<br/><br/>The guidelines I presented for judging in this contest would only be that, guidelines to put similar ideas in the judges minds so that one doesn't judge primarily on story-telling while another is judging on mostly technical stuff. I don't want to put off judges by dictating any actual rules for them that would be that specific.",
      "PostDate": "2013-12-06T15:02:27+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27033",
      "UserId": 0,
      "Username": "george",
      "UserAvatar": null,
      "UserGravatar": "dc6fe8e6172303d85249a13c9a49c1ff",
      "EditableText": "I think a flash fiction idea is interesting, but like Triangle is saying difficult to define, especially in a system like Quest.\n\nThough I'm curious if you all are aware of this comp, <!-- m --><a class=\"postlink\" href=\"http://blog.templaro.com/?page_id=118\">http://blog.templaro.com/?page_id=118</a><!-- m -->\n\n<!-- m --><a class=\"postlink\" href=\"http://dhakajack.templaro.com/twifentries\">http://dhakajack.templaro.com/twifentries</a><!-- m -->",
      "EditableFormat": "bbcode",
      "HTML": "I think a flash fiction idea is interesting, but like Triangle is saying difficult to define, especially in a system like Quest.<br/><br/>Though I'm curious if you all are aware of this comp, <!-- m --><a class=\"postlink\" href=\"http://blog.templaro.com/?page_id=118\">http://blog.templaro.com/?page_id=118</a><!-- m --><br/><br/><!-- m --><a class=\"postlink\" href=\"http://dhakajack.templaro.com/twifentries\">http://dhakajack.templaro.com/twifentries</a><!-- m -->",
      "PostDate": "2013-12-06T15:18:47+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27034",
      "UserId": 0,
      "Username": "TriangleGames",
      "UserAvatar": null,
      "UserGravatar": "134d9e995777da65c5cf8efda551d579",
      "EditableText": "That was interesting. Those are super-short! The only one I got to play online for me was &quot;The Ring,&quot; but it was neat. Thanks.\n\nI think I'm gonna pop over to intfiction.org soon to invite people to our discussion here.\n\nEdit: Added &quot;completable in [i:3u5dhtyo]X[/i:3u5dhtyo] actions&quot; to my [url=http&#58;//forum&#46;textadventures&#46;co&#46;uk/viewtopic&#46;php?f=16&amp;t=4020&amp;start=15#p27030:3u5dhtyo]ideas list[/url:3u5dhtyo].",
      "EditableFormat": "bbcode",
      "HTML": "That was interesting. Those are super-short! The only one I got to play online for me was &quot;The Ring,&quot; but it was neat. Thanks.<br/><br/>I think I'm gonna pop over to intfiction.org soon to invite people to our discussion here.<br/><br/>Edit: Added &quot;completable in <span style=\"font-style:italic;\">X</span> actions&quot; to my <a href=\"http&#58;//forum&#46;textadventures&#46;co&#46;uk/viewtopic&#46;php?f=16&amp;t=4020&amp;start=15#p27030\" rel=\"nofollow\">ideas list</a>",
      "PostDate": "2013-12-06T15:45:56+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27042",
      "UserId": 0,
      "Username": "The Pixie",
      "UserAvatar": null,
      "UserGravatar": "cfa37e927f96177bcf6053ae8f108f77",
      "EditableText": "Just a random thought, but we get a lot of people asking about how to create RPG games. If we had the basic framework, we could have a competition where each entry is a section of a single game. Obviously this would take rather more effort to set up, but it would be quite different to IFcomp.",
      "EditableFormat": "bbcode",
      "HTML": "Just a random thought, but we get a lot of people asking about how to create RPG games. If we had the basic framework, we could have a competition where each entry is a section of a single game. Obviously this would take rather more effort to set up, but it would be quite different to IFcomp.",
      "PostDate": "2013-12-07T15:34:12+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27043",
      "UserId": 0,
      "Username": "george",
      "UserAvatar": null,
      "UserGravatar": "dc6fe8e6172303d85249a13c9a49c1ff",
      "EditableText": "I like Pixie's idea, it's similar to the 'Whispers' games where people write some code then pass it on to the next person. \n\nLooking at the 'no more than X' kinds of restrictions, I think that things like that are meaningful when the restriction is somewhat unique. For example, the One Room Game Comp. Or 'completable in one action'. To me saying 'completable in 100 actions' or 'no more than 12 rooms' seems kind of vague even though it's actually specific, if that makes any sense.",
      "EditableFormat": "bbcode",
      "HTML": "I like Pixie's idea, it's similar to the 'Whispers' games where people write some code then pass it on to the next person. <br/><br/>Looking at the 'no more than X' kinds of restrictions, I think that things like that are meaningful when the restriction is somewhat unique. For example, the One Room Game Comp. Or 'completable in one action'. To me saying 'completable in 100 actions' or 'no more than 12 rooms' seems kind of vague even though it's actually specific, if that makes any sense.",
      "PostDate": "2013-12-07T18:44:44+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27048",
      "UserId": 0,
      "Username": "tbritton",
      "UserAvatar": null,
      "UserGravatar": "aa3d953baab30b778c1351a982d82eb8",
      "EditableText": "While I find the flash IF intriguing, all those rules make it a bit complicated, and in my opinion complicated rules and creativity are pretty much exclusive of each other.  Rather than specify every little detail why not  set a limit on file size (or word count).  Of course that would have to be prior to publication since you could beat the system by stripping out a bunch of the core stuff.  If you want to go down the flash fiction path that would create some interesting challenges for authors, would meet your goals and be quantitative without being overly burdensome.\n\nAs far as the RPG thing, I don't think that really plays to Quest's strengths or works very well as a competition.  In addition I think you would eliminate a large percentage of potential contestants.\n\nAs usual, just my opinion.",
      "EditableFormat": "bbcode",
      "HTML": "While I find the flash IF intriguing, all those rules make it a bit complicated, and in my opinion complicated rules and creativity are pretty much exclusive of each other.  Rather than specify every little detail why not  set a limit on file size (or word count).  Of course that would have to be prior to publication since you could beat the system by stripping out a bunch of the core stuff.  If you want to go down the flash fiction path that would create some interesting challenges for authors, would meet your goals and be quantitative without being overly burdensome.<br/><br/>As far as the RPG thing, I don't think that really plays to Quest's strengths or works very well as a competition.  In addition I think you would eliminate a large percentage of potential contestants.<br/><br/>As usual, just my opinion.",
      "PostDate": "2013-12-08T04:17:30+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27049",
      "UserId": 0,
      "Username": "TriangleGames",
      "UserAvatar": null,
      "UserGravatar": "134d9e995777da65c5cf8efda551d579",
      "EditableText": "EDIT:\nI cannot believe this did not occur to me until now. \nPerhaps the best way to translate flash-fiction into a text-adventure comp would be to have people \n[i:23ktfsra]write a flash-fiction story[/i:23ktfsra] of up to approximately 1,000 words, and then turn the story into a game.\nMaybe we could allow people to add in alternate paths or endings after writing the main story.\nThat might make a lot more sense.\n&quot;/edit&quot;\n\n\nI hope I don't come off as &quot;pushy and negative&quot; here. If I do, don't let that fool you. I only mean to continue discussing everything. In the end, I want to do whatever will get the most people interested in participating.\n\nI don't think it's really as complicated as it sounds. To be [i:23ktfsra]super[/i:23ktfsra] clear, I would NEVER think of putting ALL those rules together at the same time for an open competition like this. Ideally, I would like to choose just [b:23ktfsra]one or two rules[/b:23ktfsra] that would create the desired effect without making things particularly complicated or hard to keep track of. For instance, I like the room count because I can just do something like &quot;okay, I get 10 rooms, so I'll do it in a house. I've got a foyer, living room, dining room, and kitchen on the first floor. That's four rooms. I'll put three bedrooms and a bathroom on the second floor, and use both a basement and an attic. Ten rooms. Now I can do whatever I want in those ten rooms.&quot; Without any other restrictions, the game could STILL get overly complex. I could have my parents and a sibling or two in the house, as many items and locked containers as I want. I could spend [i:23ktfsra]hours[/i:23ktfsra] digging through the basement, finding a monster in grandpa's old trunk, trying to get my family to believe me, finding a way into the attic with the broken pull-cord on the ladder, researching old journals with missing pages in the attic, and finally putting together a complex talisman to fight the monster. I gotta tell you, I had a LOT of fun in the two minutes it took me to come up with that just now.\n\nWhen I first came up with the idea last year, it was actually to [i:23ktfsra]help[/i:23ktfsra] me get a game made. I have a tendency to let ideas just grow bigger and bigger. Then I come up with a new idea before finishing the first one. So I said to myself, &quot;six rooms, twelve items, get it done,&quot; and I ended up making a game that I'm quite happy with.\n\nI have to admit I'm a little surprised to hear anyone say &quot;complicated rules and creativity are pretty much exclusive of each other.&quot; One of the things I love most about programming is that it combines the logical rules and absolutes of math with the creativity and flexibility of writing fiction. Figuring out the best way to make a program do what I want is part of the fun for me. Maybe it's only because I'm not actually fluent in any specific programming language, but I would certainly consider programming to be &quot;complicated rules,&quot; even with a custom IDE like Quest, and game design is definitely creativity.\n\nIt might work really well to use file size or the word count of the actual program script (which is how I understood that statement), except that I wouldn't have the foggiest idea what to set the limit [i:23ktfsra]at[/i:23ktfsra]. Plus, any time you require a word count in a program that doesn't [i:23ktfsra]come[/i:23ktfsra] with a word count, the author has to occasionally copy and past the whole thing to somewhere else to check in on the count. It's not that bad when you're just writing text, but I assume a lot of people mainly use the GUI for Quest, and they might be surprised how many lines of code are being generated while they do that.\n\nI am interested in this RPG idea, but it sounds like more of a fun long-term project than a short competition. It seems like it would be hard to keep everyone coordinated if they all had to work during the same small period of time.\n\nI'm gonna add/change some stuff in my list of ideas and the way it's written to &quot;soften&quot; it's appearance.",
      "EditableFormat": "bbcode",
      "HTML": "EDIT:<br/>I cannot believe this did not occur to me until now. <br/>Perhaps the best way to translate flash-fiction into a text-adventure comp would be to have people <br/><span style=\"font-style:italic;\">write a flash-fiction story</span> of up to approximately 1,000 words, and then turn the story into a game.<br/>Maybe we could allow people to add in alternate paths or endings after writing the main story.<br/>That might make a lot more sense.<br/>&quot;/edit&quot;<br/><br/><br/>I hope I don't come off as &quot;pushy and negative&quot; here. If I do, don't let that fool you. I only mean to continue discussing everything. In the end, I want to do whatever will get the most people interested in participating.<br/><br/>I don't think it's really as complicated as it sounds. To be <span style=\"font-style:italic;\">super</span> clear, I would NEVER think of putting ALL those rules together at the same time for an open competition like this. Ideally, I would like to choose just <span style=\"font-weight:bold;\">one or two rules</span> that would create the desired effect without making things particularly complicated or hard to keep track of. For instance, I like the room count because I can just do something like &quot;okay, I get 10 rooms, so I'll do it in a house. I've got a foyer, living room, dining room, and kitchen on the first floor. That's four rooms. I'll put three bedrooms and a bathroom on the second floor, and use both a basement and an attic. Ten rooms. Now I can do whatever I want in those ten rooms.&quot; Without any other restrictions, the game could STILL get overly complex. I could have my parents and a sibling or two in the house, as many items and locked containers as I want. I could spend <span style=\"font-style:italic;\">hours</span> digging through the basement, finding a monster in grandpa's old trunk, trying to get my family to believe me, finding a way into the attic with the broken pull-cord on the ladder, researching old journals with missing pages in the attic, and finally putting together a complex talisman to fight the monster. I gotta tell you, I had a LOT of fun in the two minutes it took me to come up with that just now.<br/><br/>When I first came up with the idea last year, it was actually to <span style=\"font-style:italic;\">help</span> me get a game made. I have a tendency to let ideas just grow bigger and bigger. Then I come up with a new idea before finishing the first one. So I said to myself, &quot;six rooms, twelve items, get it done,&quot; and I ended up making a game that I'm quite happy with.<br/><br/>I have to admit I'm a little surprised to hear anyone say &quot;complicated rules and creativity are pretty much exclusive of each other.&quot; One of the things I love most about programming is that it combines the logical rules and absolutes of math with the creativity and flexibility of writing fiction. Figuring out the best way to make a program do what I want is part of the fun for me. Maybe it's only because I'm not actually fluent in any specific programming language, but I would certainly consider programming to be &quot;complicated rules,&quot; even with a custom IDE like Quest, and game design is definitely creativity.<br/><br/>It might work really well to use file size or the word count of the actual program script (which is how I understood that statement), except that I wouldn't have the foggiest idea what to set the limit <span style=\"font-style:italic;\">at</span>. Plus, any time you require a word count in a program that doesn't <span style=\"font-style:italic;\">come</span> with a word count, the author has to occasionally copy and past the whole thing to somewhere else to check in on the count. It's not that bad when you're just writing text, but I assume a lot of people mainly use the GUI for Quest, and they might be surprised how many lines of code are being generated while they do that.<br/><br/>I am interested in this RPG idea, but it sounds like more of a fun long-term project than a short competition. It seems like it would be hard to keep everyone coordinated if they all had to work during the same small period of time.<br/><br/>I'm gonna add/change some stuff in my list of ideas and the way it's written to &quot;soften&quot; it's appearance.",
      "PostDate": "2013-12-08T07:04:51+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27052",
      "UserId": 0,
      "Username": "george",
      "UserAvatar": null,
      "UserGravatar": "dc6fe8e6172303d85249a13c9a49c1ff",
      "EditableText": "I'm of the same mind about the RPG thing. I would like to do it, but probably not for this compo. \n\nTriangle, I just saw your edit about the flash fiction idea. I like it, and while maybe it would be outside some people's interest (?), as I imagine some folks here are more interested in the straight game-making side of things than normal fiction, 1000 words isn't very much and it wouldn't have to be amazing prose after all. \n\nIt also opens up the possibility of what I think is an interesting idea, that people could write the stories but not make a game out of it themselves. Others could be free to choose stories that had been written to make their game. That might be a way to invite participation from outside the Quest forums, and also help out Questers who don't have an idea immediately for the comp. You could run the comp in two stages, a short time for writing the fiction, and then the second stage for making the games.",
      "EditableFormat": "bbcode",
      "HTML": "I'm of the same mind about the RPG thing. I would like to do it, but probably not for this compo. <br/><br/>Triangle, I just saw your edit about the flash fiction idea. I like it, and while maybe it would be outside some people's interest (?), as I imagine some folks here are more interested in the straight game-making side of things than normal fiction, 1000 words isn't very much and it wouldn't have to be amazing prose after all. <br/><br/>It also opens up the possibility of what I think is an interesting idea, that people could write the stories but not make a game out of it themselves. Others could be free to choose stories that had been written to make their game. That might be a way to invite participation from outside the Quest forums, and also help out Questers who don't have an idea immediately for the comp. You could run the comp in two stages, a short time for writing the fiction, and then the second stage for making the games.",
      "PostDate": "2013-12-08T18:16:56+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27053",
      "UserId": 0,
      "Username": "tbritton",
      "UserAvatar": null,
      "UserGravatar": "aa3d953baab30b778c1351a982d82eb8",
      "EditableText": "[quote=&quot;TriangleGames&quot;:15kh5uv7]I have to admit I'm a little surprised to hear anyone say &quot;complicated rules and creativity are pretty much exclusive of each other.&quot; One of the things I love most about programming is that it combines the logical rules and absolutes of math with the creativity and flexibility of writing fiction. Figuring out the best way to make a program do what I want is part of the fun for me. Maybe it's only because I'm not actually fluent in any specific programming language, but I would certainly consider programming to be &quot;complicated rules,&quot; even with a custom IDE like Quest, and game design is definitely creativity.[/quote:15kh5uv7]\n\nI think you misread my statement, I was not talking about programming rules.  Also, the attitude is really not conducive to any type of discussion, of course at this point it's become pretty clear to me that this is not really about having a discussion.  In any case, I think I'll just pass on QuestComp.",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><cite>TriangleGames wrote:</cite>I have to admit I'm a little surprised to hear anyone say &quot;complicated rules and creativity are pretty much exclusive of each other.&quot; One of the things I love most about programming is that it combines the logical rules and absolutes of math with the creativity and flexibility of writing fiction. Figuring out the best way to make a program do what I want is part of the fun for me. Maybe it's only because I'm not actually fluent in any specific programming language, but I would certainly consider programming to be &quot;complicated rules,&quot; even with a custom IDE like Quest, and game design is definitely creativity.</blockquote><br/><br/>I think you misread my statement, I was not talking about programming rules.  Also, the attitude is really not conducive to any type of discussion, of course at this point it's become pretty clear to me that this is not really about having a discussion.  In any case, I think I'll just pass on QuestComp.",
      "PostDate": "2013-12-08T19:58:45+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27054",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "Triangle, I think what tbritton is saying is that the more complicated the rules you include, the less likely people are to enter the comp. Look at the biggest comp of them all, the IFComp, and how many years it's been running and how successful it's been, yet its rules are relatively simple and that's what appeals to people. Nothing is more likely to stifle creativity than having to tailor your game to a set of rules like the ones suggested in this thread.",
      "EditableFormat": "bbcode",
      "HTML": "Triangle, I think what tbritton is saying is that the more complicated the rules you include, the less likely people are to enter the comp. Look at the biggest comp of them all, the IFComp, and how many years it's been running and how successful it's been, yet its rules are relatively simple and that's what appeals to people. Nothing is more likely to stifle creativity than having to tailor your game to a set of rules like the ones suggested in this thread.",
      "PostDate": "2013-12-08T20:37:01+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27055",
      "UserId": 0,
      "Username": "TriangleGames",
      "UserAvatar": null,
      "UserGravatar": "134d9e995777da65c5cf8efda551d579",
      "EditableText": "It seems I did misread your statement, tbritton, sorry about that.\n\nTo clarify, this new plan of having people use flash-fiction stories as a rough outline for a game would mean that [b:4em2lxhv][i:4em2lxhv]NONE[/i:4em2lxhv][/b:4em2lxhv] of those other rules I had suggested in my ideas list would be needed. So, people write flash-fiction stories, and then people use the stories as the basis of their games, no other rules needed, aside from the legal stuff (i.e. &quot;don't violate copyrights,&quot; etc.). Like george said, the stories don't need to be particularly well written, since they will really just serve as an outline (of course, if people [i:4em2lxhv]wanted[/i:4em2lxhv] to write really eloquent prose, there would be no reason they couldn't), and if people want to add additional paths or alternate endings during game design, that would be fine.\n\nFor the idea of having designers use stories written by other people, I've heard of things like that before, but I've never participated in any. Are the match-ups usually treated as one game to one story, or can multiple designers choose the same story? If it's one-to-one then we'd need to make sure it was organized somehow. If it doesn't matter, than we could just put up the stories and let people do what they want. My only concern is that some people might prefer to use their own story. Do you think it would ruin the idea if we left designers the [i:4em2lxhv]option[/i:4em2lxhv] to use their own? BTW, I understood the plan to suggest that the stories could be written by anyone, including both people planning to make a game and people who just feel like contributing a story without making a game. Is that right?",
      "EditableFormat": "bbcode",
      "HTML": "It seems I did misread your statement, tbritton, sorry about that.<br/><br/>To clarify, this new plan of having people use flash-fiction stories as a rough outline for a game would mean that <span style=\"font-weight:bold;\"><span style=\"font-style:italic;\">NONE</span></span> of those other rules I had suggested in my ideas list would be needed. So, people write flash-fiction stories, and then people use the stories as the basis of their games, no other rules needed, aside from the legal stuff (i.e. &quot;don't violate copyrights,&quot; etc.). Like george said, the stories don't need to be particularly well written, since they will really just serve as an outline (of course, if people <span style=\"font-style:italic;\">wanted</span> to write really eloquent prose, there would be no reason they couldn't), and if people want to add additional paths or alternate endings during game design, that would be fine.<br/><br/>For the idea of having designers use stories written by other people, I've heard of things like that before, but I've never participated in any. Are the match-ups usually treated as one game to one story, or can multiple designers choose the same story? If it's one-to-one then we'd need to make sure it was organized somehow. If it doesn't matter, than we could just put up the stories and let people do what they want. My only concern is that some people might prefer to use their own story. Do you think it would ruin the idea if we left designers the <span style=\"font-style:italic;\">option</span> to use their own? BTW, I understood the plan to suggest that the stories could be written by anyone, including both people planning to make a game and people who just feel like contributing a story without making a game. Is that right?",
      "PostDate": "2013-12-09T00:48:31+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27057",
      "UserId": 0,
      "Username": "george",
      "UserAvatar": null,
      "UserGravatar": "dc6fe8e6172303d85249a13c9a49c1ff",
      "EditableText": "[quote=&quot;TriangleGames&quot;:1iqd9ffg]\nFor the idea of having designers use stories written by other people, I've heard of things like that before, but I've never participated in any. Are the match-ups usually treated as one game to one story, or can multiple designers choose the same story? If it's one-to-one then we'd need to make sure it was organized somehow. If it doesn't matter, than we could just put up the stories and let people do what they want. My only concern is that some people might prefer to use their own story. Do you think it would ruin the idea if we left designers the [i:1iqd9ffg]option[/i:1iqd9ffg] to use their own? BTW, I understood the plan to suggest that the stories could be written by anyone, including both people planning to make a game and people who just feel like contributing a story without making a game. Is that right?[/quote:1iqd9ffg]\n\nYep, you've got the gist of it. I imagine it running it like the Cover Stories comp (<!-- m --><a class=\"postlink\" href=\"http://www.intfiction.org/forum/viewtopic.php?f=23&amp;t=4917\">http://www.intfiction.org/forum/viewtop ... =23&amp;t=4917</a><!-- m --> ). \n\n* I'm thinking one game to one story. Since I think it's considerably easier to write 1000 words than even a short complete text adventure, I'm guessing that'll work. \n\n* Yes, I think authors can use their own story, it seems the most practical. \n\n* And yes, anyone can write a story, and anyone can make a game, and you could do both.\n\n* Also in addition to alternative endings/paths I think we could allow some broader interpretation of a story to fit the game design, so it doesn't have to be a point-for-point retelling of the story in game form.",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><cite>TriangleGames wrote:</cite><br/>For the idea of having designers use stories written by other people, I've heard of things like that before, but I've never participated in any. Are the match-ups usually treated as one game to one story, or can multiple designers choose the same story? If it's one-to-one then we'd need to make sure it was organized somehow. If it doesn't matter, than we could just put up the stories and let people do what they want. My only concern is that some people might prefer to use their own story. Do you think it would ruin the idea if we left designers the <span style=\"font-style:italic;\">option</span> to use their own? BTW, I understood the plan to suggest that the stories could be written by anyone, including both people planning to make a game and people who just feel like contributing a story without making a game. Is that right?</blockquote><br/><br/>Yep, you've got the gist of it. I imagine it running it like the Cover Stories comp (<!-- m --><a class=\"postlink\" href=\"http://www.intfiction.org/forum/viewtopic.php?f=23&amp;t=4917\">http://www.intfiction.org/forum/viewtop ... =23&amp;t=4917</a><!-- m --> ). <br/><br/>* I'm thinking one game to one story. Since I think it's considerably easier to write 1000 words than even a short complete text adventure, I'm guessing that'll work. <br/><br/>* Yes, I think authors can use their own story, it seems the most practical. <br/><br/>* And yes, anyone can write a story, and anyone can make a game, and you could do both.<br/><br/>* Also in addition to alternative endings/paths I think we could allow some broader interpretation of a story to fit the game design, so it doesn't have to be a point-for-point retelling of the story in game form.",
      "PostDate": "2013-12-09T02:17:51+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27060",
      "UserId": 0,
      "Username": "TriangleGames",
      "UserAvatar": null,
      "UserGravatar": "134d9e995777da65c5cf8efda551d579",
      "EditableText": "That seems reasonable. I'll have to work out organizing the &quot;claims process&quot; (suggestions welcome, lol). The Cover Stories comp does seem to work fairly similar, so I might even ask maga if I can kidnap some the text from those guidelines. It all pretty much adds up to &quot;use the thing you pick,&quot; but it does a good job clarifying that with some detail.\n\nSo, yes, designers may essentially take as much &quot;artistic license&quot; as they want in crafting the game, so long as the story is recognizable. I am reminded, at this moment, that &quot;Westside Story&quot; is actually &quot;Romeo and Juliet&quot; and that the 80's sci-fi/romantic comedy &quot;Electric Dreams&quot; claims to be based on the same book as &quot;Bladerunner.&quot; ... Ah, whatever. Artistic license, ahoy!\n\nSo, with that plan, is there any reason to add in another sort of theme/genre requirement? It kind of seems superfluous at this point.",
      "EditableFormat": "bbcode",
      "HTML": "That seems reasonable. I'll have to work out organizing the &quot;claims process&quot; (suggestions welcome, lol). The Cover Stories comp does seem to work fairly similar, so I might even ask maga if I can kidnap some the text from those guidelines. It all pretty much adds up to &quot;use the thing you pick,&quot; but it does a good job clarifying that with some detail.<br/><br/>So, yes, designers may essentially take as much &quot;artistic license&quot; as they want in crafting the game, so long as the story is recognizable. I am reminded, at this moment, that &quot;Westside Story&quot; is actually &quot;Romeo and Juliet&quot; and that the 80's sci-fi/romantic comedy &quot;Electric Dreams&quot; claims to be based on the same book as &quot;Bladerunner.&quot; ... Ah, whatever. Artistic license, ahoy!<br/><br/>So, with that plan, is there any reason to add in another sort of theme/genre requirement? It kind of seems superfluous at this point.",
      "PostDate": "2013-12-09T19:22:19+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27066",
      "UserId": 0,
      "Username": "TriangleGames",
      "UserAvatar": null,
      "UserGravatar": "134d9e995777da65c5cf8efda551d579",
      "EditableText": "[b:3mc795ub]UPDATE:[/b:3mc795ub]\nLast night I set up a gmail account and a blog for QuestComp.\nThe blog can be used for putting up the stories that are submitted and letting designers claim them via comments,\nmuch like the Cover Stories comp.\nThe e-mail account is used to access the blog. So if someone else takes over as organizer in the future,\ncontrol of both can be easily passed on for consistency year to year.\n\nThe e-mail is:\n<!-- e --><a href=\"mailto:questcomporganizer@gmail.com\">questcomporganizer@gmail.com</a><!-- e -->\n(sorry it's kind of long, so is the story about how I ended up with it...)\n\nThe blog is:\n[url:3mc795ub]http&#58;//questcomp&#46;blogspot&#46;com/[/url:3mc795ub]",
      "EditableFormat": "bbcode",
      "HTML": "<span style=\"font-weight:bold;\">UPDATE:</span><br/>Last night I set up a gmail account and a blog for QuestComp.<br/>The blog can be used for putting up the stories that are submitted and letting designers claim them via comments,<br/>much like the Cover Stories comp.<br/>The e-mail account is used to access the blog. So if someone else takes over as organizer in the future,<br/>control of both can be easily passed on for consistency year to year.<br/><br/>The e-mail is:<br/><!-- e --><a href=\"mailto:questcomporganizer@gmail.com\">questcomporganizer@gmail.com</a><!-- e --><br/>(sorry it's kind of long, so is the story about how I ended up with it...)<br/><br/>The blog is:<br/><a href=\"http&#58;//questcomp&#46;blogspot&#46;com/\" rel=\"nofollow\">http&#58;//questcomp&#46;blogspot&#46;com/</a>",
      "PostDate": "2013-12-10T14:58:38+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27143",
      "UserId": 0,
      "Username": "TriangleGames",
      "UserAvatar": null,
      "UserGravatar": "134d9e995777da65c5cf8efda551d579",
      "EditableText": "[size=150:13ase3p0]This is NOT the official announcement.[/size:13ase3p0]\nThis is a sample, which I am putting up to ask if anyone feels there is anything that needs to be changed, removed, corrected or clarified. Your feedback is appreciated.\n\n[quote:13ase3p0]Quest Comp 2014\nWelcome to QuestComp 2014, the second annual Quest exclusive IF competition!\nJoin the adventure, and be a Questing hero!\n\nThe QuestComp organiser is Evan Williams. The competition is being set up and can be discussed in \nthe QuestComp forum thread.\n\nTo declare your intent to enter or to submit a story or game entry, please contact \n<!-- e --><a href=\"mailto:questcomporganizer@google.com\">questcomporganizer@google.com</a><!-- e -->. (Sorry about the american &quot;z&quot; ;)\n\nCompetition Overview\nThis year's theme is flash fiction. We'll be asking for story submissions in flash fiction format \nof up to 1,000 words. Entrants will then choose a story to adapt into a game.\nLike the classic hero, your reward will be honor, respect and glory.\nFortune smiles upon thee! There is also no entrance fee.\n\nDates\nApril 8: Deadline for flash fiction story submissions\nApril 10: Stories will be posted, entrants may claim stories and begin game design\nJune 1: Deadline for game entrants to declare intent to enter\nJuly 1: Deadline for submitting finished games\n\nGuidelines for story writers\n * Anyone may submit a story, regardless of whether they intend to enter a game\n * Stories are to be written as flash fiction of up to 1,000 words. Flash fictions are complete \nstories with a beginning, a middle, and an end, conflict, obstacles, etc. If you have any doubts \nabout what constitutes flash fiction, please ask the organiser or go here:\n<!-- m --><a class=\"postlink\" href=\"http://en.wikipedia.org/wiki/Flash_fiction\">http://en.wikipedia.org/wiki/Flash_fiction</a><!-- m -->\n * Submit stories as plain text, the organiser will need to post them to the QuestComp blog for \nviewing and claims.\n * Please submit your own work only. Do not submit interesting stories you found.\n * The game designers (entrants) will be given artistic license to modify your story as they see \nfit, as long as they credit you appropriately. No takebacks.\n * You can submit as many stories as you like; we want entrants to have plenty of options.\n * There is no quality standard. You can submit stories even if you don't think of yourself as a  \ngood writer.\n * There is, of course, no guarantee that your story will be used! So try to write something that \nis compelling and evocative.\n * Entrants and writers are allowed to communicate, ask questions, make clarifications, etc. but \nthere's no commitment for either to do so, and they should do so directly rather than via the \norganiser.\n\nRules For Entrants And Submissions\n * Anyone may enter a game, regardless of whether they submitted a story\n * All entrants must declare their intent to compete no later than June 1.\n * Each entrant should submit one(1) game only, no later than July 1.\n * Entrants are not to discuss the contents of their game publicly during the judging period.\n * Stories will be posted here: <!-- m --><a class=\"postlink\" href=\"http://questcomp.blogspot.com/\">http://questcomp.blogspot.com/</a><!-- m -->\n * You claim a story by leaving a comment on it containing the word CLAIMED and your name. You do \nnot need to register an account for this, but anonymous comments require word verification.\n * Claiming relates one author to one story: you cannot claim an already-claimed story, nor can \nyou claim a second story. First come, first served.\n * Don't hog the stories. Don't pick a story unless you are sure you want to use it. It will be \nextremely lame if you grab the coolest story before you have any idea about the game, then realise \nthat you're stuck for ideas: then nobody gets to use that story! So be considerate, and don't rush \nin headlong.\n * Your chosen story should be more than a vague inspiration. While you have full artistic license \nto make any changes you wish, remember that this is an adaptation from story to game. You may \nwrite a new ending, change the title, add or remove supporting characters and conflicts, etc, but \nnot to such a degree that the audience cannot recognise the story.\n * Credit the writer/contributor clearly (nicely is always good form as well).\n - Entrants who also submitted a story may claim their own story.\n - It is recommended that you test how well your game works when played online – you can upload a \ngame to the site and set visibility to “unlisted” for testing.\n\nRules For Judges\n * Judges are encouraged to play each game as long as they want and try to finish each one. \nHowever, they are not required to finish before voting (especially if the game takes more than \nabout 1-1/2 to 2 hours).\n * Judges should vote on at least two games.\n * Anyone may judge.\n * Games should be scored on a 1 to 10 scale, 10 being best.\n * Judges may discuss the games during the judging period, but should clearly mark posts/topics, \nfor the benefit of those who want to avoid spoilers.\n * Beta-testers are allowed to vote on the entries they beta-tested.\n\nLegal\n * While “freeware” multimedia is permissible, entrants assume personal responsibility for the \ncontents of their games and may be disqualified if any copyrighted material is used without \nconsent from the owner.\n * Entrants grant the competition and textadventures.co.uk the non-exclusive right to distribute \nyour game for free.\n[/quote:13ase3p0]",
      "EditableFormat": "bbcode",
      "HTML": "<span style=\"font-size:150\">This is NOT the official announcement.</span><br/>This is a sample, which I am putting up to ask if anyone feels there is anything that needs to be changed, removed, corrected or clarified. Your feedback is appreciated.<br/><br/><blockquote><p>Quest Comp 2014<br/>Welcome to QuestComp 2014, the second annual Quest exclusive IF competition!<br/>Join the adventure, and be a Questing hero!<br/><br/>The QuestComp organiser is Evan Williams. The competition is being set up and can be discussed in <br/>the QuestComp forum thread.<br/><br/>To declare your intent to enter or to submit a story or game entry, please contact <br/><!-- e --><a href=\"mailto:questcomporganizer@google.com\">questcomporganizer@google.com</a><!-- e -->. (Sorry about the american &quot;z&quot; ;)<br/><br/>Competition Overview<br/>This year's theme is flash fiction. We'll be asking for story submissions in flash fiction format <br/>of up to 1,000 words. Entrants will then choose a story to adapt into a game.<br/>Like the classic hero, your reward will be honor, respect and glory.<br/>Fortune smiles upon thee! There is also no entrance fee.<br/><br/>Dates<br/>April 8: Deadline for flash fiction story submissions<br/>April 10: Stories will be posted, entrants may claim stories and begin game design<br/>June 1: Deadline for game entrants to declare intent to enter<br/>July 1: Deadline for submitting finished games<br/><br/>Guidelines for story writers<br/> * Anyone may submit a story, regardless of whether they intend to enter a game<br/> * Stories are to be written as flash fiction of up to 1,000 words. Flash fictions are complete <br/>stories with a beginning, a middle, and an end, conflict, obstacles, etc. If you have any doubts <br/>about what constitutes flash fiction, please ask the organiser or go here:<br/><!-- m --><a class=\"postlink\" href=\"http://en.wikipedia.org/wiki/Flash_fiction\">http://en.wikipedia.org/wiki/Flash_fiction</a><!-- m --><br/> * Submit stories as plain text, the organiser will need to post them to the QuestComp blog for <br/>viewing and claims.<br/> * Please submit your own work only. Do not submit interesting stories you found.<br/> * The game designers (entrants) will be given artistic license to modify your story as they see <br/>fit, as long as they credit you appropriately. No takebacks.<br/> * You can submit as many stories as you like; we want entrants to have plenty of options.<br/> * There is no quality standard. You can submit stories even if you don't think of yourself as a  <br/>good writer.<br/> * There is, of course, no guarantee that your story will be used! So try to write something that <br/>is compelling and evocative.<br/> * Entrants and writers are allowed to communicate, ask questions, make clarifications, etc. but <br/>there's no commitment for either to do so, and they should do so directly rather than via the <br/>organiser.<br/><br/>Rules For Entrants And Submissions<br/> * Anyone may enter a game, regardless of whether they submitted a story<br/> * All entrants must declare their intent to compete no later than June 1.<br/> * Each entrant should submit one(1) game only, no later than July 1.<br/> * Entrants are not to discuss the contents of their game publicly during the judging period.<br/> * Stories will be posted here: <!-- m --><a class=\"postlink\" href=\"http://questcomp.blogspot.com/\">http://questcomp.blogspot.com/</a><!-- m --><br/> * You claim a story by leaving a comment on it containing the word CLAIMED and your name. You do <br/>not need to register an account for this, but anonymous comments require word verification.<br/> * Claiming relates one author to one story: you cannot claim an already-claimed story, nor can <br/>you claim a second story. First come, first served.<br/> * Don't hog the stories. Don't pick a story unless you are sure you want to use it. It will be <br/>extremely lame if you grab the coolest story before you have any idea about the game, then realise <br/>that you're stuck for ideas: then nobody gets to use that story! So be considerate, and don't rush <br/>in headlong.<br/> * Your chosen story should be more than a vague inspiration. While you have full artistic license <br/>to make any changes you wish, remember that this is an adaptation from story to game. You may <br/>write a new ending, change the title, add or remove supporting characters and conflicts, etc, but <br/>not to such a degree that the audience cannot recognise the story.<br/> * Credit the writer/contributor clearly (nicely is always good form as well).<br/> - Entrants who also submitted a story may claim their own story.<br/> - It is recommended that you test how well your game works when played online – you can upload a <br/>game to the site and set visibility to “unlisted” for testing.<br/><br/>Rules For Judges<br/> * Judges are encouraged to play each game as long as they want and try to finish each one. <br/>However, they are not required to finish before voting (especially if the game takes more than <br/>about 1-1/2 to 2 hours).<br/> * Judges should vote on at least two games.<br/> * Anyone may judge.<br/> * Games should be scored on a 1 to 10 scale, 10 being best.<br/> * Judges may discuss the games during the judging period, but should clearly mark posts/topics, <br/>for the benefit of those who want to avoid spoilers.<br/> * Beta-testers are allowed to vote on the entries they beta-tested.<br/><br/>Legal<br/> * While “freeware” multimedia is permissible, entrants assume personal responsibility for the <br/>contents of their games and may be disqualified if any copyrighted material is used without <br/>consent from the owner.<br/> * Entrants grant the competition and textadventures.co.uk the non-exclusive right to distribute <br/>your game for free.<br/></p></blockquote>",
      "PostDate": "2013-12-18T15:21:54+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27144",
      "UserId": 0,
      "Username": "george",
      "UserAvatar": null,
      "UserGravatar": "dc6fe8e6172303d85249a13c9a49c1ff",
      "EditableText": "Just one piece of feedback, maybe link to the full rules instead of putting them in the announcement post? I think a shorter announcement will be easier to digest at first read, then if someone is interested they can click through.",
      "EditableFormat": "bbcode",
      "HTML": "Just one piece of feedback, maybe link to the full rules instead of putting them in the announcement post? I think a shorter announcement will be easier to digest at first read, then if someone is interested they can click through.",
      "PostDate": "2013-12-18T16:07:05+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27145",
      "UserId": 0,
      "Username": "TriangleGames",
      "UserAvatar": null,
      "UserGravatar": "134d9e995777da65c5cf8efda551d579",
      "EditableText": "That's a good plan. I can use the blog to post up the full rules, maybe in &quot;phases&quot; like cover comp was, or just put them into a fresh forum topic at launch.\nBefore all this gets set in stone, I did have ONE more idea this morning that I feel I ought to offer up.\nThe original idea was for game authors to &quot;design the IF equivalent of literary flash fiction,&quot;\nbut what that meant was a hard question,\nand trying to define it led to making rules that were not well received.\nWhat if instead of the competition rules defining it, and making authors conform to it,\nthe authors were asked, &quot;how would YOU adapt the flash fiction concept to game design?&quot;\nSo that letting the authors come up with their own interpretation would be the focus.\nThen people could do anything they want, and maybe express in comments or the game description how they decided to answer that question. It's just a last minute thought. Unless I get a bunch of people going, &quot;ooh, yeah! do that!&quot; then I'll just proceed with the plan we have.",
      "EditableFormat": "bbcode",
      "HTML": "That's a good plan. I can use the blog to post up the full rules, maybe in &quot;phases&quot; like cover comp was, or just put them into a fresh forum topic at launch.<br/>Before all this gets set in stone, I did have ONE more idea this morning that I feel I ought to offer up.<br/>The original idea was for game authors to &quot;design the IF equivalent of literary flash fiction,&quot;<br/>but what that meant was a hard question,<br/>and trying to define it led to making rules that were not well received.<br/>What if instead of the competition rules defining it, and making authors conform to it,<br/>the authors were asked, &quot;how would YOU adapt the flash fiction concept to game design?&quot;<br/>So that letting the authors come up with their own interpretation would be the focus.<br/>Then people could do anything they want, and maybe express in comments or the game description how they decided to answer that question. It's just a last minute thought. Unless I get a bunch of people going, &quot;ooh, yeah! do that!&quot; then I'll just proceed with the plan we have.",
      "PostDate": "2013-12-18T16:57:39+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27146",
      "UserId": 0,
      "Username": "george",
      "UserAvatar": null,
      "UserGravatar": "dc6fe8e6172303d85249a13c9a49c1ff",
      "EditableText": "If the authors are adapting flash-fiction stories, maybe the IF will just naturally turn into flash-fiction IF? In other words, I guess I'm agreeing with this idea -- if you say, &quot;QuestComp 2104 is about adapting flash-fiction stories into IF games&quot;, maybe it all sort of falls out naturally with no other rules?",
      "EditableFormat": "bbcode",
      "HTML": "If the authors are adapting flash-fiction stories, maybe the IF will just naturally turn into flash-fiction IF? In other words, I guess I'm agreeing with this idea -- if you say, &quot;QuestComp 2104 is about adapting flash-fiction stories into IF games&quot;, maybe it all sort of falls out naturally with no other rules?",
      "PostDate": "2013-12-19T04:26:45+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27147",
      "UserId": 0,
      "Username": "TriangleGames",
      "UserAvatar": null,
      "UserGravatar": "134d9e995777da65c5cf8efda551d579",
      "EditableText": "Well, I'm definitely not planning to impose any design structure rules WITH story adaptation, that would be too much, but what I'm getting at now is that if people have any problems with the story adaptation in itself, I'd be willing to fall back to nothing more than a general suggestion of &quot;do whatever you think flash fiction means, with no rules.&quot; Basically, I'm just checking to make sure no one objects to story adaptation.",
      "EditableFormat": "bbcode",
      "HTML": "Well, I'm definitely not planning to impose any design structure rules WITH story adaptation, that would be too much, but what I'm getting at now is that if people have any problems with the story adaptation in itself, I'd be willing to fall back to nothing more than a general suggestion of &quot;do whatever you think flash fiction means, with no rules.&quot; Basically, I'm just checking to make sure no one objects to story adaptation.",
      "PostDate": "2013-12-19T10:01:23+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "28020",
      "UserId": 0,
      "Username": "sgreig",
      "UserAvatar": null,
      "UserGravatar": "9117185af66d72729b195384e3a446f0",
      "EditableText": "So is this still going on or is it dead in the water? I just tried to send an intent to enter email to the address in this thread and it bounced and there's been no activity in this thread since December.",
      "EditableFormat": "bbcode",
      "HTML": "So is this still going on or is it dead in the water? I just tried to send an intent to enter email to the address in this thread and it bounced and there's been no activity in this thread since December.",
      "PostDate": "2014-03-01T07:54:31+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "28025",
      "UserId": 0,
      "Username": "george",
      "UserAvatar": null,
      "UserGravatar": "dc6fe8e6172303d85249a13c9a49c1ff",
      "EditableText": "I hope it's still on. If you're looking for a comp for short games there's also ShuffleComp over at Intfiction (still in planning I think). \n\n<!-- m --><a class=\"postlink\" href=\"http://www.intfiction.org/forum/viewtopic.php?f=23&amp;t=11560\">http://www.intfiction.org/forum/viewtop ... 23&amp;t=11560</a><!-- m -->",
      "EditableFormat": "bbcode",
      "HTML": "I hope it's still on. If you're looking for a comp for short games there's also ShuffleComp over at Intfiction (still in planning I think). <br/><br/><!-- m --><a class=\"postlink\" href=\"http://www.intfiction.org/forum/viewtopic.php?f=23&amp;t=11560\">http://www.intfiction.org/forum/viewtop ... 23&amp;t=11560</a><!-- m -->",
      "PostDate": "2014-03-01T19:43:03+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "28563",
      "UserId": 0,
      "Username": "TriangleGames",
      "UserAvatar": null,
      "UserGravatar": "134d9e995777da65c5cf8efda551d579",
      "EditableText": "I have received at least one intent letter.\nI have updated the blog to reflect changes.\n[url:f3uwv8h3]http&#58;//questcomp&#46;blogspot&#46;com/2014/04/quest-comp-2014-re-mapping&#46;html[/url:f3uwv8h3]",
      "EditableFormat": "bbcode",
      "HTML": "I have received at least one intent letter.<br/>I have updated the blog to reflect changes.<br/><a href=\"http&#58;//questcomp&#46;blogspot&#46;com/2014/04/quest-comp-2014-re-mapping&#46;html\" rel=\"nofollow\">http&#58;//questcomp&#46;blogspot&#46;com/2014/04/quest-comp-2014-re-mapping&#46;html</a>",
      "PostDate": "2014-04-23T17:12:15+01:00",
      "LastEditDate": null
    }
  ]
}
