{
  "Topic": {
    "TopicId": "0huy-c5takasf2jjhnr7va",
    "ForumId": "20",
    "Title": "About Quest (A Collection of Blog Posts by Alex Warren and The Pixie)",
    "LastUpdated": "2021-04-28T12:49:37.3615139Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "2183d007-5d79-442f-8acf-7a1abb3f1f92",
      "UserId": 518866,
      "Username": "K.V.",
      "AvatarUrl": "https://secure.gravatar.com/avatar/a97688aadc8152436180b511021e94a7?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "# Quest is 15\r\n7 November 2013\r\n\r\n<div class=\"text-muted\">This post was originally published on the <a href=\"http://blog.textadventures.co.uk/2013/11/07/quest-is-15/\">textadventures.co.uk blog</a>.</div>\r\n<br/>\r\nQuest is 15 years old today! I posted the <a href=\"https://groups.google.com/d/msg/rec.arts.int-fiction/EP4N9x3fBs4/iznybxPCt4sJ\">announcement of Quest 1.0</a> on the rec.arts.int-fiction newsgroup on Saturday 7th November 1998. (And the original link in that post still gets you to the right place today, eventually)</p>\r\n\r\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-10-quest1.png\"><img class=\"aligncenter size-full wp-image-2427\" src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-10-quest1.png\" alt=\"Quest 1.0\" width=\"361\" height=\"145\" /></a></p>\r\n\r\n<p>So Quest is itself now almost as old as I was when I started writing it. But what got me started on it in the first place?</p>\r\n\r\n<p>You’re probably expecting me to say something like this… I’d been interested in text adventure games since their heyday in the 1980s. On my family’s home computer, I got hooked by classic games like <em>Zork</em>, <em>Hitchhiker’s Guide To The Galaxy</em> and <em>Planetfall.</em> Such wonderful worlds of the imagination! Such crafty puzzles! I would spend hours drawing maps on squared paper and looking out for grues and giving myself eye strain and…</p>\r\n\r\n<p>Well, no. That’s not how it happened. I never played any of those. In fact, I was never really into text adventures at all.</p>\r\n\r\n<p>But then, they were before my time. I was just a bit too young. I first dabbled with a computer in, oh, about 1990 or so. We had an <a href=\"https://en.wikipedia.org/wiki/Acorn_Electron\">Acorn Electron</a> in our house. We <em>did</em> have a couple of text adventures for that - we had a copy of <a href=\"https://en.wikipedia.org/wiki/Acornsoft\">Acornsoft</a>’s <a href=\"http://www.acornelectron.co.uk/info/acornsoft/i-sphi.html\">Sphinx Adventure</a> (never really played it, couldn’t get anywhere, found it boring) and my dad had typed in the listing of a game called <a href=\"http://solutionarchive.com/game/id,2310/\">Necromancer</a> from <a href=\"http://www.acornelectron.co.uk/mags/eu/top_lvl.html\">Electron User</a> magazine. Which never quite worked properly, as something had been mis-typed somewhere along the line.</p>\r\n\r\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-necromancer.gif\"><img class=\"aligncenter size-full wp-image-2460\" src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-necromancer.gif\" alt=\"Necromancer\" width=\"320\" height=\"256\" /></a></p>\r\n\r\n<p>So I was just never that interested in text adventures. I was more into playing whatever shareware games had found their way onto my PC - <em>Commander Keen</em>, <em>Wolfenstein</em>, <em>Doom</em> and so on. But what I was much more interested in was creating my own. I probably spent more time in front of <a href=\"https://en.wikipedia.org/wiki/QBasic\">QBasic</a> than any game. And that is where it all begins, really.</p>\r\n\r\n<p><strong>Schoolboy Humour</strong></p>\r\n\r\n<p>In 1994, at the age of 12 I started secondary school. The IT lab there was open at lunchtime for anybody to use. So instead of running around getting exercise, or loitering somewhere else, me and my friends played around with the computers. They were probably 486s, running MS-DOS 6 and Windows 3.1. They were connected to some kind of network but there was no internet access - we’d barely heard of this internet thing anyway back then. There wasn’t a whole lot to do other than write silly little programs using QBasic (or Visual Basic 3.0, which was also installed) so that’s what we did.</p>\r\n\r\n<p>After my schoolfriend Martyn moved house and went to a different school, we kept in touch by writing letters to each other - this being a time before either of us had an email address. We would enclose 3.5” floppy disks to share our latest programming efforts. It was in fact in Martyn’s first letter, around January 1995, that he sent me a game he’d written called “<em>Sid Snibble and the Curse of the Curry Stain</em>”.</p>\r\n\r\n<p>I still have a copy, in a heavily nested folder full of archives of archives, and I can still run it today using <a href=\"http://www.qb64.net/\">QB64</a>. It looks like this:</p>\r\n\r\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-10-sid.png?w=625\"><img class=\"aligncenter size-large wp-image-2431\" src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-10-sid.png?w=625?w=625\" alt=\"Sid Snibble and the Curse of the Curry Stain\" width=\"625\" height=\"467\" /></a></p>\r\n\r\n<p>It was a text adventure, but even this had a graphical element to it - you didn’t walk around the game by typing NORTH, SOUTH etc., you moved an ASCII face around with the arrow keys. When you entered a location, you could look at things, speak to characters, pick up items and so on - all in an attempt to solve the mystery of what happened the night before, and why you woke up in the middle of the road in a strange town with a large curry stain down your shirt.</p>\r\n\r\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-10-sidbas.png?w=625\"><img class=\"aligncenter size-large wp-image-2432\" src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-10-sidbas.png?w=625?w=625\" alt=\"SID.BAS\" width=\"625\" height=\"390\" /></a></p>\r\n\r\n<p>This looked fun. I could write something like this. It would be hilarious! And so I set to work, doing what I’d always done - copying Martyn’s ideas, but doing them a lot worse.</p>\r\n\r\n<p>So, in April 1995 I wrote my first text adventure game.</p>\r\n\r\n<p>It was called… well, there’s no easy way to put this. I don’t want to rewrite history or tell a lie. I was young and the game was only for me and my friends. It was called ”<em>Where’s My Nob?!</em>”</p>\r\n\r\n<p>How I wish that weren’t true. How I wish I could sit here and tell you the story of how I poured my soul into a creative work of genius, a work of art, a literary masterpiece. With a title like that, maybe I could claim that it was an earnest work exploring gender issues. But it wasn’t. I was 12. The game was an excuse for a load of the kind of sophisticated humour that 12 year olds are known for. Featuring locations such as Dracula’s castle, a teacher’s house, a corner shop, a dairy, a Skoda dealer and Potato World.</p>\r\n\r\n<p>So, a throwaway game that should be played by nobody. But for me, a 12 year old boy who didn’t do any kind of creative writing, it was a fun thing to do that got some kind of creative juices flowing.</p>\r\n\r\n<p>[Aside: Although it’s not a work that I would ever want anybody to see - indeed, I would be absolutely horrified - I think what it <em>represents</em> is something that still persists as I develop Quest today. Specifically, although I want Quest to be a useful tool for building very high quality works of interactive fiction, there is still a need for something that allows people to create their own <em>Sid Snibble</em>s (and, er, to find their own <em>Nob</em>? I think deep down my sense of humour remains the same). To give people a way to express themselves, to allow them to develop their artistic sense, to allow them to get started, and then to improve their craft. It’s easy to be snobbish about this kind of thing, and to moan about low-quality games, but if we didn’t have bad text adventures, it’s unlikely we would have very many good ones either.]</p>\r\n\r\n<p>Anyway, back to my, er, game. I sent it to Martyn on a floppy disk together with a second one called “<em>Make Mrs Booth Friendly!</em>”, a game about my French teacher. Also on that disk, I included a terrible chatbot, “Dr Mad!” who would diagnose your illness, and a fortune teller called “Sadistic Smeg”.</p>\r\n\r\n<p>Over the following months I wrote some more text adventure games, always full of in-jokes about school, only ever written for my friends, and never to be seen by anybody else ever, certainly not now. “<em>It’s Mad!</em>”, “<em>Fantasy Land!</em>”, “<em>Park Parade Adventure!</em>” and “<em>The Town of Terror</em>”. It seems the running theme was titles with exclamation marks.</p>\r\n\r\n<p><strong>Making Text Adventures for Windows 95</strong></p>\r\n\r\n<p>Fast forward a few years to 1998, when I’d started dabbling with Visual Basic 5.0 - which meant I was no longer stuck writing programs for DOS, I could create programs for Windows instead, featuring buttons and menus and message boxes and pictures and everything. I was rather stuck for ideas though. I’d spent some time working on a virtual pet, which were all the rage back then, but wanted to try something a bit meatier. I’d just finished my GCSE exams and was looking for something to keep me occupied over the summer break before I started sixth form. I thought back to the text adventures I’d written, and wondered - what would a text adventure game for Windows look like?</p>\r\n\r\n<p>I decided to write myself a little engine before writing a game, so I wouldn’t have to hard-code everything like I’d done in QBasic. I started coding something that would take in a simple text file which would define all aspects of the game, and handle things such as allowing players to save their progress.</p>\r\n\r\n<p>It turned out that I was actually far more interested in creating the engine than I was in writing a game anyway, and I was interested to see what other people might come up with if they used my system. At the time, I was fairly ignorant of any pre-existing systems which would do a similar thing to mine, until somebody suggested I take a look at the rec.arts.int-fiction newsgroup. I started checking out the competition, and reading about <a href=\"http://inform-fiction.org/\">Inform</a> and <a href=\"http://www.tads.org/\">TADS</a>. It was clear to me that they were difficult for newcomers to use (this was before Inform had a natural language syntax - the syntax of Inform 6 still looks bizarre to me), so it looked like I should be able to get people interested in what I was doing.</p>\r\n\r\n<p>I released Quest 1.0, and it looked like this:</p>\r\n\r\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest.png\"><img class=\"aligncenter size-full wp-image-2455\" src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest.png\" alt=\"Quest 1.0 Start Screen\" width=\"391\" height=\"450\" /></a></p>\r\n\r\n<p>(Those two globes were animated and bounced back and forth between the edges of the screen. For some reason.)</p>\r\n\r\n<p>Quest 1.0 loaded text files which were in a simple format I’d devised, called ASL - Adventure Scripting Language. The syntax was simple, designed to be coded by hand using Notepad or similar - there was no visual editor yet (“QDK” appeared the following year).</p>\r\n\r\n<p>Here’s the Quest 1.0 <a href=\"http://files.textadventures.co.uk/archive/1.0/Readme.rtf\">Readme file</a> and <a href=\"http://files.textadventures.co.uk/archive/1.0/ASL.rtf\">ASL Reference</a> if you’re interested in some historical detail. You would create games by using Notepad to edit the included template.asl file, which looked like this:</p>\r\n<pre>' Quest ASL Template\r\n' All sections must exist in the game, though the text sections may be empty\r\n' if desired.\r\ndefine game &lt;Enter name of game here...&gt;\r\n    asl-version &lt;100&gt;\r\n    game version &lt;1.0&gt;\r\n    game author &lt;You&gt;\r\n    game copyright &lt;© 1998...&gt;\r\n    game info &lt;Enter game info here...&gt;\r\n    start &lt;Enter name of place here...&gt;\r\n    possitems &lt;Enter items separated by commas here...&gt;\r\n    startitems &lt;Enter start items here...&gt;\r\nend define\r\n\r\ndefine room &lt;Enter name of place here...&gt;\r\n    look &lt;Enter description here...&gt;\r\nend define\r\n\r\ndefine text &lt;intro&gt;\r\nEnter intro text here...\r\nend define\r\n\r\ndefine text &lt;win&gt;\r\nEnter win text here...\r\nend define\r\n\r\ndefine text &lt;lose&gt;\r\nEnter lose text here...\r\nend define</pre>\r\n<p>This file format lasted a long time. It was used right up until Quest 4.x, the last version of which was released in 2011 - albeit heavily extended and changed in various ways over the years.</p>\r\n\r\n<p>The empty template looks like this when loaded in Quest 1.0:</p>\r\n\r\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest-main.png?w=625\"><img class=\"aligncenter size-large wp-image-2454\" src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest-main.png?w=625?w=625\" alt=\"Quest 1.0 running a game\" width=\"625\" height=\"434\" /></a></p>\r\n\r\n<p>The user interface is still very similar to what Quest offers now - in fact, after it was rearranged in Quest 2.1 it has effectively remained an identical layout. There is the game text of course, a command box, a space to show what items you’re carrying, and a list of things you can see in the current location (which would show “Look at” and “Take” buttons if something was selected). There are also the compass buttons for easier navigation.</p>\r\n\r\n<p>Quest 1.0 supported rooms, characters, objects, things you could pick up (“items”), quantities of things (“collectables”), string variables and some basic script commands. It could play WAV files, show images and display pop-up menus. It supported text formatting, and let you set up your own custom commands using a syntax like “eat #object#” - the same format that is still used in Quest 5 today.</p>\r\n\r\n<p>There was a small sample game distributed with Quest 1.0, “<em>A day in the life of a salesman</em>”. It is of a very similar standard to my QBasic efforts - which is to say stupid, crude and borderline offensive in places. So no, you can’t have a copy, but yes, it does still run in Quest 5.4!</p>\r\n\r\n<p>What happened next? We’ll pick up the story in the next blog post, where I’ll talk about how Quest grew, changed and even shrunk over the years to become what it is today.</p>\r\n\r\n---\r\nCONTINUED IN NEXT POST",
      "EditableFormat": "markdown",
      "HTML": "<h1>Quest is 15</h1>\n<p>7 November 2013</p>\n<div>This post was originally published on the <a href=\"http://blog.textadventures.co.uk/2013/11/07/quest-is-15/\">textadventures.co.uk blog</a>.</div>\n<br>\nQuest is 15 years old today! I posted the <a href=\"https://groups.google.com/d/msg/rec.arts.int-fiction/EP4N9x3fBs4/iznybxPCt4sJ\">announcement of Quest 1.0</a> on the rec.arts.int-fiction newsgroup on Saturday 7th November 1998. (And the original link in that post still gets you to the right place today, eventually)<p></p>\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-10-quest1.png\"><img src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-10-quest1.png\" alt=\"Quest 1.0\" width=\"361\" height=\"145\"></a></p>\n<p>So Quest is itself now almost as old as I was when I started writing it. But what got me started on it in the first place?</p>\n<p>You’re probably expecting me to say something like this… I’d been interested in text adventure games since their heyday in the 1980s. On my family’s home computer, I got hooked by classic games like <em>Zork</em>, <em>Hitchhiker’s Guide To The Galaxy</em> and <em>Planetfall.</em> Such wonderful worlds of the imagination! Such crafty puzzles! I would spend hours drawing maps on squared paper and looking out for grues and giving myself eye strain and…</p>\n<p>Well, no. That’s not how it happened. I never played any of those. In fact, I was never really into text adventures at all.</p>\n<p>But then, they were before my time. I was just a bit too young. I first dabbled with a computer in, oh, about 1990 or so. We had an <a href=\"https://en.wikipedia.org/wiki/Acorn_Electron\">Acorn Electron</a> in our house. We <em>did</em> have a couple of text adventures for that - we had a copy of <a href=\"https://en.wikipedia.org/wiki/Acornsoft\">Acornsoft</a>’s <a href=\"http://www.acornelectron.co.uk/info/acornsoft/i-sphi.html\">Sphinx Adventure</a> (never really played it, couldn’t get anywhere, found it boring) and my dad had typed in the listing of a game called <a href=\"http://solutionarchive.com/game/id,2310/\">Necromancer</a> from <a href=\"http://www.acornelectron.co.uk/mags/eu/top_lvl.html\">Electron User</a> magazine. Which never quite worked properly, as something had been mis-typed somewhere along the line.</p>\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-necromancer.gif\"><img src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-necromancer.gif\" alt=\"Necromancer\" width=\"320\" height=\"256\"></a></p>\n<p>So I was just never that interested in text adventures. I was more into playing whatever shareware games had found their way onto my PC - <em>Commander Keen</em>, <em>Wolfenstein</em>, <em>Doom</em> and so on. But what I was much more interested in was creating my own. I probably spent more time in front of <a href=\"https://en.wikipedia.org/wiki/QBasic\">QBasic</a> than any game. And that is where it all begins, really.</p>\n<p><strong>Schoolboy Humour</strong></p>\n<p>In 1994, at the age of 12 I started secondary school. The IT lab there was open at lunchtime for anybody to use. So instead of running around getting exercise, or loitering somewhere else, me and my friends played around with the computers. They were probably 486s, running MS-DOS 6 and Windows 3.1. They were connected to some kind of network but there was no internet access - we’d barely heard of this internet thing anyway back then. There wasn’t a whole lot to do other than write silly little programs using QBasic (or Visual Basic 3.0, which was also installed) so that’s what we did.</p>\n<p>After my schoolfriend Martyn moved house and went to a different school, we kept in touch by writing letters to each other - this being a time before either of us had an email address. We would enclose 3.5” floppy disks to share our latest programming efforts. It was in fact in Martyn’s first letter, around January 1995, that he sent me a game he’d written called “<em>Sid Snibble and the Curse of the Curry Stain</em>”.</p>\n<p>I still have a copy, in a heavily nested folder full of archives of archives, and I can still run it today using <a href=\"http://www.qb64.net/\">QB64</a>. It looks like this:</p>\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-10-sid.png?w=625\"><img src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-10-sid.png?w=625?w=625\" alt=\"Sid Snibble and the Curse of the Curry Stain\" width=\"625\" height=\"467\"></a></p>\n<p>It was a text adventure, but even this had a graphical element to it - you didn’t walk around the game by typing NORTH, SOUTH etc., you moved an ASCII face around with the arrow keys. When you entered a location, you could look at things, speak to characters, pick up items and so on - all in an attempt to solve the mystery of what happened the night before, and why you woke up in the middle of the road in a strange town with a large curry stain down your shirt.</p>\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-10-sidbas.png?w=625\"><img src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-10-sidbas.png?w=625?w=625\" alt=\"SID.BAS\" width=\"625\" height=\"390\"></a></p>\n<p>This looked fun. I could write something like this. It would be hilarious! And so I set to work, doing what I’d always done - copying Martyn’s ideas, but doing them a lot worse.</p>\n<p>So, in April 1995 I wrote my first text adventure game.</p>\n<p>It was called… well, there’s no easy way to put this. I don’t want to rewrite history or tell a lie. I was young and the game was only for me and my friends. It was called ”<em>Where’s My Nob?!</em>”</p>\n<p>How I wish that weren’t true. How I wish I could sit here and tell you the story of how I poured my soul into a creative work of genius, a work of art, a literary masterpiece. With a title like that, maybe I could claim that it was an earnest work exploring gender issues. But it wasn’t. I was 12. The game was an excuse for a load of the kind of sophisticated humour that 12 year olds are known for. Featuring locations such as Dracula’s castle, a teacher’s house, a corner shop, a dairy, a Skoda dealer and Potato World.</p>\n<p>So, a throwaway game that should be played by nobody. But for me, a 12 year old boy who didn’t do any kind of creative writing, it was a fun thing to do that got some kind of creative juices flowing.</p>\n<p>[Aside: Although it’s not a work that I would ever want anybody to see - indeed, I would be absolutely horrified - I think what it <em>represents</em> is something that still persists as I develop Quest today. Specifically, although I want Quest to be a useful tool for building very high quality works of interactive fiction, there is still a need for something that allows people to create their own <em>Sid Snibble</em>s (and, er, to find their own <em>Nob</em>? I think deep down my sense of humour remains the same). To give people a way to express themselves, to allow them to develop their artistic sense, to allow them to get started, and then to improve their craft. It’s easy to be snobbish about this kind of thing, and to moan about low-quality games, but if we didn’t have bad text adventures, it’s unlikely we would have very many good ones either.]</p>\n<p>Anyway, back to my, er, game. I sent it to Martyn on a floppy disk together with a second one called “<em>Make Mrs Booth Friendly!</em>”, a game about my French teacher. Also on that disk, I included a terrible chatbot, “Dr Mad!” who would diagnose your illness, and a fortune teller called “Sadistic Smeg”.</p>\n<p>Over the following months I wrote some more text adventure games, always full of in-jokes about school, only ever written for my friends, and never to be seen by anybody else ever, certainly not now. “<em>It’s Mad!</em>”, “<em>Fantasy Land!</em>”, “<em>Park Parade Adventure!</em>” and “<em>The Town of Terror</em>”. It seems the running theme was titles with exclamation marks.</p>\n<p><strong>Making Text Adventures for Windows 95</strong></p>\n<p>Fast forward a few years to 1998, when I’d started dabbling with Visual Basic 5.0 - which meant I was no longer stuck writing programs for DOS, I could create programs for Windows instead, featuring buttons and menus and message boxes and pictures and everything. I was rather stuck for ideas though. I’d spent some time working on a virtual pet, which were all the rage back then, but wanted to try something a bit meatier. I’d just finished my GCSE exams and was looking for something to keep me occupied over the summer break before I started sixth form. I thought back to the text adventures I’d written, and wondered - what would a text adventure game for Windows look like?</p>\n<p>I decided to write myself a little engine before writing a game, so I wouldn’t have to hard-code everything like I’d done in QBasic. I started coding something that would take in a simple text file which would define all aspects of the game, and handle things such as allowing players to save their progress.</p>\n<p>It turned out that I was actually far more interested in creating the engine than I was in writing a game anyway, and I was interested to see what other people might come up with if they used my system. At the time, I was fairly ignorant of any pre-existing systems which would do a similar thing to mine, until somebody suggested I take a look at the rec.arts.int-fiction newsgroup. I started checking out the competition, and reading about <a href=\"http://inform-fiction.org/\">Inform</a> and <a href=\"http://www.tads.org/\">TADS</a>. It was clear to me that they were difficult for newcomers to use (this was before Inform had a natural language syntax - the syntax of Inform 6 still looks bizarre to me), so it looked like I should be able to get people interested in what I was doing.</p>\n<p>I released Quest 1.0, and it looked like this:</p>\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest.png\"><img src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest.png\" alt=\"Quest 1.0 Start Screen\" width=\"391\" height=\"450\"></a></p>\n<p>(Those two globes were animated and bounced back and forth between the edges of the screen. For some reason.)</p>\n<p>Quest 1.0 loaded text files which were in a simple format I’d devised, called ASL - Adventure Scripting Language. The syntax was simple, designed to be coded by hand using Notepad or similar - there was no visual editor yet (“QDK” appeared the following year).</p>\n<p>Here’s the Quest 1.0 <a href=\"http://files.textadventures.co.uk/archive/1.0/Readme.rtf\">Readme file</a> and <a href=\"http://files.textadventures.co.uk/archive/1.0/ASL.rtf\">ASL Reference</a> if you’re interested in some historical detail. You would create games by using Notepad to edit the included template.asl file, which looked like this:</p>\n<pre>' Quest ASL Template\n' All sections must exist in the game, though the text sections may be empty\n' if desired.\ndefine game &lt;Enter name of game here...&gt;\n    asl-version &lt;100&gt;\n    game version &lt;1.0&gt;\n    game author &lt;You&gt;\n    game copyright &lt;© 1998...&gt;\n    game info &lt;Enter game info here...&gt;\n    start &lt;Enter name of place here...&gt;\n    possitems &lt;Enter items separated by commas here...&gt;\n    startitems &lt;Enter start items here...&gt;\nend define\n<p>define room &lt;Enter name of place here...&gt;<br>\nlook &lt;Enter description here...&gt;<br>\nend define</p>\n<p>define text &lt;intro&gt;<br>\nEnter intro text here...<br>\nend define</p>\n<p>define text &lt;win&gt;<br>\nEnter win text here...<br>\nend define</p>\n<p>define text &lt;lose&gt;<br>\nEnter lose text here...<br>\nend define</p></pre><p></p>\n<p>This file format lasted a long time. It was used right up until Quest 4.x, the last version of which was released in 2011 - albeit heavily extended and changed in various ways over the years.</p>\n<p>The empty template looks like this when loaded in Quest 1.0:</p>\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest-main.png?w=625\"><img src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest-main.png?w=625?w=625\" alt=\"Quest 1.0 running a game\" width=\"625\" height=\"434\"></a></p>\n<p>The user interface is still very similar to what Quest offers now - in fact, after it was rearranged in Quest 2.1 it has effectively remained an identical layout. There is the game text of course, a command box, a space to show what items you’re carrying, and a list of things you can see in the current location (which would show “Look at” and “Take” buttons if something was selected). There are also the compass buttons for easier navigation.</p>\n<p>Quest 1.0 supported rooms, characters, objects, things you could pick up (“items”), quantities of things (“collectables”), string variables and some basic script commands. It could play WAV files, show images and display pop-up menus. It supported text formatting, and let you set up your own custom commands using a syntax like “eat #object#” - the same format that is still used in Quest 5 today.</p>\n<p>There was a small sample game distributed with Quest 1.0, “<em>A day in the life of a salesman</em>”. It is of a very similar standard to my QBasic efforts - which is to say stupid, crude and borderline offensive in places. So no, you can’t have a copy, but yes, it does still run in Quest 5.4!</p>\n<p>What happened next? We’ll pick up the story in the next blog post, where I’ll talk about how Quest grew, changed and even shrunk over the years to become what it is today.</p>\n<hr>\n<p>CONTINUED IN NEXT POST</p>\n\n",
      "PostDate": "2021-04-28T12:49:37.3615139Z",
      "LastEditDate": "2021-04-28T14:32:12.6854151Z",
      "link": null
    },
    {
      "PostId": "a6411f7b-7073-406d-b667-d05c23abf816",
      "UserId": 518866,
      "Username": "K.V.",
      "AvatarUrl": "https://secure.gravatar.com/avatar/a97688aadc8152436180b511021e94a7?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "<h1>15 years of Quest, part 2: 1999-2000\r\n</h1>\r\n\r\n26 November 2013\r\n\r\n<div class=\"text-muted\">This post was originally published on the <a href=\"http://blog.textadventures.co.uk/2013/11/26/15-years-of-quest-part-2-1999-2000/\">textadventures.co.uk blog</a>.</div>\r\n <br/>\r\n<p>This is part 2 of a look back at 15 years of Quest - <a title=\"Quest is 15\" href=\"/2013/11/07/quest-is-15/\">part 1 is here</a>.</p>\r\n\r\n<p>Immediately after releasing Quest 1.0, in November 1998, I got started working on Quest 2.0 - the first alpha version was released only a month later, in December 1998. This version incorporated the early feedback I’d received from v1.0 - making room descriptions more customisable, adding functions, numeric variables and “for” loops, improving the in-game debugging information, and fixing various bugs.</p>\r\n\r\n<p>It seems surprising to me now that I didn’t ever do a bug-fix release of v1.0 - I guess that so few people were actively using it, and there were so many rough edges anyway, it must have made more sense just to plough on and pour everything into v2.0. And this was before I’d ever heard of <a href=\"https://en.wikipedia.org/wiki/Revision_control\">source control</a> anyway - in fact, I doubt I’d have even had any kind of backup copy of the Quest code at the time. (It was a time when I was constantly running out of hard disk space, when floppy disks were too small, before I had a CD writer, and before any significant amount of online storage space was easily available).</p>\r\n\r\n<p>Over the following months I added more features - more text formatting options, allowing objects to moved and hidden, and libraries to allow Quest functions to be re-used between games.</p>\r\n\r\n<p>It was all a nice break from working on my A-levels and filling in my UCAS form.</p>\r\n\r\n<p>Quest 2.0 was released in August 1999, and for the first time included a beta version of a new visual Quest game editor called “QDK” - meaning finally you no longer had to code games using a text editor. (I would have called the editor “QED” but there was already a Quake editor of that name).</p>\r\n\r\n<p><a href=\"https://alexwarren.uk//images/2013/textadventuresblog.files.wordpress.com-2013-11-qdkmain.gif\"><img class=\"aligncenter size-full wp-image-2516\" src=\"https://alexwarren.uk//images/2013/textadventuresblog.files.wordpress.com-2013-11-qdkmain.gif\" alt=\"QDK 1.0\" width=\"367\" height=\"366\" /></a></p>\r\n\r\n<p><a href=\"https://alexwarren.uk//images/2013/textadventuresblog.files.wordpress.com-2013-11-room.gif\"><img class=\"aligncenter size-full wp-image-2517\" src=\"https://alexwarren.uk//images/2013/textadventuresblog.files.wordpress.com-2013-11-room.gif\" alt=\"Editing a room in QDK 1.0\" width=\"463\" height=\"410\" /></a></p>\r\n\r\n<p><a href=\"https://alexwarren.uk//images/2013/textadventuresblog.files.wordpress.com-2013-11-objedit.gif\"><img class=\"aligncenter size-full wp-image-2518\" src=\"https://alexwarren.uk//images/2013/textadventuresblog.files.wordpress.com-2013-11-objedit.gif\" alt=\"Editing an object in QDK 1.0\" width=\"417\" height=\"212\" /></a></p>\r\n\r\n<p>The script editor was very basic:</p>\r\n\r\n<p><a href=\"https://alexwarren.uk//images/2013/textadventuresblog.files.wordpress.com-2013-11-script.gif\"><img class=\"aligncenter size-full wp-image-2519\" src=\"https://alexwarren.uk//images/2013/textadventuresblog.files.wordpress.com-2013-11-script.gif\" alt=\"Editing a script in QDK 1.0\" width=\"475\" height=\"156\" /></a></p>\r\n\r\n<p>The main player interface for Quest 2.0 still looked pretty much exactly the same as v1.0 - which is to say, hideous. This was finally rectified in November 1999 with the release of Quest 2.1, which has a layout which is awfully similar even to the current version of Quest:</p>\r\n\r\n<p><a href=\"https://alexwarren.uk//images/2013/textadventuresblog.files.wordpress.com-2013-11-quest21.png\"><img class=\"aligncenter size-large wp-image-2520\" src=\"https://alexwarren.uk//images/2013/textadventuresblog.files.wordpress.com-2013-11-quest21.png?w=625\" alt=\"Quest 2.1\" width=\"625\" height=\"462\" /></a></p>\r\n\r\n<p>Quest 2.0 is the first version for which at least one actual game was made - and it’s still on textadventures.co.uk, and it still works today, whether you download it or use the web-based player - <a href=\"http://textadventures.co.uk/games/view/nalydifu9eqbcgy0pcyceq/the-adventures-of-koww-the-magician\">The Adventures of Koww the Magician</a>.</p>\r\n\r\n<p>There are a total of 28 games on <a href=\"http://textadventures.co.uk\">textadventures.co.uk</a> which were written for Quest 2.x - see if you can find them… (the column to the right of the game listing will tell you the version of Quest used to build the game).</p>\r\n\r\n<p>The “libraries” feature got some early use, with Alan Bampton creating a “Standard” library to add some features, including containers - which Quest was still years away from supporting natively. This library was included with Quest itself as of v2.11. (10 years later, when redesigning Quest for v5.0, libraries became <em>the</em> way to add <em>all</em> functionality to Quest - without its Core library, Quest 5 does very little at all).</p>\r\n\r\n<p>By early 2000 my thoughts were turning to Quest 3.0, which would be a huge update - I was getting lots of suggestions from users, and there were various aspects of Quest I wanted to tidy up - things which didn’t make sense to me at all any more, such as: why was “an object in a room” a separate concept to “an item you can carry”? It was time for the first of many overhauls of Quest. In the mean-time I carried on releasing bug-fixed versions of v2.1 up until Quest 2.19, which was released in January 2001.</p>\r\n\r\n<p>Next time I’ll carry on with a look back at version 3.0 and beyond. If you want to peruse some archive material, the <a href=\"http://www.network54.com/Forum/9821/\">forums from 1998-2000</a> are still online.</p>\r\n",
      "EditableFormat": "markdown",
      "HTML": "<h1>15 years of Quest, part 2: 1999-2000\n</h1>\n<p>26 November 2013</p>\n<div>This post was originally published on the <a href=\"http://blog.textadventures.co.uk/2013/11/26/15-years-of-quest-part-2-1999-2000/\">textadventures.co.uk blog</a>.</div>\n <br>\n<p>This is part 2 of a look back at 15 years of Quest - <a title=\"Quest is 15\" href=\"/2013/11/07/quest-is-15/\">part 1 is here</a>.</p>\n<p>Immediately after releasing Quest 1.0, in November 1998, I got started working on Quest 2.0 - the first alpha version was released only a month later, in December 1998. This version incorporated the early feedback I’d received from v1.0 - making room descriptions more customisable, adding functions, numeric variables and “for” loops, improving the in-game debugging information, and fixing various bugs.</p>\n<p>It seems surprising to me now that I didn’t ever do a bug-fix release of v1.0 - I guess that so few people were actively using it, and there were so many rough edges anyway, it must have made more sense just to plough on and pour everything into v2.0. And this was before I’d ever heard of <a href=\"https://en.wikipedia.org/wiki/Revision_control\">source control</a> anyway - in fact, I doubt I’d have even had any kind of backup copy of the Quest code at the time. (It was a time when I was constantly running out of hard disk space, when floppy disks were too small, before I had a CD writer, and before any significant amount of online storage space was easily available).</p>\n<p>Over the following months I added more features - more text formatting options, allowing objects to moved and hidden, and libraries to allow Quest functions to be re-used between games.</p>\n<p>It was all a nice break from working on my A-levels and filling in my UCAS form.</p>\n<p>Quest 2.0 was released in August 1999, and for the first time included a beta version of a new visual Quest game editor called “QDK” - meaning finally you no longer had to code games using a text editor. (I would have called the editor “QED” but there was already a Quake editor of that name).</p>\n<p><a href=\"https://alexwarren.uk//images/2013/textadventuresblog.files.wordpress.com-2013-11-qdkmain.gif\"><img src=\"https://alexwarren.uk//images/2013/textadventuresblog.files.wordpress.com-2013-11-qdkmain.gif\" alt=\"QDK 1.0\" width=\"367\" height=\"366\"></a></p>\n<p><a href=\"https://alexwarren.uk//images/2013/textadventuresblog.files.wordpress.com-2013-11-room.gif\"><img src=\"https://alexwarren.uk//images/2013/textadventuresblog.files.wordpress.com-2013-11-room.gif\" alt=\"Editing a room in QDK 1.0\" width=\"463\" height=\"410\"></a></p>\n<p><a href=\"https://alexwarren.uk//images/2013/textadventuresblog.files.wordpress.com-2013-11-objedit.gif\"><img src=\"https://alexwarren.uk//images/2013/textadventuresblog.files.wordpress.com-2013-11-objedit.gif\" alt=\"Editing an object in QDK 1.0\" width=\"417\" height=\"212\"></a></p>\n<p>The script editor was very basic:</p>\n<p><a href=\"https://alexwarren.uk//images/2013/textadventuresblog.files.wordpress.com-2013-11-script.gif\"><img src=\"https://alexwarren.uk//images/2013/textadventuresblog.files.wordpress.com-2013-11-script.gif\" alt=\"Editing a script in QDK 1.0\" width=\"475\" height=\"156\"></a></p>\n<p>The main player interface for Quest 2.0 still looked pretty much exactly the same as v1.0 - which is to say, hideous. This was finally rectified in November 1999 with the release of Quest 2.1, which has a layout which is awfully similar even to the current version of Quest:</p>\n<p><a href=\"https://alexwarren.uk//images/2013/textadventuresblog.files.wordpress.com-2013-11-quest21.png\"><img src=\"https://alexwarren.uk//images/2013/textadventuresblog.files.wordpress.com-2013-11-quest21.png?w=625\" alt=\"Quest 2.1\" width=\"625\" height=\"462\"></a></p>\n<p>Quest 2.0 is the first version for which at least one actual game was made - and it’s still on textadventures.co.uk, and it still works today, whether you download it or use the web-based player - <a href=\"http://textadventures.co.uk/games/view/nalydifu9eqbcgy0pcyceq/the-adventures-of-koww-the-magician\">The Adventures of Koww the Magician</a>.</p>\n<p>There are a total of 28 games on <a href=\"http://textadventures.co.uk/\">textadventures.co.uk</a> which were written for Quest 2.x - see if you can find them… (the column to the right of the game listing will tell you the version of Quest used to build the game).</p>\n<p>The “libraries” feature got some early use, with Alan Bampton creating a “Standard” library to add some features, including containers - which Quest was still years away from supporting natively. This library was included with Quest itself as of v2.11. (10 years later, when redesigning Quest for v5.0, libraries became <em>the</em> way to add <em>all</em> functionality to Quest - without its Core library, Quest 5 does very little at all).</p>\n<p>By early 2000 my thoughts were turning to Quest 3.0, which would be a huge update - I was getting lots of suggestions from users, and there were various aspects of Quest I wanted to tidy up - things which didn’t make sense to me at all any more, such as: why was “an object in a room” a separate concept to “an item you can carry”? It was time for the first of many overhauls of Quest. In the mean-time I carried on releasing bug-fixed versions of v2.1 up until Quest 2.19, which was released in January 2001.</p>\n<p>Next time I’ll carry on with a look back at version 3.0 and beyond. If you want to peruse some archive material, the <a href=\"http://www.network54.com/Forum/9821/\">forums from 1998-2000</a> are still online.</p>\n\n",
      "PostDate": "2021-04-28T12:49:58.3724673Z",
      "LastEditDate": "2021-04-28T12:57:10.9751454Z",
      "link": null
    },
    {
      "PostId": "432475d1-4923-4c75-a6f0-bc004d9336a8",
      "UserId": 518866,
      "Username": "K.V.",
      "AvatarUrl": "https://secure.gravatar.com/avatar/a97688aadc8152436180b511021e94a7?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "# 15 years of Quest, part 3: 2000-2004 - Experimenting with Multi-Player\r\n27 November 2013\r\n\r\n<div class=\"text-muted\">This post was originally published on the <a href=\"http://blog.textadventures.co.uk/2013/11/27/15-years-of-quest-part-3-2000-2004-experimenting-with-multi-player/\">textadventures.co.uk blog</a>.</div>\r\n<br/>\r\n<p>This is part 3 of a look back at 15 years of Quest. Here are links to the previous posts: <a title=\"Quest is 15\" href=\"/2013/11/07/quest-is-15/\">part 1</a>, <a title=\"15 years of Quest, part 2: 1999-2000\" href=\"/2013/11/26/15-years-of-quest-part-2-1999-2000/\">part 2</a>.</p>\r\n\r\n---\r\n<p>The first alpha build Quest 3.0 was released in March 2000, and fixed one of the weird design flaws of previous versions by unifying “items” and “objects”. Objects now had to have unique names, but they could have aliases, which would be displayed to the player instead of the code name. This version also introduced a disambiguation menu to allow the player to distinguishing between different objects which had same the alias. This is fundamentally the same approach to object handling that Quest still uses today.</p>\r\n\r\n<p>That first alpha of Quest 3.0 also added timers. The second alpha in July 2000 added support for a truly experimental feature that never quite took off - online multi-player play. This allowed Quest to connect to a new bit of software I was working on, which started out with the name “QX3” and was later renamed “QuestNet Server”.</p>\r\n\r\n<p>The idea was that the game ran entirely on the server, and players would connect to it using the Quest software. This would allow multiple players to connect to the same game world, where they would each have their own inventories and be able to interact with other players.</p>\r\n\r\n<p>You can get some idea of how it worked by looking at some screenshots for the basic “Arena” demo. Multiple players would appear in the same room, and they could pick up objects, give them to each other, and even hit each other. For example, here’s what Bob might see if he joins Alex in the room:</p>\r\n\r\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest3-multiplayer2.png\"><img class=\"aligncenter size-large wp-image-2539\" src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest3-multiplayer2.png?w=625\" alt=\"Multi-player Quest game - 1\" width=\"625\" height=\"462\" /></a></p>\r\n\r\n<p>And here’s what Alex sees while this is happening:</p>\r\n\r\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest3-multiplayer.png\"><img class=\"aligncenter size-large wp-image-2538\" src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest3-multiplayer.png?w=625\" alt=\"Multi-player Quest game - 2\" width=\"625\" height=\"462\" /></a></p>\r\n\r\n<p>I thought this was rather nifty, myself, and although it got a reasonable amount of interest from Quest users, it ultimately failed to really get anywhere. I’ve come across a <a href=\"http://www.axeuk.com/ubb/Forum3/HTML/000030.html\">forum post from 2002 by MaDbRiT</a> which sums it up:</p>\r\n<blockquote>Questnet is a good idea that is kind of struggling to get off the ground. There are no games because there are no players and no one wants to spend aged writing a game if there are no players. What came first, the Chicken or the Egg? The technical demands of hosting a QuestNet game are out of realistic reach of most of us too - even if I wrote a QuestNet game, I couldn't \"serve\" it - I just don't have the facilities.</blockquote>\r\n<p>In the days when most of us were still using dial-up, the idea of running a server on your home internet connection just didn’t make a whole lot of sense.</p>\r\n\r\n<p>QuestNet Server would hang around for a while, never getting much use or ever seeing its full potential. I still think there’s something in the idea of multi-player interactive fiction, and maybe it’s something to revisit some day. Watch this space!</p>\r\n\r\n<p>The second alpha of Quest 3.0 also got rid of the separate concept of “characters” - they were now just objects too. It added support for arrays, and arbitrary object properties allowing any kind of data to be attached to an object (although these were separate to the built-in properties or “tags”, which meant that you couldn’t easily read or update data like an object’s “look” description - this flaw was resolved when Quest was rewritten for v5.0, when all object data was finally stored as properties).</p>\r\n\r\n<p>A third alpha build followed in September 2000, which added object types - allowing object properties to be inherited. This also added support for creating rooms on-the-fly via script.</p>\r\n\r\n<p>In October 2000, I moved to London and started university, so progress with Quest slowed down quite a bit.</p>\r\n\r\n<p>In March 2001, Quest 3.0 reached its first beta release. This added support for dynamically creating objects and exits, and added script properties (“actions”). The second beta followed in April, featuring various minor tweaks to get it closer to a releasable version. Quest 3.0 was finally released in September 2001, and QDK was updated at the same time to get a cleaner interface and to support all the new Quest features. It also gained a new script editor.</p>\r\n\r\n<p>The new-look start screen allowed you to load a game file, or connect to a multi-player network game:</p>\r\n\r\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest3-start.png\"><img class=\"aligncenter size-full wp-image-2540\" src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest3-start.png\" alt=\"Quest 3.0 Start Screen\" width=\"606\" height=\"313\" /></a></p>\r\n\r\n<p>The main player interface was relatively unchanged from Quest 2.1, although you could now toggle the panes off:</p>\r\n\r\n<p>\r\n<a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest3-main.png\"><img class=\"aligncenter size-large wp-image-2537\" src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest3-main.png?w=625\" alt=\"Quest 3.0\" width=\"625\" height=\"462\" /></a></p>\r\n\r\n<p>QDK was still looking rather plain:</p>\r\n\r\n<p>\r\n<a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-qdk3-main.png\"><img class=\"aligncenter size-full wp-image-2534\" src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-qdk3-main.png\" alt=\"QDK 3.0\" width=\"569\" height=\"487\" /></a></p>\r\n\r\n<p>The Room and Object editors were now grouped into tabs:</p>\r\n\r\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-qdk3-room.png\"><img class=\"aligncenter size-full wp-image-2536\" src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-qdk3-room.png\" alt=\"QDK 3.0 Room Editor\" width=\"478\" height=\"433\" /></a></p>\r\n\r\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-qdk3-object.png\"><img class=\"aligncenter size-full wp-image-2535\" src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-qdk3-object.png\" alt=\"QDK 3.0 Object Editor\" width=\"454\" height=\"425\" /></a></p>\r\n\r\n<p>The new Script Editor presented a plain English way of editing scripts. It’s not dissimilar to Quest 5’s script editor, although it did involve opening a pop-up window every time you wanted to edit any individual command, which some people found a bit tiring:</p>\r\n\r\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-qdk3-scripteditor.png\"><img class=\"aligncenter size-large wp-image-2541\" src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-qdk3-scripteditor.png?w=625\" alt=\"QDK 3.0 Script Editor\" width=\"625\" height=\"325\" /></a></p>\r\n\r\n<p>A few bug-fix releases followed very shortly afterwards, and then I started working on v3.1. This added support for <a href=\"https://en.wikipedia.org/wiki/Module_file\">MOD music files</a> - something I was into creating myself, but a feature I think was never actually used by anybody. There were various other tweaks, including improvements to the parser. Libraries gained the ability to add panes to QDK (here again is an example of a feature that was added which is now a core part of how Quest works - as of v5.0, all panes in Quest’s editor are defined by libraries). Quest 3.1 was released in June 2002.</p>\r\n\r\n<p>The next update was version 3.5, released in December 2003, featuring the ability to translate the player interface (although not on a per-game basis - it was a player setting), plus support for text-to-speech and opening ZIP files. Following slightly later in January 2004 was the first non-beta release of QuestNet Server - although, as it would turn out, it would never get another significant release after that, simply keeping pace with features as they were added to the single-player version Quest.</p>\r\n\r\n<p>The pace of change was clearly slowing down, as I was keeping busy with my Physics degree. It got even worse after I graduated in 2004, and started working - I didn’t really touch Quest for almost two years. But when I finally came back to it, I dived into it in a big way. More on that next time!</p>\r\n\r\n---\r\n### NOTE FROM K.V.\r\n\r\nIgnore this last section (NOTE FROM K.V.).\r\n\r\nI had to add this text to edit this post without running into \"Sorry, you can't post that here.\"",
      "EditableFormat": "markdown",
      "HTML": "<h1>15 years of Quest, part 3: 2000-2004 - Experimenting with Multi-Player</h1>\n<p>27 November 2013</p>\n<div>This post was originally published on the <a href=\"http://blog.textadventures.co.uk/2013/11/27/15-years-of-quest-part-3-2000-2004-experimenting-with-multi-player/\">textadventures.co.uk blog</a>.</div>\n<br>\n<p>This is part 3 of a look back at 15 years of Quest. Here are links to the previous posts: <a title=\"Quest is 15\" href=\"/2013/11/07/quest-is-15/\">part 1</a>, <a title=\"15 years of Quest, part 2: 1999-2000\" href=\"/2013/11/26/15-years-of-quest-part-2-1999-2000/\">part 2</a>.</p>\n<hr>\n<p>The first alpha build Quest 3.0 was released in March 2000, and fixed one of the weird design flaws of previous versions by unifying “items” and “objects”. Objects now had to have unique names, but they could have aliases, which would be displayed to the player instead of the code name. This version also introduced a disambiguation menu to allow the player to distinguishing between different objects which had same the alias. This is fundamentally the same approach to object handling that Quest still uses today.</p>\n<p>That first alpha of Quest 3.0 also added timers. The second alpha in July 2000 added support for a truly experimental feature that never quite took off - online multi-player play. This allowed Quest to connect to a new bit of software I was working on, which started out with the name “QX3” and was later renamed “QuestNet Server”.</p>\n<p>The idea was that the game ran entirely on the server, and players would connect to it using the Quest software. This would allow multiple players to connect to the same game world, where they would each have their own inventories and be able to interact with other players.</p>\n<p>You can get some idea of how it worked by looking at some screenshots for the basic “Arena” demo. Multiple players would appear in the same room, and they could pick up objects, give them to each other, and even hit each other. For example, here’s what Bob might see if he joins Alex in the room:</p>\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest3-multiplayer2.png\"><img src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest3-multiplayer2.png?w=625\" alt=\"Multi-player Quest game - 1\" width=\"625\" height=\"462\"></a></p>\n<p>And here’s what Alex sees while this is happening:</p>\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest3-multiplayer.png\"><img src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest3-multiplayer.png?w=625\" alt=\"Multi-player Quest game - 2\" width=\"625\" height=\"462\"></a></p>\n<p>I thought this was rather nifty, myself, and although it got a reasonable amount of interest from Quest users, it ultimately failed to really get anywhere. I’ve come across a <a href=\"http://www.axeuk.com/ubb/Forum3/HTML/000030.html\">forum post from 2002 by MaDbRiT</a> which sums it up:</p>\n<blockquote>Questnet is a good idea that is kind of struggling to get off the ground. There are no games because there are no players and no one wants to spend aged writing a game if there are no players. What came first, the Chicken or the Egg? The technical demands of hosting a QuestNet game are out of realistic reach of most of us too - even if I wrote a QuestNet game, I couldn't \"serve\" it - I just don't have the facilities.</blockquote>\n<p>In the days when most of us were still using dial-up, the idea of running a server on your home internet connection just didn’t make a whole lot of sense.</p>\n<p>QuestNet Server would hang around for a while, never getting much use or ever seeing its full potential. I still think there’s something in the idea of multi-player interactive fiction, and maybe it’s something to revisit some day. Watch this space!</p>\n<p>The second alpha of Quest 3.0 also got rid of the separate concept of “characters” - they were now just objects too. It added support for arrays, and arbitrary object properties allowing any kind of data to be attached to an object (although these were separate to the built-in properties or “tags”, which meant that you couldn’t easily read or update data like an object’s “look” description - this flaw was resolved when Quest was rewritten for v5.0, when all object data was finally stored as properties).</p>\n<p>A third alpha build followed in September 2000, which added object types - allowing object properties to be inherited. This also added support for creating rooms on-the-fly via script.</p>\n<p>In October 2000, I moved to London and started university, so progress with Quest slowed down quite a bit.</p>\n<p>In March 2001, Quest 3.0 reached its first beta release. This added support for dynamically creating objects and exits, and added script properties (“actions”). The second beta followed in April, featuring various minor tweaks to get it closer to a releasable version. Quest 3.0 was finally released in September 2001, and QDK was updated at the same time to get a cleaner interface and to support all the new Quest features. It also gained a new script editor.</p>\n<p>The new-look start screen allowed you to load a game file, or connect to a multi-player network game:</p>\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest3-start.png\"><img src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest3-start.png\" alt=\"Quest 3.0 Start Screen\" width=\"606\" height=\"313\"></a></p>\n<p>The main player interface was relatively unchanged from Quest 2.1, although you could now toggle the panes off:</p>\n<p>\n<a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest3-main.png\"><img src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-quest3-main.png?w=625\" alt=\"Quest 3.0\" width=\"625\" height=\"462\"></a></p>\n<p>QDK was still looking rather plain:</p>\n<p>\n<a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-qdk3-main.png\"><img src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-qdk3-main.png\" alt=\"QDK 3.0\" width=\"569\" height=\"487\"></a></p>\n<p>The Room and Object editors were now grouped into tabs:</p>\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-qdk3-room.png\"><img src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-qdk3-room.png\" alt=\"QDK 3.0 Room Editor\" width=\"478\" height=\"433\"></a></p>\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-qdk3-object.png\"><img src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-qdk3-object.png\" alt=\"QDK 3.0 Object Editor\" width=\"454\" height=\"425\"></a></p>\n<p>The new Script Editor presented a plain English way of editing scripts. It’s not dissimilar to Quest 5’s script editor, although it did involve opening a pop-up window every time you wanted to edit any individual command, which some people found a bit tiring:</p>\n<p><a href=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-qdk3-scripteditor.png\"><img src=\"https://alexwarren.uk/images/2013/textadventuresblog.files.wordpress.com-2013-11-qdk3-scripteditor.png?w=625\" alt=\"QDK 3.0 Script Editor\" width=\"625\" height=\"325\"></a></p>\n<p>A few bug-fix releases followed very shortly afterwards, and then I started working on v3.1. This added support for <a href=\"https://en.wikipedia.org/wiki/Module_file\">MOD music files</a> - something I was into creating myself, but a feature I think was never actually used by anybody. There were various other tweaks, including improvements to the parser. Libraries gained the ability to add panes to QDK (here again is an example of a feature that was added which is now a core part of how Quest works - as of v5.0, all panes in Quest’s editor are defined by libraries). Quest 3.1 was released in June 2002.</p>\n<p>The next update was version 3.5, released in December 2003, featuring the ability to translate the player interface (although not on a per-game basis - it was a player setting), plus support for text-to-speech and opening ZIP files. Following slightly later in January 2004 was the first non-beta release of QuestNet Server - although, as it would turn out, it would never get another significant release after that, simply keeping pace with features as they were added to the single-player version Quest.</p>\n<p>The pace of change was clearly slowing down, as I was keeping busy with my Physics degree. It got even worse after I graduated in 2004, and started working - I didn’t really touch Quest for almost two years. But when I finally came back to it, I dived into it in a big way. More on that next time!</p>\n<hr>\n<h3>NOTE FROM K.V.</h3>\n<p>Ignore this last section (NOTE FROM K.V.).</p>\n<p>I had to add this text to edit this post without running into \"Sorry, you can't post that here.\"</p>\n\n",
      "PostDate": "2021-04-28T12:50:15.8875377Z",
      "LastEditDate": "2021-04-28T14:16:12.0102535Z",
      "link": null
    },
    {
      "PostId": "d4c58d97-728d-4e5b-9de9-79598eb5e7e8",
      "UserId": 518866,
      "Username": "K.V.",
      "AvatarUrl": "https://secure.gravatar.com/avatar/a97688aadc8152436180b511021e94a7?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "<h1>Starting a new chapter\r\n</h1>\r\n16 December 2013\r\n\r\n <div class=\"text-muted\">This post was originally published on the <a href=\"http://blog.textadventures.co.uk/2013/12/16/starting-a-new-chapter/\">textadventures.co.uk blog</a>.</div>\r\n<br/>\r\n<p>I’ve been building Quest and working on <a href=\"http://textadventures.co.uk\">textadventures.co.uk</a> full-time for a couple of years now, on and off. Despite my best efforts to turn this into my living, I can no longer continue to work on this basis. As of January, I’ll be moving on to work on something else, with interactive fiction becoming a side project once again.</p>\r\n\r\n<p>We applied to <a href=\"http://www.emergeventurelab.com/\">Emerge</a>, a new startup accelerator focusing on education, with our aim of building up <a href=\"http://activelit.com\">ActiveLit</a>. I’m told about 80 companies applied, and we were one of the 20 selected for interview.</p>\r\n\r\n<p>Unfortunately we are not one of the 7 or 8 that have been selected to join the programme.</p>\r\n<blockquote>We would like to thank you for taking the time to apply to and interview for Emerge Education '14.\r\n\r\nPlaces are limited and the applications were excellent. It was difficult to select participants from such a strong group. Unfortunately on this occasion, we are not in a position to offer you a place in Emerge Education '14. We hope you will apply to our future programs.\r\n\r\nWe include below a brief summary of how we arrived at this decision and hope this is helpful to you:\r\n<ul>\r\n\t<li>Your product was more developed and had more traction than that of any other applicant to Emerge Education and we were impressed by the user demand it has received;</li>\r\n\t<li>The selection committee's main concern was a lack of clarity around whether your team had the strategic intent to take ActiveLit from an (already) successful product to a high-growth business;</li>\r\n\t<li>In addition, applicants that did better in the selection process tended to have more business experience as part of the co-founding team.</li>\r\n</ul>\r\n</blockquote>\r\n<p>I find it difficult to understand the logic here, and in fact this email makes less sense every time I re-read it. The highest traction product of <em>all</em> applicants, but a question mark over our “strategic intent”?</p>\r\n\r\n<p>Whatever. You can’t expect too much from rejection emails. Any “reasons” given are always post-hoc justifications of the decision made. I expect the most typical would be “your product is not sufficiently developed”, so at least it’s novel to be turned down because our product is <em>too</em> developed.</p>\r\n\r\n<p>It would only require one reason to say yes - “we think there’s a good chance of making money if we invest in you”. At least in this way it’s a more straightforward and honest process than awarding grants - it’s refreshingly simple compared to working out why, say, a government body won’t award funding. Any rejection from an accelerator is fundamentally because they couldn’t find this reason to say “yes”, rather than any reasons that may be given for saying “no”.</p>\r\n\r\n<p>This is the feedback we’ve been waiting for, then - the simple yes/no answer to the question “Can we convince people that know about money and business and stuff that what we’ve been working on is viable?”</p>\r\n\r\n<p>And the results are in, and the answer, at least from Emerge (and also <a href=\"http://uk.wayra.org/\">Wayra</a>), is “no”. And that’s fine.</p>\r\n\r\n<p>They say that it <a href=\"https://www.forbes.com/sites/cherylsnappconner/2013/05/16/true-grit-what-it-takes-to-succeed-as-an-entrepreneur/\">takes grit to succeed</a>, but what if you never give up on an idea that is fundamentally never going to work? Maybe it simply makes more sense for Quest, textadventures.co.uk and ActiveLit to be run as side projects. I’ve sunk a lot of time into these now - 2 years of full-time effort. I’d be much richer now if I hadn’t done this.</p>\r\n\r\n<p>Of course, I’d be unhappy. I’m really pleased with what I’ve achieved. I used to sit at work, seething in frustration, because there were things I wanted to do with interactive fiction that I didn’t get time for. That’s changed now - I’ve built a lot of software, explored a lot of angles and spoken to a lot of people, trying to work out how an interactive fiction business might succeed.</p>\r\n\r\n<p>And what I’ve discovered is, I can’t make it work. Not right now anyway. Maybe it just needs to live and grow organically for a while. Maybe something external will change, as more and more people discover interactive fiction, or as more teachers use Quest and text adventures in the classroom. I’ve got nothing left to “push” from my side, and I’ve run out of money anyway.</p>\r\n\r\n<p>And even if nothing external changes, and it never grows beyond what it currently is, it will still have been worthwhile. I don’t regret anything. I’ve built what I wanted to build. I’ve scratched the itch. I’ve created software that is being used by all kinds of people for all kinds of things. Children are learning programming, being engaged with reading and writing. More and more people are playing and creating games on the site. I’ve met some great, interesting people. It’s been a lot of fun. It’s been totally worth it.</p>\r\n\r\n<p>But I can’t do this for a living, so it will have to become my hobby again. There are plenty of other things I can do - there are loads of opportunities for software developers at the moment, and there are some great companies out there doing interesting things which I can contribute to. It’s an exciting time, and I’ve now got some great experience that will hopefully prove useful in whatever I move onto next.</p>\r\n",
      "EditableFormat": "markdown",
      "HTML": "<h1>Starting a new chapter\n</h1>\n16 December 2013\n <div>This post was originally published on the <a href=\"http://blog.textadventures.co.uk/2013/12/16/starting-a-new-chapter/\">textadventures.co.uk blog</a>.</div>\n<br>\n<p>I’ve been building Quest and working on <a href=\"http://textadventures.co.uk/\">textadventures.co.uk</a> full-time for a couple of years now, on and off. Despite my best efforts to turn this into my living, I can no longer continue to work on this basis. As of January, I’ll be moving on to work on something else, with interactive fiction becoming a side project once again.</p>\n<p>We applied to <a href=\"http://www.emergeventurelab.com/\">Emerge</a>, a new startup accelerator focusing on education, with our aim of building up <a href=\"http://activelit.com/\">ActiveLit</a>. I’m told about 80 companies applied, and we were one of the 20 selected for interview.</p>\n<p>Unfortunately we are not one of the 7 or 8 that have been selected to join the programme.</p>\n<blockquote>We would like to thank you for taking the time to apply to and interview for Emerge Education '14.\n<p>Places are limited and the applications were excellent. It was difficult to select participants from such a strong group. Unfortunately on this occasion, we are not in a position to offer you a place in Emerge Education '14. We hope you will apply to our future programs.</p>\n<p>We include below a brief summary of how we arrived at this decision and hope this is helpful to you:</p>\n<ul>\n\t<li>Your product was more developed and had more traction than that of any other applicant to Emerge Education and we were impressed by the user demand it has received;</li>\n\t<li>The selection committee's main concern was a lack of clarity around whether your team had the strategic intent to take ActiveLit from an (already) successful product to a high-growth business;</li>\n\t<li>In addition, applicants that did better in the selection process tended to have more business experience as part of the co-founding team.</li>\n</ul>\n</blockquote>\n<p>I find it difficult to understand the logic here, and in fact this email makes less sense every time I re-read it. The highest traction product of <em>all</em> applicants, but a question mark over our “strategic intent”?</p>\n<p>Whatever. You can’t expect too much from rejection emails. Any “reasons” given are always post-hoc justifications of the decision made. I expect the most typical would be “your product is not sufficiently developed”, so at least it’s novel to be turned down because our product is <em>too</em> developed.</p>\n<p>It would only require one reason to say yes - “we think there’s a good chance of making money if we invest in you”. At least in this way it’s a more straightforward and honest process than awarding grants - it’s refreshingly simple compared to working out why, say, a government body won’t award funding. Any rejection from an accelerator is fundamentally because they couldn’t find this reason to say “yes”, rather than any reasons that may be given for saying “no”.</p>\n<p>This is the feedback we’ve been waiting for, then - the simple yes/no answer to the question “Can we convince people that know about money and business and stuff that what we’ve been working on is viable?”</p>\n<p>And the results are in, and the answer, at least from Emerge (and also <a href=\"http://uk.wayra.org/\">Wayra</a>), is “no”. And that’s fine.</p>\n<p>They say that it <a href=\"https://www.forbes.com/sites/cherylsnappconner/2013/05/16/true-grit-what-it-takes-to-succeed-as-an-entrepreneur/\">takes grit to succeed</a>, but what if you never give up on an idea that is fundamentally never going to work? Maybe it simply makes more sense for Quest, textadventures.co.uk and ActiveLit to be run as side projects. I’ve sunk a lot of time into these now - 2 years of full-time effort. I’d be much richer now if I hadn’t done this.</p>\n<p>Of course, I’d be unhappy. I’m really pleased with what I’ve achieved. I used to sit at work, seething in frustration, because there were things I wanted to do with interactive fiction that I didn’t get time for. That’s changed now - I’ve built a lot of software, explored a lot of angles and spoken to a lot of people, trying to work out how an interactive fiction business might succeed.</p>\n<p>And what I’ve discovered is, I can’t make it work. Not right now anyway. Maybe it just needs to live and grow organically for a while. Maybe something external will change, as more and more people discover interactive fiction, or as more teachers use Quest and text adventures in the classroom. I’ve got nothing left to “push” from my side, and I’ve run out of money anyway.</p>\n<p>And even if nothing external changes, and it never grows beyond what it currently is, it will still have been worthwhile. I don’t regret anything. I’ve built what I wanted to build. I’ve scratched the itch. I’ve created software that is being used by all kinds of people for all kinds of things. Children are learning programming, being engaged with reading and writing. More and more people are playing and creating games on the site. I’ve met some great, interesting people. It’s been a lot of fun. It’s been totally worth it.</p>\n<p>But I can’t do this for a living, so it will have to become my hobby again. There are plenty of other things I can do - there are loads of opportunities for software developers at the moment, and there are some great companies out there doing interesting things which I can contribute to. It’s an exciting time, and I’ve now got some great experience that will hopefully prove useful in whatever I move onto next.</p>\n\n",
      "PostDate": "2021-04-28T12:51:33.2861929Z",
      "LastEditDate": "2021-04-28T13:11:46.526494Z",
      "link": null
    },
    {
      "PostId": "e2f7fd31-9deb-4b81-80d9-a73f258150dc",
      "UserId": 518866,
      "Username": "K.V.",
      "AvatarUrl": "https://secure.gravatar.com/avatar/a97688aadc8152436180b511021e94a7?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "<h1>LEGup Fail Clinic: textadventures.co.uk and Quest\r\n</h1>\r\n\r\n28 May 2014\r\n<br/>\r\n<p>This talk was given at the London Educational Games Meetup on 28th May 2014.</p>\r\n\r\n**Link to view on YouTube:**\r\n[![image](https://user-images.githubusercontent.com/30656341/116409656-ad3bba00-a7f9-11eb-9a3e-7dc27a911275.png)](https://www.youtube.com/watch?v=gfT1YcCaSDQ)",
      "EditableFormat": "markdown",
      "HTML": "<h1>LEGup Fail Clinic: textadventures.co.uk and Quest\n</h1>\n<p>28 May 2014<br>\n<br></p>\n<p>This talk was given at the London Educational Games Meetup on 28th May 2014.</p>\n<p><strong>Link to view on YouTube:</strong><br>\n<a href=\"https://www.youtube.com/watch?v=gfT1YcCaSDQ\"><img src=\"https://user-images.githubusercontent.com/30656341/116409656-ad3bba00-a7f9-11eb-9a3e-7dc27a911275.png\" alt=\"image\"></a></p>\n\n",
      "PostDate": "2021-04-28T12:52:43.3954183Z",
      "LastEditDate": "2021-04-28T13:16:52.0966343Z",
      "link": null
    },
    {
      "PostId": "79a77fa4-e52a-4878-a3a8-afe22e783f32",
      "UserId": 518866,
      "Username": "K.V.",
      "AvatarUrl": "https://secure.gravatar.com/avatar/a97688aadc8152436180b511021e94a7?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "# Going It Alone - EXCERPT FROM - [How to Be Awesome (Part 1)](https://alexwarren.uk/2015/09/29/how-to-be-awesome/)\r\n\r\n29 September 2015\r\n<br/>\r\n<div class=\"text-muted\">This post was originally published on the <a href=\"https://stackoverflow.blog/2015/09/29/how-to-be-awesome/\">Stack Overflow blog</a>.</div>\r\n\r\n<h2>Going it alone</h2>\r\n<p>So that&#8217;s what I did &#8211; I decided to build some awesome stuff. In 2010 I quit my job and threw myself head-first into building the things that I wanted to build.</p>\r\n<p>I&#8217;d been spending much of my spare time working on my open source project <a href=\"https://github.com/textadventures/quest\">Quest</a>, a system that lets non-programmers write text adventure games, and I knew that teachers were starting to use it in their classrooms, so I thought there might be some opportunity there to make some money out of it.</p>\r\n<p>To be honest, quitting my job to focus on building a text adventure engine did seem kind of silly &#8211; but the iPad had just been released, and I was wondering if interactive ebooks might become a thing. If so then maybe I would find myself in the right place at the right time. All the best ideas are kind of hard to distinguish from ridiculous ones, and there was only one way to find out on which side of that dividing line this fell.</p>\r\n<p>And that was really the extent of my &#8220;business plan&#8221; &#8211; I didn&#8217;t think it through in more detail than that. It was more a case of &#8220;what&#8217;s the worst that could happen?&#8221; And the worst case scenario didn&#8217;t seem too bad &#8211; I&#8217;d quit my job working as a VB6 developer, but if I wanted another crappy developer job then it wouldn&#8217;t be that difficult to find one. What I wanted was a good job, and the best way to find one was to increase my skills.</p>\r\n<p>Being quite a frugal person I happened to have enough money saved up that, even if I didn&#8217;t have any income for a year or so, it wouldn&#8217;t be a big problem.</p>\r\n<h2>I made this</h2>\r\n<p><img src=\"https://alexwarren.uk/images/2015/ZcCKI.png\" alt=\"Text Adventures\" /></p>\r\n<p>So I spent most of the next four years doing various things with Quest and interactive fiction:</p>\r\n<ul>\r\n<li>I finished my Quest rewrite, and kept on iterating with new releases, turning it from a Windows desktop application into a web app</li>\r\n<li>I massively expanded and improved my website, turning it into a hub for all kinds of text-based games</li>\r\n<li>I built a new product for schools using text adventures in the classroom</li>\r\n<li>I ran workshops in schools getting kids to create their own games</li>\r\n<li>I experimented with being a publisher, turning text games into mobile apps</li>\r\n<li>I wrote my own game which was an experiment in what a modern text adventure might look like</li>\r\n<li>I worked with writers and filmmakers on a project for a book publisher, building a promotional text game for a new sci-fi novel</li>\r\n</ul>\r\n<p>I made small amounts of money here and there, with a larger amount of money from a few months of contract .NET developer work to top up my finances. Ultimately though, my money ran out.</p>\r\n<p>I had failed to build a successful business, but I had spent years doing work that I enjoyed, and I now had a vastly increased set of skills and a much more interesting CV. I had built some awesome stuff &#8211; now I just needed to follow the cycle around, to tell people about it and try to get an awesome job. That&#8217;s what I&#8217;ll be talking about in <a href=\"/2015/11/24/how-to-be-awesome-part-2\">part 2</a> of this post.</p>\r\n<p>Just in case you think the only way to build awesome stuff is to quit your job and spend four years trying to build an entire business &#8211; you don&#8217;t <em>have</em> to be as batshit insane as me. You can build stuff in your spare time &#8211; I still do, it just takes a little bit longer. Build something you&#8217;re interested in building, something you can be proud of, and ship it. It&#8217;s the best way to learn, and it&#8217;s the best way to upgrade your CV.</p>\r\n",
      "EditableFormat": "markdown",
      "HTML": "<h1>Going It Alone - EXCERPT FROM - <a href=\"https://alexwarren.uk/2015/09/29/how-to-be-awesome/\">How to Be Awesome (Part 1)</a></h1>\n<p>29 September 2015<br>\n<br></p>\n<div>This post was originally published on the <a href=\"https://stackoverflow.blog/2015/09/29/how-to-be-awesome/\">Stack Overflow blog</a>.</div>\n<p></p><h2>Going it alone</h2><p></p>\n<p>So that’s what I did – I decided to build some awesome stuff. In 2010 I quit my job and threw myself head-first into building the things that I wanted to build.</p>\n<p>I’d been spending much of my spare time working on my open source project <a href=\"https://github.com/textadventures/quest\">Quest</a>, a system that lets non-programmers write text adventure games, and I knew that teachers were starting to use it in their classrooms, so I thought there might be some opportunity there to make some money out of it.</p>\n<p>To be honest, quitting my job to focus on building a text adventure engine did seem kind of silly – but the iPad had just been released, and I was wondering if interactive ebooks might become a thing. If so then maybe I would find myself in the right place at the right time. All the best ideas are kind of hard to distinguish from ridiculous ones, and there was only one way to find out on which side of that dividing line this fell.</p>\n<p>And that was really the extent of my “business plan” – I didn’t think it through in more detail than that. It was more a case of “what’s the worst that could happen?” And the worst case scenario didn’t seem too bad – I’d quit my job working as a VB6 developer, but if I wanted another crappy developer job then it wouldn’t be that difficult to find one. What I wanted was a good job, and the best way to find one was to increase my skills.</p>\n<p>Being quite a frugal person I happened to have enough money saved up that, even if I didn’t have any income for a year or so, it wouldn’t be a big problem.</p>\n<h2>I made this</h2>\n<p><img src=\"https://alexwarren.uk/images/2015/ZcCKI.png\" alt=\"Text Adventures\"></p>\n<p>So I spent most of the next four years doing various things with Quest and interactive fiction:</p>\n<ul>\n<li>I finished my Quest rewrite, and kept on iterating with new releases, turning it from a Windows desktop application into a web app</li>\n<li>I massively expanded and improved my website, turning it into a hub for all kinds of text-based games</li>\n<li>I built a new product for schools using text adventures in the classroom</li>\n<li>I ran workshops in schools getting kids to create their own games</li>\n<li>I experimented with being a publisher, turning text games into mobile apps</li>\n<li>I wrote my own game which was an experiment in what a modern text adventure might look like</li>\n<li>I worked with writers and filmmakers on a project for a book publisher, building a promotional text game for a new sci-fi novel</li>\n</ul>\n<p>I made small amounts of money here and there, with a larger amount of money from a few months of contract .NET developer work to top up my finances. Ultimately though, my money ran out.</p>\n<p>I had failed to build a successful business, but I had spent years doing work that I enjoyed, and I now had a vastly increased set of skills and a much more interesting CV. I had built some awesome stuff – now I just needed to follow the cycle around, to tell people about it and try to get an awesome job. That’s what I’ll be talking about in <a href=\"/2015/11/24/how-to-be-awesome-part-2\">part 2</a> of this post.</p>\n<p>Just in case you think the only way to build awesome stuff is to quit your job and spend four years trying to build an entire business – you don’t <em>have</em> to be as batshit insane as me. You can build stuff in your spare time – I still do, it just takes a little bit longer. Build something you’re interested in building, something you can be proud of, and ship it. It’s the best way to learn, and it’s the best way to upgrade your CV.</p>\n\n",
      "PostDate": "2021-04-28T12:53:01.5381261Z",
      "LastEditDate": "2021-04-28T13:23:59.2907405Z",
      "link": null
    },
    {
      "PostId": "f6c1b63c-c91c-4a82-a2c6-ee795aee2de4",
      "UserId": 518866,
      "Username": "K.V.",
      "AvatarUrl": "https://secure.gravatar.com/avatar/a97688aadc8152436180b511021e94a7?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "# Looking for a new owner for textadventures.co.uk and Quest\r\n7 December 2016\r\n<br/>\r\n<div class=\"text-muted\">This post was originally published on the <a href=\"http://blog.textadventures.co.uk/2016/12/07/looking-for-a-new-owner-for-textadventures-co-uk-and-quest/\">textadventures.co.uk blog</a>.</div>\r\n<br/>\r\n<p>I have been developing <a href=\"https://github.com/textadventures/quest\">Quest</a> and <a href=\"http://textadventures.co.uk/\">textadventures.co.uk</a> for a long time. It started off as a summer coding project when I was a teenager and wanted to send stupid text adventure games to a friend. Over the last couple of decades it has turned into something far bigger than I could have imagined.</p>\r\n\r\n<p>It has alternated between hobby and full-time job, and tinkering with it all these years has taught me huge amounts about writing software, helping turn me into the developer that I am today.</p>\r\n\r\n<p>I’m proud of what I’ve built - various open source projects that have enabled hundreds of thousands of people to build games for the first time, and a website that has become the top hit on Google for “text adventures” and attracts 3,500 users per day, a number which continues to increase.</p>\r\n\r\n<p>The software and community around it are in great shape, and I think they have a great future. But the time has come for somebody else to take charge - I want to focus my energy on new projects, and hand over what I’ve built to somebody else who has the passion to drive things forward.</p>\r\n\r\n<p>I am looking for people interested in taking this on. There are quite a lot of different bits, and these wouldn’t all necessarily need to go to the same person or company - things could be split up if that looks like the best option. I am open to all suggestions and proposals - my main concern above all else is finding the best home (or homes) for the long-term future for these projects. I am not looking for money and I’m happy to do everything I can to ensure a smooth handover.</p>\r\n\r\n<p>If you’re interested, please email me at <s><b>link removed</b></s>.</p>\r\n<h2>What if new owners can't be found?</h2>\r\n<p>I really hope that people from the interactive fiction community will want to see Quest and textadventures.co.uk continue, so if you can possibly help then please get in touch. Do you want to keep textadventures.co.uk alive for the community that loves it? Could you take it forward to bigger and better things?</p>\r\n\r\n<p>If no suitable new owners come forward by 28th February 2017, then sadly I will have to start the process of shutting down the website and forums. Initially they will become read-only, and I will look to export the data elsewhere (the IF Archive or the Internet Archive) before closing the sites completely.</p>\r\n\r\n<p>Quest and Squiffy will remain accessible on GitHub but there will be no further updates. The software will still be able to be downloaded for offline use, but the online web-based versions would no longer be available. The GitHub repositories themselves would probably be transferred to the IFTF.</p>\r\n<h2>The different bits</h2>\r\n<ul>\r\n\t<li><a href=\"https://github.com/textadventures/quest\">Quest</a></li>\r\n\t<li><a href=\"https://github.com/textadventures/squiffy\">Squiffy</a></li>\r\n\t<li><a href=\"https://github.com/textadventures/questkit\">QuestKit</a></li>\r\n\t<li>textadventures.co.uk:\r\n<ul>\r\n\t<li>The <a href=\"http://textadventures.co.uk/\">site</a> itself, where people can upload games (not just Quest and Squiffy games, but Inklewriter, Twine and Inform games too) and post reviews and comments</li>\r\n\t<li>The <a href=\"http://textadventures.co.uk/forum\">forums</a></li>\r\n\t<li>Online player and editor for Quest games</li>\r\n\t<li>Online editor for Squiffy</li>\r\n</ul>\r\n</li>\r\n\t<li><a href=\"http://activelit.com/\">ActiveLit</a></li>\r\n\t<li>Social media accounts:\r\n<ul>\r\n\t<li><a href=\"https://twitter.com/textadv\">@textadv</a></li>\r\n\t<li><a href=\"https://twitter.com/activelit\">@activelit</a></li>\r\n\t<li><a href=\"https://www.facebook.com/textadventures\">facebook.com/textadventures</a></li>\r\n</ul>\r\n</li>\r\n\t<li>Various domain names:\r\n<ul>\r\n\t<li>textadventures.co.uk</li>\r\n\t<li>textadventures.uk</li>\r\n\t<li>textadventures.co</li>\r\n\t<li>textadventures.net</li>\r\n\t<li>textadventur.es</li>\r\n\t<li>textadventure.co.uk</li>\r\n\t<li>activelit.com</li>\r\n\t<li>activelit.co.uk</li>\r\n</ul>\r\n</li>\r\n</ul>\r\n<h2>Some numbers</h2>\r\n<p>textadventures.co.uk according to Google Analytics:</p>\r\n<ul>\r\n\t<li>~3,500 unique visitors/day</li>\r\n\t<li>83,986 unique visitors in November 2016 (a 14% increase on November 2015)</li>\r\n\t<li>428,119 page views in November 2016 (18% increase on November 2015)</li>\r\n\t<li>Average session duration 03m 41s</li>\r\n\t<li>66% of sessions are from new users, 34% returning</li>\r\n</ul>\r\n<p>Users:</p>\r\n<ul>\r\n\t<li>161,203 registered users (115,038 with confirmed email addresses)</li>\r\n\t<li>In November 2016, new sign-ups from 4,746 users (3,190 with confirmed email addresses)</li>\r\n</ul>\r\n<p>Games:</p>\r\n<ul>\r\n\t<li>13,582 games (8,216 are public) of which:\r\n<ul>\r\n\t<li>Quest games: 9,892</li>\r\n\t<li>HTML (Twine, Squiffy etc.) and Inform games: 1,621</li>\r\n\t<li>Inklewriter games: 1,321</li>\r\n\t<li>External links (game listings from IFDB, Choice of Games etc): 757</li>\r\n</ul>\r\n</li>\r\n\t<li>In November 2016, 394 new games (136 are public)</li>\r\n\t<li>8,317 reviews and 13,414 comments</li>\r\n\t<li>In November 2016, 197 new reviews and 336 new comments</li>\r\n\t<li>94,575 games started in Quest's online editor</li>\r\n</ul>\r\n<p>Social Media:</p>\r\n<ul>\r\n\t<li>@TextAdv on Twitter: 921 followers</li>\r\n\t<li>textadventures on Facebook: 1076 likes</li>\r\n</ul>\r\n<p>Income and Expenses:</p>\r\n\r\n<p>AdSense earns about £50/month for the limited advertising which is currently on the site.</p>\r\n\r\n<p>The main costs are for Azure at ~£70/month, and the VPS (hosted by OVH) which runs the Quest online player and editor at £13.59/month ex VAT.</p>\r\n\r\n<p>(On Azure, I’ve been getting a £65/month free credit, so the actual amount billed averages only about £5. This means the total cost for running the site has been about £20/month, which has been entirely offset from the Adsense income.)</p>\r\n<h2></h2>",
      "EditableFormat": "markdown",
      "HTML": "<h1>Looking for a new owner for textadventures.co.uk and Quest</h1>\n<p>7 December 2016<br>\n<br></p>\n<div>This post was originally published on the <a href=\"http://blog.textadventures.co.uk/2016/12/07/looking-for-a-new-owner-for-textadventures-co-uk-and-quest/\">textadventures.co.uk blog</a>.</div>\n<br>\n<p>I have been developing <a href=\"https://github.com/textadventures/quest\">Quest</a> and <a href=\"http://textadventures.co.uk/\">textadventures.co.uk</a> for a long time. It started off as a summer coding project when I was a teenager and wanted to send stupid text adventure games to a friend. Over the last couple of decades it has turned into something far bigger than I could have imagined.</p>\n<p>It has alternated between hobby and full-time job, and tinkering with it all these years has taught me huge amounts about writing software, helping turn me into the developer that I am today.</p>\n<p>I’m proud of what I’ve built - various open source projects that have enabled hundreds of thousands of people to build games for the first time, and a website that has become the top hit on Google for “text adventures” and attracts 3,500 users per day, a number which continues to increase.</p>\n<p>The software and community around it are in great shape, and I think they have a great future. But the time has come for somebody else to take charge - I want to focus my energy on new projects, and hand over what I’ve built to somebody else who has the passion to drive things forward.</p>\n<p>I am looking for people interested in taking this on. There are quite a lot of different bits, and these wouldn’t all necessarily need to go to the same person or company - things could be split up if that looks like the best option. I am open to all suggestions and proposals - my main concern above all else is finding the best home (or homes) for the long-term future for these projects. I am not looking for money and I’m happy to do everything I can to ensure a smooth handover.</p>\n<p>If you’re interested, please email me at <s><b>link removed</b></s>.</p>\n<h2>What if new owners can't be found?</h2>\n<p>I really hope that people from the interactive fiction community will want to see Quest and textadventures.co.uk continue, so if you can possibly help then please get in touch. Do you want to keep textadventures.co.uk alive for the community that loves it? Could you take it forward to bigger and better things?</p>\n<p>If no suitable new owners come forward by 28th February 2017, then sadly I will have to start the process of shutting down the website and forums. Initially they will become read-only, and I will look to export the data elsewhere (the IF Archive or the Internet Archive) before closing the sites completely.</p>\n<p>Quest and Squiffy will remain accessible on GitHub but there will be no further updates. The software will still be able to be downloaded for offline use, but the online web-based versions would no longer be available. The GitHub repositories themselves would probably be transferred to the IFTF.</p>\n<h2>The different bits</h2>\n<ul>\n\t<li><a href=\"https://github.com/textadventures/quest\">Quest</a></li>\n\t<li><a href=\"https://github.com/textadventures/squiffy\">Squiffy</a></li>\n\t<li><a href=\"https://github.com/textadventures/questkit\">QuestKit</a></li>\n\t<li>textadventures.co.uk:\n<ul>\n\t<li>The <a href=\"http://textadventures.co.uk/\">site</a> itself, where people can upload games (not just Quest and Squiffy games, but Inklewriter, Twine and Inform games too) and post reviews and comments</li>\n\t<li>The <a href=\"http://textadventures.co.uk/forum\">forums</a></li>\n\t<li>Online player and editor for Quest games</li>\n\t<li>Online editor for Squiffy</li>\n</ul>\n</li>\n\t<li><a href=\"http://activelit.com/\">ActiveLit</a></li>\n\t<li>Social media accounts:\n<ul>\n\t<li><a href=\"https://twitter.com/textadv\">@textadv</a></li>\n\t<li><a href=\"https://twitter.com/activelit\">@activelit</a></li>\n\t<li><a href=\"https://www.facebook.com/textadventures\">facebook.com/textadventures</a></li>\n</ul>\n</li>\n\t<li>Various domain names:\n<ul>\n\t<li>textadventures.co.uk</li>\n\t<li>textadventures.uk</li>\n\t<li>textadventures.co</li>\n\t<li>textadventures.net</li>\n\t<li>textadventur.es</li>\n\t<li>textadventure.co.uk</li>\n\t<li>activelit.com</li>\n\t<li>activelit.co.uk</li>\n</ul>\n</li>\n</ul>\n<h2>Some numbers</h2>\n<p>textadventures.co.uk according to Google Analytics:</p>\n<ul>\n\t<li>~3,500 unique visitors/day</li>\n\t<li>83,986 unique visitors in November 2016 (a 14% increase on November 2015)</li>\n\t<li>428,119 page views in November 2016 (18% increase on November 2015)</li>\n\t<li>Average session duration 03m 41s</li>\n\t<li>66% of sessions are from new users, 34% returning</li>\n</ul>\n<p>Users:</p>\n<ul>\n\t<li>161,203 registered users (115,038 with confirmed email addresses)</li>\n\t<li>In November 2016, new sign-ups from 4,746 users (3,190 with confirmed email addresses)</li>\n</ul>\n<p>Games:</p>\n<ul>\n\t<li>13,582 games (8,216 are public) of which:\n<ul>\n\t<li>Quest games: 9,892</li>\n\t<li>HTML (Twine, Squiffy etc.) and Inform games: 1,621</li>\n\t<li>Inklewriter games: 1,321</li>\n\t<li>External links (game listings from IFDB, Choice of Games etc): 757</li>\n</ul>\n</li>\n\t<li>In November 2016, 394 new games (136 are public)</li>\n\t<li>8,317 reviews and 13,414 comments</li>\n\t<li>In November 2016, 197 new reviews and 336 new comments</li>\n\t<li>94,575 games started in Quest's online editor</li>\n</ul>\n<p>Social Media:</p>\n<ul>\n\t<li>@TextAdv on Twitter: 921 followers</li>\n\t<li>textadventures on Facebook: 1076 likes</li>\n</ul>\n<p>Income and Expenses:</p>\n<p>AdSense earns about £50/month for the limited advertising which is currently on the site.</p>\n<p>The main costs are for Azure at ~£70/month, and the VPS (hosted by OVH) which runs the Quest online player and editor at £13.59/month ex VAT.</p>\n<p>(On Azure, I’ve been getting a £65/month free credit, so the actual amount billed averages only about £5. This means the total cost for running the site has been about £20/month, which has been entirely offset from the Adsense income.)</p>\n<h2></h2>\n\n",
      "PostDate": "2021-04-28T13:17:31.0301744Z",
      "LastEditDate": "2021-04-28T13:28:05.4655911Z",
      "link": null
    },
    {
      "PostId": "26cfacd1-76a4-4b56-b11a-508b353012aa",
      "UserId": 518866,
      "Username": "K.V.",
      "AvatarUrl": "https://secure.gravatar.com/avatar/a97688aadc8152436180b511021e94a7?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "# [Developers needed for textadventures.co.uk and&nbsp;Quest](https://blog.textadventures.co.uk/2016/12/12/developers-needed/)\r\n12 December 2016\r\n<p>This is a follow up to <a href=\"https://blog.textadventures.co.uk/2016/12/07/looking-for-a-new-owner-for-textadventures-co-uk-and-quest/\">Looking for a new owner for textadventures.co.uk and Quest</a>.</p>\r\n<p>Thanks to all of you who have got in touch so far. A lot of people have asked about what would be involved in taking over and running textadventures.co.uk and/or Quest, so this post is to go into a bit more detail about how things are set up and how the work might be split up across different people.</p>\r\n<p>For a smooth transition, I need to find people to fill these four roles:</p>\r\n<ul>\r\n<li>One or more <strong>.NET web developers</strong> for textadventures.co.uk and/or ActiveLit, familiar with Azure and ASP.NET MVC and with front-end development using JavaScript and Bootstrap.</li>\r\n<li>One or more <strong>JavaScript developers</strong> for Quest 6, Squiffy and/or QuestKit. Ideally familiar with back-end and front-end web development, and desktop development using Electron.</li>\r\n<li>One or more <strong>.NET developers</strong> familiar with <strong>both desktop and web development</strong> for Quest 5. Ideally familiar with both C# and VB.NET.</li>\r\n<li>A <strong>server admin</strong> to keep the current browser version of Quest alive (both the Player and the Editor). Needs to know how to run a Windows server. This is currently running on a VPS at OVH. (This is just for the online player and editor &#8211; running textadventures.co.uk itself will require a developer familiar with Azure. Eventually if both the Quest Player and Editor are rewritten to use JavaScript, the server admin role becomes redundant).</li>\r\n</ul>\r\n<p>Of course any of these roles can be combined &#8211; after all, they&#8217;ve all been done by me up until now.</p>\r\n<h2>textadventures.co.uk and ActiveLit sites</h2>\r\n<p><a href=\"http://textadventures.co.uk\">textadventures.co.uk</a> and <a href=\"http://activelit.com\">ActiveLit</a> run on the <a href=\"https://azure.microsoft.com/en-gb/services/app-service/\">Azure App Service</a> (formerly known as Azure Websites). Data is stored in <a href=\"https://azure.microsoft.com/en-gb/services/sql-database/\">Azure SQL</a> and in Azure <a href=\"https://azure.microsoft.com/en-gb/services/storage/blobs/\">blob</a> and <a href=\"https://azure.microsoft.com/en-gb/services/storage/tables/\">table storage</a>.</p>\r\n<p>The web-accessible blobs (for game downloads, cover art etc.) are behind a Cloudflare CDN.</p>\r\n<p>The code uses C# and ASP.NET MVC. The front-end uses Bootstrap, JQuery and a little bit of React.</p>\r\n<p>ActiveLit runs alongside textadventures.co.uk on the same Azure infrastructure and talks to the same database.</p>\r\n<h2>Quest 5 &amp; 6</h2>\r\n<p>There are two parts to Quest &#8211; the Player and the Editor. There are also two ways of using Quest &#8211; via the web, and via a downloadable Windows desktop application.</p>\r\n<p>The current version is Quest 5, and I also made a start on Quest 6 which is architected quite differently. The new version rewrites the Player back-end to use JavaScript, which means the web version requires no server component (making it much faster, infinitely scalable, distributable on any website, and an end to time-outs while playing), and the desktop version will be cross-platform for the first time (packaged using Electron for Windows, Mac and Linux).</p>\r\n<p>To take on Quest 6, I&#8217;m looking for a developer who has experience using the modern JavaScript ecosystem (npm, TypeScript, gulp, webpack and all of that kind of thing). I will work with this person to help get Quest 6 shipped. (It doesn&#8217;t make sense for me to continue working on this project without somebody to hand it over to, because it will of course need to be maintained after it is shipped). Quest 6 lives in the <a href=\"https://github.com/textadventures/quest/tree/v6\">v6 branch</a> on GitHub.</p>\r\n<p>After Quest 6 is shipped, rewriting the Editor to use JavaScript would also be really useful. That would be a project for the new Quest 6 maintainer, or maybe even someone else. If Quest could be taken to the point where both the Player and the Editor were shipping as 100% JavaScript applications, that would be a massive simplification of the Quest architecture.</p>\r\n<p>Quest&#8217;s long-term future lies with Quest 6, but it would be good if we can find somebody to maintain <a href=\"https://github.com/textadventures/quest\">Quest 5</a> for the time being, not least because even if/when Quest 6 ships, it will still be using the same .NET-based Editor that Quest 5 uses.</p>\r\n<p>I&#8217;ve updated the <a href=\"http://docs.textadventures.co.uk/quest/developers.html\">Developers</a> documentation page on the Quest docs site to describe how the various projects that make up Quest 5 together. It is not an easy thing to pick up &#8211; there&#8217;s a lot of code there, and a mixture of languages and technologies reflecting my changing tastes and experience over time. It&#8217;s stable though, and it shouldn&#8217;t require big changes because if the Player and Editor both get rewritten using JavaScript then all of it will become obsolete.</p>\r\n<h2>Proposals</h2>\r\n<p>If you&#8217;re interested in taking on one or more of these roles, please email me at <s><b>link removed</b></s>.</p>\r\n<p>To reiterate, I am not looking for money. I want to hand these over to somebody (or a group of people) with a passion for IF and a vision for where these products could go in the future. That vision doesn&#8217;t necessarily have to agree with my vision (that&#8217;s what stepping back is about) &#8211; this is a massive opportunity for somebody to take over running a popular website and IF development system. textadventures.co.uk is <em>the</em> place people come when they search for text adventures on the web, so it&#8217;s a big gateway to the world of interactive fiction. Taking on the website doesn&#8217;t have to be about taking on Quest.</p>\r\n<p>I&#8217;ve only got Alexa rankings to prove it (so take them with a pinch of salt) but <a href=\"http://www.alexa.com/siteinfo/textadventures.co.uk\">the site appears to be bigger</a> than other IF sites like <a href=\"http://www.alexa.com/siteinfo/tads.org\">IFDB</a>, <a href=\"http://www.alexa.com/siteinfo/intfiction.org\">intfiction.org</a> and <a href=\"http://www.alexa.com/siteinfo/choiceofgames.com\">Choice of Games</a>. It&#8217;s how a lot of people start out making text adventures &#8211; in fact, it&#8217;s introduced a lot of people to programming in the first place. It&#8217;s used by schools to get children into coding and creative writing.</p>\r\n<p>Thanks again for responses so far. If you can&#8217;t help out yourself, please help spread the word to somebody who might be able to take this on and ensure it has a future.</p>\r\n",
      "EditableFormat": "markdown",
      "HTML": "<h1><a href=\"https://blog.textadventures.co.uk/2016/12/12/developers-needed/\">Developers needed for textadventures.co.uk and&nbsp;Quest</a></h1>\n<p>12 December 2016</p>\n<p>This is a follow up to <a href=\"https://blog.textadventures.co.uk/2016/12/07/looking-for-a-new-owner-for-textadventures-co-uk-and-quest/\">Looking for a new owner for textadventures.co.uk and Quest</a>.</p>\n<p>Thanks to all of you who have got in touch so far. A lot of people have asked about what would be involved in taking over and running textadventures.co.uk and/or Quest, so this post is to go into a bit more detail about how things are set up and how the work might be split up across different people.</p>\n<p>For a smooth transition, I need to find people to fill these four roles:</p>\n<ul>\n<li>One or more <strong>.NET web developers</strong> for textadventures.co.uk and/or ActiveLit, familiar with Azure and ASP.NET MVC and with front-end development using JavaScript and Bootstrap.</li>\n<li>One or more <strong>JavaScript developers</strong> for Quest 6, Squiffy and/or QuestKit. Ideally familiar with back-end and front-end web development, and desktop development using Electron.</li>\n<li>One or more <strong>.NET developers</strong> familiar with <strong>both desktop and web development</strong> for Quest 5. Ideally familiar with both C# and VB.NET.</li>\n<li>A <strong>server admin</strong> to keep the current browser version of Quest alive (both the Player and the Editor). Needs to know how to run a Windows server. This is currently running on a VPS at OVH. (This is just for the online player and editor – running textadventures.co.uk itself will require a developer familiar with Azure. Eventually if both the Quest Player and Editor are rewritten to use JavaScript, the server admin role becomes redundant).</li>\n</ul>\n<p>Of course any of these roles can be combined – after all, they’ve all been done by me up until now.</p>\n<h2>textadventures.co.uk and ActiveLit sites</h2>\n<p><a href=\"http://textadventures.co.uk/\">textadventures.co.uk</a> and <a href=\"http://activelit.com/\">ActiveLit</a> run on the <a href=\"https://azure.microsoft.com/en-gb/services/app-service/\">Azure App Service</a> (formerly known as Azure Websites). Data is stored in <a href=\"https://azure.microsoft.com/en-gb/services/sql-database/\">Azure SQL</a> and in Azure <a href=\"https://azure.microsoft.com/en-gb/services/storage/blobs/\">blob</a> and <a href=\"https://azure.microsoft.com/en-gb/services/storage/tables/\">table storage</a>.</p>\n<p>The web-accessible blobs (for game downloads, cover art etc.) are behind a Cloudflare CDN.</p>\n<p>The code uses C# and ASP.NET MVC. The front-end uses Bootstrap, JQuery and a little bit of React.</p>\n<p>ActiveLit runs alongside textadventures.co.uk on the same Azure infrastructure and talks to the same database.</p>\n<h2>Quest 5 &amp; 6</h2>\n<p>There are two parts to Quest – the Player and the Editor. There are also two ways of using Quest – via the web, and via a downloadable Windows desktop application.</p>\n<p>The current version is Quest 5, and I also made a start on Quest 6 which is architected quite differently. The new version rewrites the Player back-end to use JavaScript, which means the web version requires no server component (making it much faster, infinitely scalable, distributable on any website, and an end to time-outs while playing), and the desktop version will be cross-platform for the first time (packaged using Electron for Windows, Mac and Linux).</p>\n<p>To take on Quest 6, I’m looking for a developer who has experience using the modern JavaScript ecosystem (npm, TypeScript, gulp, webpack and all of that kind of thing). I will work with this person to help get Quest 6 shipped. (It doesn’t make sense for me to continue working on this project without somebody to hand it over to, because it will of course need to be maintained after it is shipped). Quest 6 lives in the <a href=\"https://github.com/textadventures/quest/tree/v6\">v6 branch</a> on GitHub.</p>\n<p>After Quest 6 is shipped, rewriting the Editor to use JavaScript would also be really useful. That would be a project for the new Quest 6 maintainer, or maybe even someone else. If Quest could be taken to the point where both the Player and the Editor were shipping as 100% JavaScript applications, that would be a massive simplification of the Quest architecture.</p>\n<p>Quest’s long-term future lies with Quest 6, but it would be good if we can find somebody to maintain <a href=\"https://github.com/textadventures/quest\">Quest 5</a> for the time being, not least because even if/when Quest 6 ships, it will still be using the same .NET-based Editor that Quest 5 uses.</p>\n<p>I’ve updated the <a href=\"http://docs.textadventures.co.uk/quest/developers.html\">Developers</a> documentation page on the Quest docs site to describe how the various projects that make up Quest 5 together. It is not an easy thing to pick up – there’s a lot of code there, and a mixture of languages and technologies reflecting my changing tastes and experience over time. It’s stable though, and it shouldn’t require big changes because if the Player and Editor both get rewritten using JavaScript then all of it will become obsolete.</p>\n<h2>Proposals</h2>\n<p>If you’re interested in taking on one or more of these roles, please email me at <s><b>link removed</b></s>.</p>\n<p>To reiterate, I am not looking for money. I want to hand these over to somebody (or a group of people) with a passion for IF and a vision for where these products could go in the future. That vision doesn’t necessarily have to agree with my vision (that’s what stepping back is about) – this is a massive opportunity for somebody to take over running a popular website and IF development system. textadventures.co.uk is <em>the</em> place people come when they search for text adventures on the web, so it’s a big gateway to the world of interactive fiction. Taking on the website doesn’t have to be about taking on Quest.</p>\n<p>I’ve only got Alexa rankings to prove it (so take them with a pinch of salt) but <a href=\"http://www.alexa.com/siteinfo/textadventures.co.uk\">the site appears to be bigger</a> than other IF sites like <a href=\"http://www.alexa.com/siteinfo/tads.org\">IFDB</a>, <a href=\"http://www.alexa.com/siteinfo/intfiction.org\">intfiction.org</a> and <a href=\"http://www.alexa.com/siteinfo/choiceofgames.com\">Choice of Games</a>. It’s how a lot of people start out making text adventures – in fact, it’s introduced a lot of people to programming in the first place. It’s used by schools to get children into coding and creative writing.</p>\n<p>Thanks again for responses so far. If you can’t help out yourself, please help spread the word to somebody who might be able to take this on and ensure it has a future.</p>\n\n",
      "PostDate": "2021-04-28T13:32:31.6909254Z",
      "LastEditDate": "2021-04-28T13:37:05.5653178Z",
      "link": null
    },
    {
      "PostId": "4bcf21ab-07a9-4127-814b-3fd80e561173",
      "UserId": 518866,
      "Username": "K.V.",
      "AvatarUrl": "https://secure.gravatar.com/avatar/a97688aadc8152436180b511021e94a7?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "# [Meet the new textadventures.co.uk team](https://blog.textadventures.co.uk/2017/01/11/meet-the-new-textadventures-co-uk-team/)\r\n11 January 2017\r\n<br/>\r\n<p>I announced last month that I was handing over textadventures.co.uk and Quest. Many thanks to everybody who got in touch to volunteer to help. I was really pleased that so many people want to see these projects continue into the future. I am now happy to announce that we have a new team in place!</p>\r\n<p><strong>Luis Felipe Morales</strong> will be taking over the <strong>textadventures.co.uk</strong> and <strong>ActiveLit</strong> websites, and also <strong>Squiffy</strong>. A programmer since the 1980s, Luis has been involved with the Spanish interactive fiction community since he was young. He has maintained and created several internet portals and now works as a freelancer.</p>\r\n<p><strong>Jay Nabonne</strong> and <strong>Andy a.k.a The Pixie</strong> will be taking over development of <strong>Quest</strong>. Both have been very active members of the forums for a long time. Jay is a lifelong programmer and game player who is interested in not only creating games but helping others to do the same. A California native, he now lives with his wife in the UK. Andy has been playing and creating text adventure games since the Eighties, has been using Quest for over five years and has written various guides and libraries for the system.</p>\r\n<p><strong>Greg Fenton</strong> and <strong>Nathan Clive Gerard</strong> will each be <strong>running servers</strong> for Quest&#8217;s WebPlayer and WebEditor. Greg is a developer who wrote his first text adventure in dBase III on an IBM PC back in the very late 1980s shortly after leaving high school. Nathan is a regular player of text adventures from the UK (currently living in the USA), who spends his days setting up and looking after web servers in the cloud.</p>\r\n<p>I&#8217;ll be working with each of them over the coming months to ensure a smooth transition. Please welcome them aboard!</p>\r\n",
      "EditableFormat": "markdown",
      "HTML": "<h1><a href=\"https://blog.textadventures.co.uk/2017/01/11/meet-the-new-textadventures-co-uk-team/\">Meet the new textadventures.co.uk team</a></h1>\n<p>11 January 2017<br>\n<br></p>\n<p>I announced last month that I was handing over textadventures.co.uk and Quest. Many thanks to everybody who got in touch to volunteer to help. I was really pleased that so many people want to see these projects continue into the future. I am now happy to announce that we have a new team in place!</p>\n<p><strong>Luis Felipe Morales</strong> will be taking over the <strong>textadventures.co.uk</strong> and <strong>ActiveLit</strong> websites, and also <strong>Squiffy</strong>. A programmer since the 1980s, Luis has been involved with the Spanish interactive fiction community since he was young. He has maintained and created several internet portals and now works as a freelancer.</p>\n<p><strong>Jay Nabonne</strong> and <strong>Andy a.k.a The Pixie</strong> will be taking over development of <strong>Quest</strong>. Both have been very active members of the forums for a long time. Jay is a lifelong programmer and game player who is interested in not only creating games but helping others to do the same. A California native, he now lives with his wife in the UK. Andy has been playing and creating text adventure games since the Eighties, has been using Quest for over five years and has written various guides and libraries for the system.</p>\n<p><strong>Greg Fenton</strong> and <strong>Nathan Clive Gerard</strong> will each be <strong>running servers</strong> for Quest’s WebPlayer and WebEditor. Greg is a developer who wrote his first text adventure in dBase III on an IBM PC back in the very late 1980s shortly after leaving high school. Nathan is a regular player of text adventures from the UK (currently living in the USA), who spends his days setting up and looking after web servers in the cloud.</p>\n<p>I’ll be working with each of them over the coming months to ensure a smooth transition. Please welcome them aboard!</p>\n\n",
      "PostDate": "2021-04-28T13:34:49.2999701Z",
      "LastEditDate": "2021-04-28T13:36:07.662035Z",
      "link": null
    },
    {
      "PostId": "e4914730-3a50-4b3b-9633-9a5b88a94f22",
      "UserId": 518866,
      "Username": "K.V.",
      "AvatarUrl": "https://secure.gravatar.com/avatar/a97688aadc8152436180b511021e94a7?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "# [A History of Quest](https://docs.textadventures.co.uk/quest/history.html)\r\n by The Pixie, from the documentation\r\n\r\n---\r\nWhen I took over Quest, I was intrigued to see its history. Alex did some retrospectives in some blog posts, allowing a timeline to be constructed.\r\n\r\nThe roots of Quest, up to Quest 1.0, from Alex's first game when he was 11 to the first Quest.\r\nhttps://blog.textadventures.co.uk/2013/11/07/quest-is-15/\r\n\r\nFrom Quest 1.0 to 3.0, seeing the introduction of a GUI for writing games.\r\nhttps://blog.textadventures.co.uk/2013/11/07/quest-is-15/\r\n\r\nFrom Quest 3.0 to 3.5, via multi-player.\r\nhttps://blog.textadventures.co.uk/2013/11/27/15-years-of-quest-part-3-2000-2004-experimenting-with-multi-player/\r\n\r\nPart 3 indicated that he intended to write more, but I have not been able to find it. His next blog post indicates he got a proper job, so perhaps he never got around to it.\r\n\r\n\r\nEarlier Quest\r\n-------------\r\n\r\nQuest versions 1 to 4 were a development of the same system. Quest 1 consisted of a player and a file format - a format quite unlike the XML format of Quest 5, but one that would be developed across the first four version.\r\n\r\nWith Quest 2, we got an editor and an update to the player. The player even at this time looked like the modern interface.\r\n\r\n- 07/Nov/98 Quest 1.0 released\r\n\r\n- ??/Aug/99 Quest 2.0 released, with beta version of the QDK editor\r\n\r\n- ??/Nov/99 Quest 2.1 released, with play screen laid out as we know it today\r\n\r\n- ??/Jan/01 Quest 2.19 released\r\n\r\n- ??/Sep/01 Quest 3.0 released (with a short-lived multiplayer option)\r\n\r\n- ??/Jun/02 Quest 3.1 released\r\n\r\n- 29/Jun/03 First forum post (or first I could find anyway)\r\n\r\n- ??/Dec/03 Quest 3.5 released\r\n\r\n- ??/Jan/04 QuestNet Server first and only version released\r\n\r\n- 17/Jan/07 Quest 4.0 released\r\n\r\n- 02/Feb/07 Quest web player goes beta. Previously players could only download games to play, now they could play them in the browser.\r\n\r\nQuest 5\r\n--------\r\n\r\nQuest 5 was a big change. I get the impression the code was entirely written, now using C#. The file format was entirely different, using XML. The new interface was HTML. Another big change was that Quest went open source, and was now free to both edit and play.\r\nhttps://blog.textadventures.co.uk/2011/08/30/quest-5-0-is-out-now/\r\n\r\nI joined the Quest community in the Summer of 2011, when the beta release of Quest 5 was out.\r\n\r\n- 17/Jul/11 Quest 5 tutorial released (Bob and the defibrillator featured in the tutorial for earlier versions by the way).\r\n\r\n- 01/Aug/11 My first [forum post](http://textadventures.co.uk/forum/quest/topic/2457/q5-order-of-objects)!\r\n\r\n- 30/Aug/11 Quest 5.0 released\r\n\r\n- 11/Jan/12 Quest 5.1 released\r\n\r\n- 12/May/12 Quest 5.2 released (a web version of the editor)\r\n\r\n- 14/Jan/13 Quest 5.3 released (updated interface using Chrome, web fonts, map, changeable POV, light/dark)\r\n\r\n- 28/Mar/13 Quest 5.4 released (text processor, code view for scripts, JS object; some XML attribute names changed - which can cause problems if opening games from earlier versions)\r\n\r\n- 05/May/13 Quest 5.4.1 released (exits with scripts need an attribute set to make the script run)\r\n\r\n- 01/Mar/14 Quest 5.5 released (customisable UI, the Features tab and a contribution from me)\r\n\r\n- 03/Aug/14 Quest 5.5.1 released\r\n\r\n- ??/Feb/15 Quest 5.6 released (no blog post for some reason, so hard to find what got added, but a forum post indicated it was mostly a bug fix)\r\n\r\n- 19/Sep/16 Quest 5.6.3 released (Alex's last release)\r\n\r\n- 11/Jan/17 Alex officially leaves Quest and textadventures.co.uk\r\n\r\n- 19/Jul/17 Quest 5.7.1 released (there was no official 5.7.0!)\r\n\r\n- 02/Feb/18 Quest 5.7.2 released",
      "EditableFormat": "markdown",
      "HTML": "<h1><a href=\"https://docs.textadventures.co.uk/quest/history.html\">A History of Quest</a></h1>\n<p>by The Pixie, from the documentation</p>\n<hr>\n<p>When I took over Quest, I was intrigued to see its history. Alex did some retrospectives in some blog posts, allowing a timeline to be constructed.</p>\n<p>The roots of Quest, up to Quest 1.0, from Alex's first game when he was 11 to the first Quest.<br>\nhttps://blog.textadventures.co.uk/2013/11/07/quest-is-15/</p>\n<p>From Quest 1.0 to 3.0, seeing the introduction of a GUI for writing games.<br>\nhttps://blog.textadventures.co.uk/2013/11/07/quest-is-15/</p>\n<p>From Quest 3.0 to 3.5, via multi-player.<br>\nhttps://blog.textadventures.co.uk/2013/11/27/15-years-of-quest-part-3-2000-2004-experimenting-with-multi-player/</p>\n<p>Part 3 indicated that he intended to write more, but I have not been able to find it. His next blog post indicates he got a proper job, so perhaps he never got around to it.</p>\n<h2>Earlier Quest</h2>\n<p>Quest versions 1 to 4 were a development of the same system. Quest 1 consisted of a player and a file format - a format quite unlike the XML format of Quest 5, but one that would be developed across the first four version.</p>\n<p>With Quest 2, we got an editor and an update to the player. The player even at this time looked like the modern interface.</p>\n<ul>\n<li>\n<p>07/Nov/98 Quest 1.0 released</p>\n</li>\n<li>\n<p>??/Aug/99 Quest 2.0 released, with beta version of the QDK editor</p>\n</li>\n<li>\n<p>??/Nov/99 Quest 2.1 released, with play screen laid out as we know it today</p>\n</li>\n<li>\n<p>??/Jan/01 Quest 2.19 released</p>\n</li>\n<li>\n<p>??/Sep/01 Quest 3.0 released (with a short-lived multiplayer option)</p>\n</li>\n<li>\n<p>??/Jun/02 Quest 3.1 released</p>\n</li>\n<li>\n<p>29/Jun/03 First forum post (or first I could find anyway)</p>\n</li>\n<li>\n<p>??/Dec/03 Quest 3.5 released</p>\n</li>\n<li>\n<p>??/Jan/04 QuestNet Server first and only version released</p>\n</li>\n<li>\n<p>17/Jan/07 Quest 4.0 released</p>\n</li>\n<li>\n<p>02/Feb/07 Quest web player goes beta. Previously players could only download games to play, now they could play them in the browser.</p>\n</li>\n</ul>\n<h2>Quest 5</h2>\n<p>Quest 5 was a big change. I get the impression the code was entirely written, now using C#. The file format was entirely different, using XML. The new interface was HTML. Another big change was that Quest went open source, and was now free to both edit and play.<br>\nhttps://blog.textadventures.co.uk/2011/08/30/quest-5-0-is-out-now/</p>\n<p>I joined the Quest community in the Summer of 2011, when the beta release of Quest 5 was out.</p>\n<ul>\n<li>\n<p>17/Jul/11 Quest 5 tutorial released (Bob and the defibrillator featured in the tutorial for earlier versions by the way).</p>\n</li>\n<li>\n<p>01/Aug/11 My first <a href=\"http://textadventures.co.uk/forum/quest/topic/2457/q5-order-of-objects\">forum post</a>!</p>\n</li>\n<li>\n<p>30/Aug/11 Quest 5.0 released</p>\n</li>\n<li>\n<p>11/Jan/12 Quest 5.1 released</p>\n</li>\n<li>\n<p>12/May/12 Quest 5.2 released (a web version of the editor)</p>\n</li>\n<li>\n<p>14/Jan/13 Quest 5.3 released (updated interface using Chrome, web fonts, map, changeable POV, light/dark)</p>\n</li>\n<li>\n<p>28/Mar/13 Quest 5.4 released (text processor, code view for scripts, JS object; some XML attribute names changed - which can cause problems if opening games from earlier versions)</p>\n</li>\n<li>\n<p>05/May/13 Quest 5.4.1 released (exits with scripts need an attribute set to make the script run)</p>\n</li>\n<li>\n<p>01/Mar/14 Quest 5.5 released (customisable UI, the Features tab and a contribution from me)</p>\n</li>\n<li>\n<p>03/Aug/14 Quest 5.5.1 released</p>\n</li>\n<li>\n<p>??/Feb/15 Quest 5.6 released (no blog post for some reason, so hard to find what got added, but a forum post indicated it was mostly a bug fix)</p>\n</li>\n<li>\n<p>19/Sep/16 Quest 5.6.3 released (Alex's last release)</p>\n</li>\n<li>\n<p>11/Jan/17 Alex officially leaves Quest and textadventures.co.uk</p>\n</li>\n<li>\n<p>19/Jul/17 Quest 5.7.1 released (there was no official 5.7.0!)</p>\n</li>\n<li>\n<p>02/Feb/18 Quest 5.7.2 released</p>\n</li>\n</ul>\n\n",
      "PostDate": "2021-04-28T13:44:48.4695541Z",
      "LastEditDate": "2021-04-28T13:58:15.7740939Z",
      "link": null
    },
    {
      "PostId": "2e34ad68-aeee-4ec2-ac33-7eebf66cc77a",
      "UserId": 518866,
      "Username": "K.V.",
      "AvatarUrl": "https://secure.gravatar.com/avatar/a97688aadc8152436180b511021e94a7?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "# Quest 5.8.0\r\nhttps://blog.textadventures.co.uk/2018/09/03/quest-5-8-is-out/",
      "EditableFormat": "markdown",
      "HTML": "<h1>Quest 5.8.0</h1>\n<p>https://blog.textadventures.co.uk/2018/09/03/quest-5-8-is-out/</p>\n\n",
      "PostDate": "2021-04-28T14:02:17.9171251Z",
      "LastEditDate": "2021-04-28T14:07:18.7240732Z",
      "link": null
    },
    {
      "PostId": "4d001b21-72a1-447c-be2a-02103e0d15d0",
      "UserId": 518866,
      "Username": "K.V.",
      "AvatarUrl": "https://secure.gravatar.com/avatar/a97688aadc8152436180b511021e94a7?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "# THE FUTURE OF QUEST\r\nhttps://textadventures.co.uk/forum/questkit/topic/t9k4lvtfuuksmwbjpzvm9g/the-future-of-quest",
      "EditableFormat": "markdown",
      "HTML": "<h1>THE FUTURE OF QUEST</h1>\n<p>https://textadventures.co.uk/forum/questkit/topic/t9k4lvtfuuksmwbjpzvm9g/the-future-of-quest</p>\n\n",
      "PostDate": "2021-04-28T14:06:46.7936393Z",
      "LastEditDate": null,
      "link": null
    }
  ]
}
