{
  "Topic": {
    "TopicId": "1619",
    "ForumId": "10",
    "Title": "Problem with Tutorial \"Change/add\"",
    "LastUpdated": "2007-02-27T11:36:18+00:00",
    "ReplyCount": 2
  },
  "Posts": [
    {
      "PostId": "12849",
      "UserId": 0,
      "Username": "Gary1",
      "UserAvatar": null,
      "UserGravatar": "7f1fb3fc97b885a9c96ff18d17224bbb",
      "EditableText": "I apologize for not making my poblem clearer in my previous post.\r\nThe Exercise 12.5 on page 36 of the Tutorial wants the programmer to update the script with a different response if a player repeats &quot;use defibrillator on Bob.&quot;\r\nThe answer to the exercise is at 26.1 on page 72, but I do not understand it. I changed Bob's properties to &quot;not dead&quot; as the Tutorial instructs, but I don't know how to cause a different response to display when the player repeats using the defibrillator on Bob.",
      "EditableFormat": "bbcode",
      "HTML": "I apologize for not making my poblem clearer in my previous post.<br/>The Exercise 12.5 on page 36 of the Tutorial wants the programmer to update the script with a different response if a player repeats &quot;use defibrillator on Bob.&quot;<br/>The answer to the exercise is at 26.1 on page 72, but I do not understand it. I changed Bob's properties to &quot;not dead&quot; as the Tutorial instructs, but I don't know how to cause a different response to display when the player repeats using the defibrillator on Bob.",
      "PostDate": "2007-02-25T18:28:00+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12856",
      "UserId": 0,
      "Username": "Arbutus",
      "UserAvatar": null,
      "UserGravatar": "8592c0fe872d1d1e7468550ad6cf381c",
      "EditableText": "If you change the defibrillator's use script to match that in the tutorial, then [i:11091a2o]you have[/i:11091a2o] updated the script with a different response. When the player repeats &quot;use defibrillator on Bob&quot;, they will see the response: You’ve already revived him and he probably wouldn’t like it much if you used the defibrillator on him again.",
      "EditableFormat": "bbcode",
      "HTML": "If you change the defibrillator's use script to match that in the tutorial, then <span style=\"font-style:italic;\">you have</span> updated the script with a different response. When the player repeats &quot;use defibrillator on Bob&quot;, they will see the response: You’ve already revived him and he probably wouldn’t like it much if you used the defibrillator on him again.",
      "PostDate": "2007-02-27T01:53:46+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12860",
      "UserId": 0,
      "Username": "Alex",
      "UserAvatar": null,
      "UserGravatar": "188b72c5e13327f4fde3989dca7d7d53",
      "EditableText": "Yes, it should probably be made more clear that the script in 26.1 should be entered into the defibrillator's &quot;use&quot; script.",
      "EditableFormat": "bbcode",
      "HTML": "Yes, it should probably be made more clear that the script in 26.1 should be entered into the defibrillator's &quot;use&quot; script.",
      "PostDate": "2007-02-27T11:36:18+00:00",
      "LastEditDate": null
    }
  ]
}
