{
  "Topic": {
    "TopicId": "1648",
    "ForumId": "5",
    "Title": "Gold & Glory: Chapter 1 A Dark and Stormy Knight",
    "LastUpdated": "2007-03-22T05:24:06+00:00",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "13135",
      "UserId": 0,
      "Username": "bwatford",
      "UserAvatar": null,
      "UserGravatar": "1a8253e58f487496067bd87abe1b0abe",
      "EditableText": "[u:os3i6sry][b:os3i6sry]Gold &amp; Glory: Chapter 1 A Dark &amp; Stormy Knight[/b:os3i6sry][/u:os3i6sry]\r\n\r\n[b:os3i6sry]Status:[/b:os3i6sry] Stage 5 of 20 (Weapons &amp; Armor)  \r\n\r\n[b:os3i6sry]Description:[/b:os3i6sry] A classic style single player RPG. Chapter 1 of 6.  \r\n\r\n[b:os3i6sry]Progress:[/b:os3i6sry] I have the complete adventure (all 6 chapters) drawn out on paper with every detail. Just need to finish codeing it for Quest. I'm going to try to assemble a few willing helpers to help with the details. There will be tons of things to do with almost everything in the adventure. Will include pictures of everything and sound to add to the experience. You character will also get stronger as the game progresses. The story will be done over chapters just like a novel. Once chapter one is done I will release it as a prelude to the entire game as a teaser.\r\n\r\n[b:os3i6sry]Notes:[/b:os3i6sry] The point of this project is to not just make another adventure but to make one that goes into great detail with every item in the relm and make everything read as good as a novel. Where the storyline is the most important aspect of the game.\r\n\r\n[b:os3i6sry]About the game:[/b:os3i6sry]\r\n[img:os3i6sry]http&#58;//premierimportsonline&#46;com/images/_products/santasmailbag/stormyknightlogo&#46;jpg[/img:os3i6sry] \r\n\r\nThe unusually violent storms in these parts often drive motley collections of intelligent beings to take shelter together for a time. The tradition of storm-peace ensures that all grudges are suspended for the duration of the storm. But some shelters are safer than others, and not all beings honor the storm-peace. Can you solve the mystery of the tor in which you have taken shelter before the storm ends?\r\n\r\n     A Dark and Stormy Knight is a single player adventure for QUEST. The scenario is set in a barren wilderness area that features one or more tors, or freestanding hills. The action takes place inside one of these tors that has been hollowed out and used as a tomb in the past.\r\n\r\n\r\n[b:os3i6sry]Help Wanted:[/b:os3i6sry]\r\nIf you think you can contribute a little free time to this project I am looking for the following:\r\n\r\n[b:os3i6sry]Graphics: [/b:os3i6sry]Are you good with Paintshop? Good with cutting &amp; pasting together images and adding titles? There is alot of pictures to put together for this adventure. I will supply the base images if you are good at dressing them up.\r\n\r\n[b:os3i6sry]Descriptive Writing:[/b:os3i6sry] Are you good at writing detailed descriptions for items and places and editing text for gramatical corrections? Then we can use you on this project.\r\n\r\n[b:os3i6sry]RPG Players:[/b:os3i6sry] Have you played tons of text adventures? We could use a couple of people to input their general feedback on areas in the game as they are completed and developed. Basically to help with the storyline consistancies etc.\r\n\r\nIf you want to help out and join the team please contact me by PM here or email at <!-- e --><a href=\"mailto:billy@premierimportsonline.com\">billy@premierimportsonline.com</a><!-- e -->\r\n\r\nAll team members will get their names in the credits of the final version.\r\n\r\nThanks for your time.",
      "EditableFormat": "bbcode",
      "HTML": "<span style=\"text-decoration:underline;\"><span style=\"font-weight:bold;\">Gold &amp; Glory: Chapter 1 A Dark &amp; Stormy Knight</span></span><br/><br/><span style=\"font-weight:bold;\">Status:</span> Stage 5 of 20 (Weapons &amp; Armor)  <br/><br/><span style=\"font-weight:bold;\">Description:</span> A classic style single player RPG. Chapter 1 of 6.  <br/><br/><span style=\"font-weight:bold;\">Progress:</span> I have the complete adventure (all 6 chapters) drawn out on paper with every detail. Just need to finish codeing it for Quest. I'm going to try to assemble a few willing helpers to help with the details. There will be tons of things to do with almost everything in the adventure. Will include pictures of everything and sound to add to the experience. You character will also get stronger as the game progresses. The story will be done over chapters just like a novel. Once chapter one is done I will release it as a prelude to the entire game as a teaser.<br/><br/><span style=\"font-weight:bold;\">Notes:</span> The point of this project is to not just make another adventure but to make one that goes into great detail with every item in the relm and make everything read as good as a novel. Where the storyline is the most important aspect of the game.<br/><br/><span style=\"font-weight:bold;\">About the game:</span><br/><img src=\"http&#58;//premierimportsonline&#46;com/images/_products/santasmailbag/stormyknightlogo&#46;jpg\" alt=\"\" /> <br/><br/>The unusually violent storms in these parts often drive motley collections of intelligent beings to take shelter together for a time. The tradition of storm-peace ensures that all grudges are suspended for the duration of the storm. But some shelters are safer than others, and not all beings honor the storm-peace. Can you solve the mystery of the tor in which you have taken shelter before the storm ends?<br/><br/>     A Dark and Stormy Knight is a single player adventure for QUEST. The scenario is set in a barren wilderness area that features one or more tors, or freestanding hills. The action takes place inside one of these tors that has been hollowed out and used as a tomb in the past.<br/><br/><br/><span style=\"font-weight:bold;\">Help Wanted:</span><br/>If you think you can contribute a little free time to this project I am looking for the following:<br/><br/><span style=\"font-weight:bold;\">Graphics: </span>Are you good with Paintshop? Good with cutting &amp; pasting together images and adding titles? There is alot of pictures to put together for this adventure. I will supply the base images if you are good at dressing them up.<br/><br/><span style=\"font-weight:bold;\">Descriptive Writing:</span> Are you good at writing detailed descriptions for items and places and editing text for gramatical corrections? Then we can use you on this project.<br/><br/><span style=\"font-weight:bold;\">RPG Players:</span> Have you played tons of text adventures? We could use a couple of people to input their general feedback on areas in the game as they are completed and developed. Basically to help with the storyline consistancies etc.<br/><br/>If you want to help out and join the team please contact me by PM here or email at <!-- e --><a href=\"mailto:billy@premierimportsonline.com\">billy@premierimportsonline.com</a><!-- e --><br/><br/>All team members will get their names in the credits of the final version.<br/><br/>Thanks for your time.",
      "PostDate": "2007-03-22T05:24:06+00:00",
      "LastEditDate": null
    }
  ]
}
