{
  "Topic": {
    "TopicId": "1655",
    "ForumId": "3",
    "Title": "Wanna play Legend of the Green Dragon?",
    "LastUpdated": "2007-03-28T16:27:12+01:00",
    "ReplyCount": 8
  },
  "Posts": [
    {
      "PostId": "13187",
      "UserId": 0,
      "Username": "bwatford",
      "UserAvatar": null,
      "UserGravatar": "1a8253e58f487496067bd87abe1b0abe",
      "EditableText": "I've just set up a new heavily modded [b:1yiz2zzr]Legend of the Green Dragon[/b:1yiz2zzr] text game server and need some players to help test everything. I am adding more villages and towns to visit daily. Please report any bugs either to me here via PM or to me on the game server. Username is Dungeon_Master. The server will be closed after 100 players join once it goes live but all test players that sign up from here will be guaranteed a spot on the server.\r\n\r\nTemp test server: <!-- m --><a class=\"postlink\" href=\"http://100megs40.com/~bwatford\">http://100megs40.com/~bwatford</a><!-- m -->\r\n\r\nWhen we go live the url will be: <!-- m --><a class=\"postlink\" href=\"http://lotgdserver.com\">http://lotgdserver.com</a><!-- m -->\r\n\r\nIf you havn't played this cool browser based rpg yet here is some info:\r\n\r\nLong, long ago, before hot and cold running internet could be piped right into your home, forward thinking citizens dialed into bulletin board systems (BBS) via modem to download files, read forums, look at ansi art or, of course, to play games.\r\n\r\nKnown as door games, these programs acted as a door from the BBS software to another program and often emphasized user interaction and competition. One of the most successful was Seth Able Robinson's Legend of the Red Dragon, an original and humorous RPG released when the author was only 14.\r\n\r\n[b:1yiz2zzr]Legend of the Green Dragon (LoGD)[/b:1yiz2zzr] is a free, browser based homage to, and extension of, the original. Eric Stevens has done an excellent job preserving Able's style while adding tons of new features, characters and monsters, as well as vastly enlarging the world to include multiple cities and an afterlife. [b:1yiz2zzr]LoGD[/b:1yiz2zzr] is written in PHP and is highly extensible. \r\n\r\nAll action in the game is performed by clicking links in a toolbar or using convenient hotkeys. Turns, in the form of forest battles, are doled out every 12 hours, which is equivalent to one game day. Combat is simple but effective and PvP is allowed, though you may opt out. A flawless forest fight earns you a free turn; a good or lucky session of [b:1yiz2zzr]LoGD[/b:1yiz2zzr] can be like riding a wave, each battle perpetuating the next.\r\n\r\nAs a new player you'll choose from a fairly typical selection of races and classes. There is a bit of hand-holding in the form of a beginners island with a helpful fairy, but the majority of [b:1yiz2zzr]LoGD[/b:1yiz2zzr] is left for the player to discover. I won't reveal much more, as the distinct humor of the game makes the learning process appealing and fun. Don't be afraid to spend money, explore strange areas in the forest, or interact with bizarre NPCs. Very little you do can cause serious permanent damage, and there is a lot to gain by finding out what various people and places are for.\r\n\r\nLegend of the Green Dragon is a fitting tribute to a little known classic. However, the text based gameplay, fantasy setting and multiplayer environment make it important to note that [b:1yiz2zzr]LoGD[/b:1yiz2zzr] is not an MMORPG, nor a MUD. Player interaction is minimal, limited to message boards and mail. The low number of levels available for advancement and limited forest fights per day make the maligned and potentially unhealthy level grind common to many MMORPGs impossible. In fact, though predating modern MMORPGs, [b:1yiz2zzr]LoGD[/b:1yiz2zzr] seems designed as a response to current trends; limited by the number of turns each day, the player benefits by spending time efficiently and defeating the dragon as quickly as possible. Rather than simply rewarding those who have the most free time, everyone is on more equal footing. [b:1yiz2zzr]LoGDs[/b:1yiz2zzr] simple gameplay and fun, well-writen encounters make sure the 15 or 20 minutes spent on each session are never a chore. \r\n\r\nThink you can slay the dragon? Come on over!",
      "EditableFormat": "bbcode",
      "HTML": "I've just set up a new heavily modded <span style=\"font-weight:bold;\">Legend of the Green Dragon</span> text game server and need some players to help test everything. I am adding more villages and towns to visit daily. Please report any bugs either to me here via PM or to me on the game server. Username is Dungeon_Master. The server will be closed after 100 players join once it goes live but all test players that sign up from here will be guaranteed a spot on the server.<br/><br/>Temp test server: <!-- m --><a class=\"postlink\" href=\"http://100megs40.com/~bwatford\">http://100megs40.com/~bwatford</a><!-- m --><br/><br/>When we go live the url will be: <!-- m --><a class=\"postlink\" href=\"http://lotgdserver.com\">http://lotgdserver.com</a><!-- m --><br/><br/>If you havn't played this cool browser based rpg yet here is some info:<br/><br/>Long, long ago, before hot and cold running internet could be piped right into your home, forward thinking citizens dialed into bulletin board systems (BBS) via modem to download files, read forums, look at ansi art or, of course, to play games.<br/><br/>Known as door games, these programs acted as a door from the BBS software to another program and often emphasized user interaction and competition. One of the most successful was Seth Able Robinson's Legend of the Red Dragon, an original and humorous RPG released when the author was only 14.<br/><br/><span style=\"font-weight:bold;\">Legend of the Green Dragon (LoGD)</span> is a free, browser based homage to, and extension of, the original. Eric Stevens has done an excellent job preserving Able's style while adding tons of new features, characters and monsters, as well as vastly enlarging the world to include multiple cities and an afterlife. <span style=\"font-weight:bold;\">LoGD</span> is written in PHP and is highly extensible. <br/><br/>All action in the game is performed by clicking links in a toolbar or using convenient hotkeys. Turns, in the form of forest battles, are doled out every 12 hours, which is equivalent to one game day. Combat is simple but effective and PvP is allowed, though you may opt out. A flawless forest fight earns you a free turn; a good or lucky session of <span style=\"font-weight:bold;\">LoGD</span> can be like riding a wave, each battle perpetuating the next.<br/><br/>As a new player you'll choose from a fairly typical selection of races and classes. There is a bit of hand-holding in the form of a beginners island with a helpful fairy, but the majority of <span style=\"font-weight:bold;\">LoGD</span> is left for the player to discover. I won't reveal much more, as the distinct humor of the game makes the learning process appealing and fun. Don't be afraid to spend money, explore strange areas in the forest, or interact with bizarre NPCs. Very little you do can cause serious permanent damage, and there is a lot to gain by finding out what various people and places are for.<br/><br/>Legend of the Green Dragon is a fitting tribute to a little known classic. However, the text based gameplay, fantasy setting and multiplayer environment make it important to note that <span style=\"font-weight:bold;\">LoGD</span> is not an MMORPG, nor a MUD. Player interaction is minimal, limited to message boards and mail. The low number of levels available for advancement and limited forest fights per day make the maligned and potentially unhealthy level grind common to many MMORPGs impossible. In fact, though predating modern MMORPGs, <span style=\"font-weight:bold;\">LoGD</span> seems designed as a response to current trends; limited by the number of turns each day, the player benefits by spending time efficiently and defeating the dragon as quickly as possible. Rather than simply rewarding those who have the most free time, everyone is on more equal footing. <span style=\"font-weight:bold;\">LoGDs</span> simple gameplay and fun, well-writen encounters make sure the 15 or 20 minutes spent on each session are never a chore. <br/><br/>Think you can slay the dragon? Come on over!",
      "PostDate": "2007-03-26T23:12:50+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "13188",
      "UserId": 0,
      "Username": "bwatford",
      "UserAvatar": null,
      "UserGravatar": "1a8253e58f487496067bd87abe1b0abe",
      "EditableText": "Just finished updating the game server again. Here's what I have added today.\r\n\r\nAdded a random fight between you and Zeratul in the forest, if you win he will reveal his hideout's location in &quot;Rocky Ridge&quot;. \r\n\r\nAdded the chance that a theif will be encountered in the villages and might steal some gold for you so you better keep it in the bank.\r\n\r\nAdded a chance encouter in the forest with a deadly Grue. \r\n\r\nAdded a werewolf chance encounter in the forest, if bitten you will transform into a werewolf on a full moon. Werewolf players will have special abilities but will have a bounty on there heads in PVP.\r\n\r\nAdded a chance encounter with a Sphinx when you travel between cities.\r\n\r\nAdded a special &quot;White Knight&quot; class specialty, it is now available at 10 Dragon Kills.\r\n\r\nAdded player alignment scale, now all players will have an alignment meter under there stats. Good players go to Valhalla if they die, bad characters go to shades. There is stuff to do at both places in the afterlife before the next game day when you resurrect.\r\n\r\nMore to be added tomorrow.",
      "EditableFormat": "bbcode",
      "HTML": "Just finished updating the game server again. Here's what I have added today.<br/><br/>Added a random fight between you and Zeratul in the forest, if you win he will reveal his hideout's location in &quot;Rocky Ridge&quot;. <br/><br/>Added the chance that a theif will be encountered in the villages and might steal some gold for you so you better keep it in the bank.<br/><br/>Added a chance encouter in the forest with a deadly Grue. <br/><br/>Added a werewolf chance encounter in the forest, if bitten you will transform into a werewolf on a full moon. Werewolf players will have special abilities but will have a bounty on there heads in PVP.<br/><br/>Added a chance encounter with a Sphinx when you travel between cities.<br/><br/>Added a special &quot;White Knight&quot; class specialty, it is now available at 10 Dragon Kills.<br/><br/>Added player alignment scale, now all players will have an alignment meter under there stats. Good players go to Valhalla if they die, bad characters go to shades. There is stuff to do at both places in the afterlife before the next game day when you resurrect.<br/><br/>More to be added tomorrow.",
      "PostDate": "2007-03-27T04:32:43+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "13207",
      "UserId": 0,
      "Username": "bwatford",
      "UserAvatar": null,
      "UserGravatar": "1a8253e58f487496067bd87abe1b0abe",
      "EditableText": "Ok another big update today, here we go..............\r\n\r\n- Added dwellings for users so now you can have your own farm, shack, castle etc. Just buy all your materials from the new shops and get busy.\r\n\r\n- Added the ability to give other players keys to your dwelling\r\n\r\n- Added the ability for other players to try and break in your dwelling and added the ability to hire guards for them to help protect your house.\r\n\r\n- Added the ability to construct castles at high levels and dragon kills.\r\n\r\n- Added the ability to build Inns and receive payment for users staying the night there.\r\n\r\n- Added a lumber yard for wood.\r\n\r\n- Added several different kinds of mines for materials.\r\n\r\n- Added a furniture store so that you can buy furniture for your dwelling.\r\n\r\n- Added jobs for the cities. Now you can work at the farm, mill, brewery, foundry and the wood shop.\r\n\r\n- Added a rock quarry for materials.\r\n\r\n- Added a masons society if your employed.\r\n\r\n- Added the ability to grow orchards in the gardens. (For later food requirements yet to be added)\r\n\r\n- Added a complete inventory system for items found in the game.\r\n\r\n- Added a new -Fairy- race that you can choose after 5 dragon kills and the ability to build fairy tree houses as a dwelling.\r\n\r\nThis concludes todays addons. If your not online playing yet your missing the boat.",
      "EditableFormat": "bbcode",
      "HTML": "Ok another big update today, here we go..............<br/><br/>- Added dwellings for users so now you can have your own farm, shack, castle etc. Just buy all your materials from the new shops and get busy.<br/><br/>- Added the ability to give other players keys to your dwelling<br/><br/>- Added the ability for other players to try and break in your dwelling and added the ability to hire guards for them to help protect your house.<br/><br/>- Added the ability to construct castles at high levels and dragon kills.<br/><br/>- Added the ability to build Inns and receive payment for users staying the night there.<br/><br/>- Added a lumber yard for wood.<br/><br/>- Added several different kinds of mines for materials.<br/><br/>- Added a furniture store so that you can buy furniture for your dwelling.<br/><br/>- Added jobs for the cities. Now you can work at the farm, mill, brewery, foundry and the wood shop.<br/><br/>- Added a rock quarry for materials.<br/><br/>- Added a masons society if your employed.<br/><br/>- Added the ability to grow orchards in the gardens. (For later food requirements yet to be added)<br/><br/>- Added a complete inventory system for items found in the game.<br/><br/>- Added a new -Fairy- race that you can choose after 5 dragon kills and the ability to build fairy tree houses as a dwelling.<br/><br/>This concludes todays addons. If your not online playing yet your missing the boat.",
      "PostDate": "2007-03-28T05:53:33+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "13210",
      "UserId": 0,
      "Username": "Elexxorine",
      "UserAvatar": null,
      "UserGravatar": "a220ee44d8fe2f07029cf1f61b98bf40",
      "EditableText": "I tried joining but it won't send me the email...",
      "EditableFormat": "bbcode",
      "HTML": "I tried joining but it won't send me the email...",
      "PostDate": "2007-03-28T08:56:53+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "13211",
      "UserId": 0,
      "Username": "paul_one",
      "UserAvatar": null,
      "UserGravatar": "fef8a1875028f4300bb683f29c432894",
      "EditableText": "Why are you adding updates to THIS forum?\r\n\r\nShouldn't you have this on a page on your LoGD server?",
      "EditableFormat": "bbcode",
      "HTML": "Why are you adding updates to THIS forum?<br/><br/>Shouldn't you have this on a page on your LoGD server?",
      "PostDate": "2007-03-28T12:56:23+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "13213",
      "UserId": 0,
      "Username": "bwatford",
      "UserAvatar": null,
      "UserGravatar": "1a8253e58f487496067bd87abe1b0abe",
      "EditableText": "I have disabled the required email validation for the moment elexxorine so you can play.\r\n\r\nTron I was updating the forum topic here since quite a few people where interested in playing from here. If it is a problem I will stop. It was a general chat section so I didn't see a problem. Please let me know so I don't offend anyone.",
      "EditableFormat": "bbcode",
      "HTML": "I have disabled the required email validation for the moment elexxorine so you can play.<br/><br/>Tron I was updating the forum topic here since quite a few people where interested in playing from here. If it is a problem I will stop. It was a general chat section so I didn't see a problem. Please let me know so I don't offend anyone.",
      "PostDate": "2007-03-28T14:23:09+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "13214",
      "UserId": 0,
      "Username": "Elexxorine",
      "UserAvatar": null,
      "UserGravatar": "a220ee44d8fe2f07029cf1f61b98bf40",
      "EditableText": "Whenever I try to log in it gives the validation error...",
      "EditableFormat": "bbcode",
      "HTML": "Whenever I try to log in it gives the validation error...",
      "PostDate": "2007-03-28T14:35:24+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "13215",
      "UserId": 0,
      "Username": "bwatford",
      "UserAvatar": null,
      "UserGravatar": "1a8253e58f487496067bd87abe1b0abe",
      "EditableText": "I manually validated the email address. You should be good to go.",
      "EditableFormat": "bbcode",
      "HTML": "I manually validated the email address. You should be good to go.",
      "PostDate": "2007-03-28T15:28:14+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "13216",
      "UserId": 0,
      "Username": "paul_one",
      "UserAvatar": null,
      "UserGravatar": "fef8a1875028f4300bb683f29c432894",
      "EditableText": "I've got no problem talking about LoGD, feel free.. Just didn't understand why you'd have a constant update of features in this forum, as I don't see it as 'chat', more like product information/patch information... Which you'd usually keep in a &quot;whatsnew.txt&quot; file.",
      "EditableFormat": "bbcode",
      "HTML": "I've got no problem talking about LoGD, feel free.. Just didn't understand why you'd have a constant update of features in this forum, as I don't see it as 'chat', more like product information/patch information... Which you'd usually keep in a &quot;whatsnew.txt&quot; file.",
      "PostDate": "2007-03-28T16:27:12+01:00",
      "LastEditDate": null
    }
  ]
}
