{
  "Topic": {
    "TopicId": "1987",
    "ForumId": "3",
    "Title": "The Thanatos Thread",
    "LastUpdated": "2009-02-18T08:10:59+00:00",
    "ReplyCount": 2
  },
  "Posts": [
    {
      "PostId": "16070",
      "UserId": 0,
      "Username": "Thanatos",
      "UserAvatar": "2160_1332681621.jpg",
      "UserGravatar": "c6621a24cf53876c4083bfb52afd2cc9",
      "EditableText": "Here is where I will post everything concerning me, such as upcoming games, and other delusions of my mind. Enjoy.",
      "EditableFormat": "bbcode",
      "HTML": "Here is where I will post everything concerning me, such as upcoming games, and other delusions of my mind. Enjoy.",
      "PostDate": "2009-02-17T11:12:20+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "16076",
      "UserId": 0,
      "Username": "Thanatos",
      "UserAvatar": "2160_1332681621.jpg",
      "UserGravatar": "c6621a24cf53876c4083bfb52afd2cc9",
      "EditableText": "[b:1xwcmt6b]The Epic Tale of Axeuk[/b:1xwcmt6b]\n\nThe party headed for the Chat where the popular Epic Thread of Random Off-Topicness show was being taped. The wildly popular show had an extensive audience among the citizens of Axeuk, and the party after taking out the zombies in As Darkness Falls needed some rest and recreation. When Alex handed them a free group pass to the forum after spending a $49.99 on Quest Pro, Tr0n asked if they all wanted to go. It sounded diverting enough to fit their mood, so they entered the packed thread.\n\nThanatos sprang into the thread. A puckish and rather evil grin decorated his face.\n\n&quot;Today, Ladies and Gentlemen, I have a special treat for you tonight. Presenting Quest Users who wear naughty lingerie and the women who love them!&quot; said Thana.\n\nAs the curtain opened, a stupified group of some of the most distinguished matrons in Axeuk were revealed, a look of horror and embarressment on their faces. One woman shakily stood up.\n\n&quot;This was suppose to be Oprah!!! You vile little rabble rouser and side show barker! How dare you trick us like this!!! My husband will surely find out about this, and he'll...&quot; started the crazy lady.\n\n&quot;Why, you can talk to him now! Here comes the entire Quest Users group!&quot; interrupted Jan as a group of people walked in in parade armor. They stopped in the middle of the stage, and the leader at the head opened his visor.\n\n&quot;Lyteside??? What in X's name is this! Lyte, what are you doing at the Armor Polish Exhibition?&quot; asked a very perplexed Redsun. Obviously because of the full tilting helm worn by the people, they missed a lot of verbal interplay.\n\n&quot;Redsun, we have been scurriously tricked into appearing in the Random Thread of Off-Topicness!!! Why the vile ruffian accused you of wearing...I can't even speak the words!!!! A vile and reprehensible calumny and defamation that is certainly enough cause for you and your fellows to thrash him most throughly!&quot; cried Lyte. All the &quot;Knights&quot; gripped their ceremonial two handed swords and looked at the still smiling Thanatos.\n\n&quot;Now Sir Redsun, and your fellows, a christian must always tell the truth, correct? No matter how personally embarressing and distressing to your reputations and honor, am I not correct? The theme of today's show is Quest Users who wear naughty lingerie and the women who love them. Please correct any inaccuracy in that statement.&quot; replied Thanatos with complete confidence.\n\nMortification and shame showed on the revealed faces of all the &quot;knights&quot;. Some of them even dropped their swords, and one poor fellow covered his face and started to sob uncontrollably.\n\n&quot;Red? I don't understand. Why aren't you thrashing that vile man?&quot; asked Lyte.\n\n&quot;Lyte, love of my life, light of my being, I fear that he is speaking the truth.&quot; replied Sir Red manfully. Sir Steve, whom the party recognized, gazed on Sir Red with wonder and awe at the sheer courage the aged Quest User displayed. \n\nIn the stupified silence that followed that most extraordinary statement, several of the wives of the &quot;knights&quot; fainted dead away. Lyte, however, visibly steamed up until the inevitable explosion followed...\n\nLyte shrieked at the top of her voice &quot;REDSUN!!! YOU'RE TELLING ME THAT THIS SHAMEFUL STATEMENT IS TRUE???!!!!&quot;\n\nThanatos whispers to his head bouncer ogre, &quot;David, old buddy, this has turned out better than expected!&quot; David grunts and nods his head. He gripped the inflated pigs bladder that all the bouncers in the Eic Thread of Random Off-Topicness were equipped with, for handling forumites who totally lost it. ( Of course, this happened about every other post, and due to liability concerns, the bouncers, both ogres and human alike were armed with very non-lethal weapons for crowd control.)\n\n&quot;Lyte, please! Its not what you think at all! It has to do with military necessity and our gambesons!&quot; The very illogic of that statement stopped all the mortified knights and weeping matrons in their tracks.\n\n&quot;Red, what on Earth has wearing...I can't even say it!!! Have to do with the garment you put under your armor?&quot; asked Lyte with a shudder of disgust, and utter perplexity.\n\n&quot;Yes, the gambeson...made of layers of thick wool felt, so thick it takes a week to dry, and years to break in...you can never ever get rid of the itch of raw wool felt...its bad enough on the arms, and legs and torso, but on a man's...&quot; replied Red with a grimace. All the men in the audience sucked in their breaths in sympathy. A itch there was simply no laughing matter.\n\n&quot;Yes, I know you need the padding of the gambeson to take the blows to your armor, and I know exactly how smelly and uncomfortable that thing is...and I can certainly understand your situation with...urm...you know...&quot; replied Lyte sympathetically.\n\n&quot;So years ago, I am most ashamed to admit, I filched some of your silk things before leaving for a post...else I would have shamed myself by trying to scratch...you know, and it wouldn't have worked anyway since I had armor on...it saved my dignity and made the long thread endurable...and some of my fellow knights found out about it...&quot; said Red with a woebegone hang of his head.\n\n&quot;So that lacey red teddy I ordered from Amazon, with the peekaboo panels that I thought CJ stole...&quot; asked Lyte.\n\n&quot;I'm wearing it right now...&quot; replied Red.\n\nAt this point, one of the knights who still had his visor covered shouted out in a voice that the whole party recognized...\n\n&quot;I CAN ABSOLUTELY ASSURE YOU THAT I AM NOT WEARING ANY FRILLY FEMININE UNMENTIONABLES!!!&quot; shouted Sir Freak. He had also travelled with the party for a short time, before leaving with Sir Red.\n\n&quot;YEAH RIGHT!!! STRIP HIM!!! STRIP HIM!!!&quot; yelled the audience, scenting blood.\n\nDavid and other bouncers advance enmass, and despite his furious shouts and screams of protest, removed his armor and padded garments to reveal he's wearing a black maid's outfit...with sheer fishnet black stockings. The other knights ignored his desperate pleas for assistance, figuring out that Freak finally got what he deserved.\n\nFreak screamed, &quot;HOW DID THAT GET THERE!!! I SWEAR TO YOU THAT THIS IS SOME HORRIBLE MISTAKE!!!&quot;\n\nSir Steve and the other knights look on him with disgust...\n\n&quot;Oh Reddy...urm...why not have some silken undergarments made to order by our tailor?&quot; she asked in perplexity.\n\n&quot;Impossible!!! Those are the garments of a gigalo!!! This was merely a military expediency for the purpose of comfort and hygene!!!&quot; he replied heatedly.\n\n&quot;Yeah, right...&quot; mocked Thanatos. \n\n&quot;Silence knave and buffoon!!! Lyte, I did actually think of that years ago, and at the time I was worried that our tailor would blab, bringing public condemnation on the Website. I guess that's a moot point right now...&quot; glaring at a sniggering Thanatos.\n\n&quot;Urm...not all the silk things I have are all that comfortable...you know, I'm missing some of my thongs...&quot;\n\n&quot;I'm afraid you're going to have to look to CJ for them...&quot;\n\n&quot;Thanks buddy, good save...&quot; whispers the bachelor Sir Steve.\n\n&quot;Well, I'll forgive you this time, but...&quot; said Lyte.\n\n&quot;Only if you model them for me tonight.&quot; Lyte finished the rest of her sentence in a whisper.\n\n&quot;Deal!!!&quot;\n\n&quot;I love you, Redsun!&quot;\n\n&quot;And I love you, Lyteside!&quot; the two of them embraced, Lyteside crying and Red shaking in relief.\n\nSir Freak sobbed, &quot;I'm so touched...this is so moving..someone give me a hug!!&quot;\n\n&quot;Dragon crap! Where is the violence, where's the hitting and screaming? I thought for sure I had them!&quot; muttered a unhappy Thanatos to David. He was sure that this particular thread would result in a rating booster for his games.\n\nAt this point a very disatisfied Thanatos leaped to the top of his desk, and yanked his shirt off, reavealing the suit of chainmail that he started wearing 24/7 since he started the thread. He quickly grabbed a bed pan from a pile of them lying behind the curtain of the stage, and put it on his head, in obvious imitation of a knight's helm. (The next thread to be made on the forum was an episode of &quot;Quest Hospital&quot;, the long running soap opera.) Then he started singing.\n\nWe're Knights wearing silk and sable,\nWe'd prance but in armor we're quite unable,\nPlease don't be mean, we're not drag queens\nThis itch is quite abominable.\nComfy things we need a lot,\nOr we'll be doing the itchy crotchy trot-alot.\nWe're Knights who dance on the table,\nOur feathered Boa's are formidable,\nOur dancing is bold, to earn your gold\nJust to pay for trims in black sable.\nWe're all stage mad in the Chapter,\nA ceiling brass pole has us in a raptu-u-u-u-ure!\nIn Games we're tough and able,\nQuite indefatigable,\nBetween using quest we wear skimpy vests,\nwith glittering falsies and of course black sable.\nIt's a hard life as a righteous knight,\nBut with sexy lingerie we feel ALRIGHT!\n\nThanatos got his riot. The Quest Users gave a gigantic shout of rage and indignation, and pulled their swords out of their scabbards. The force of bouncers tossed their pitifully inadequate inflated pigs bladders, and grabbed the nearest handy weapons...from the pile of bedpans lying around for the next thread. Sir Red at the vanguard was swarmed over by 3 gnomes, wielding bedpans as they mobbed him like rabid pirahna poodles. The gnomes, as they were wont to do in intense combat, shortened their traditional war cry from &quot;Your knees are mine!&quot; to &quot;KNEE!!!&quot; The gnomes shouting &quot;KNEE!!!&quot; used their bedpans to great effect, bashing the knights in their parade armor, the weight of it making their movements sluggish, as they flailed away with the flats of their swords. The ogre bouncers grabbed the first thing that came to hand as they finally engaged the knights. The gnomes had grabbed all the bedpans, so they were forced to grab the fake shrubbery stacked beside the bedpans in anticipation for the thread being made after &quot;Quest Hospital&quot;. The ogre bouncers advanced en-mass on the cowering Sir Freak, who had tried to run away from the general melee, and proceeded to pummel him with the fake shrubbery from the set of &quot;Gnome Watch&quot;, the show by Thanatos Hasselhoff. Most disturbing of all, his moans and shrieks of pain soon changed to something completely different...\n\nAt this point, Tr0n had enough. Rising from his seat, he called the party together, and they left the Forums.\n\n&quot;Well, on second thought, let's not stay in Axeuk. It is a silly place. Off to Tads! We Ride!&quot; Tr0n began to trot in his armor, and the party all followed, trotting along in their full plate mail armor, each party member followed by a squire clapping two coconut shells together. \n\nAs usual, poor Dr. Froth was heard to grumble, &quot;You'd think it would kill him to buy some real horses!&quot; as he faithfully trotted behind Elexxorine, clapping his two coconut shells together.",
      "EditableFormat": "bbcode",
      "HTML": "<span style=\"font-weight:bold;\">The Epic Tale of Axeuk</span><br/><br/>The party headed for the Chat where the popular Epic Thread of Random Off-Topicness show was being taped. The wildly popular show had an extensive audience among the citizens of Axeuk, and the party after taking out the zombies in As Darkness Falls needed some rest and recreation. When Alex handed them a free group pass to the forum after spending a $49.99 on Quest Pro, Tr0n asked if they all wanted to go. It sounded diverting enough to fit their mood, so they entered the packed thread.<br/><br/>Thanatos sprang into the thread. A puckish and rather evil grin decorated his face.<br/><br/>&quot;Today, Ladies and Gentlemen, I have a special treat for you tonight. Presenting Quest Users who wear naughty lingerie and the women who love them!&quot; said Thana.<br/><br/>As the curtain opened, a stupified group of some of the most distinguished matrons in Axeuk were revealed, a look of horror and embarressment on their faces. One woman shakily stood up.<br/><br/>&quot;This was suppose to be Oprah!!! You vile little rabble rouser and side show barker! How dare you trick us like this!!! My husband will surely find out about this, and he'll...&quot; started the crazy lady.<br/><br/>&quot;Why, you can talk to him now! Here comes the entire Quest Users group!&quot; interrupted Jan as a group of people walked in in parade armor. They stopped in the middle of the stage, and the leader at the head opened his visor.<br/><br/>&quot;Lyteside??? What in X's name is this! Lyte, what are you doing at the Armor Polish Exhibition?&quot; asked a very perplexed Redsun. Obviously because of the full tilting helm worn by the people, they missed a lot of verbal interplay.<br/><br/>&quot;Redsun, we have been scurriously tricked into appearing in the Random Thread of Off-Topicness!!! Why the vile ruffian accused you of wearing...I can't even speak the words!!!! A vile and reprehensible calumny and defamation that is certainly enough cause for you and your fellows to thrash him most throughly!&quot; cried Lyte. All the &quot;Knights&quot; gripped their ceremonial two handed swords and looked at the still smiling Thanatos.<br/><br/>&quot;Now Sir Redsun, and your fellows, a christian must always tell the truth, correct? No matter how personally embarressing and distressing to your reputations and honor, am I not correct? The theme of today's show is Quest Users who wear naughty lingerie and the women who love them. Please correct any inaccuracy in that statement.&quot; replied Thanatos with complete confidence.<br/><br/>Mortification and shame showed on the revealed faces of all the &quot;knights&quot;. Some of them even dropped their swords, and one poor fellow covered his face and started to sob uncontrollably.<br/><br/>&quot;Red? I don't understand. Why aren't you thrashing that vile man?&quot; asked Lyte.<br/><br/>&quot;Lyte, love of my life, light of my being, I fear that he is speaking the truth.&quot; replied Sir Red manfully. Sir Steve, whom the party recognized, gazed on Sir Red with wonder and awe at the sheer courage the aged Quest User displayed. <br/><br/>In the stupified silence that followed that most extraordinary statement, several of the wives of the &quot;knights&quot; fainted dead away. Lyte, however, visibly steamed up until the inevitable explosion followed...<br/><br/>Lyte shrieked at the top of her voice &quot;REDSUN!!! YOU'RE TELLING ME THAT THIS SHAMEFUL STATEMENT IS TRUE???!!!!&quot;<br/><br/>Thanatos whispers to his head bouncer ogre, &quot;David, old buddy, this has turned out better than expected!&quot; David grunts and nods his head. He gripped the inflated pigs bladder that all the bouncers in the Eic Thread of Random Off-Topicness were equipped with, for handling forumites who totally lost it. ( Of course, this happened about every other post, and due to liability concerns, the bouncers, both ogres and human alike were armed with very non-lethal weapons for crowd control.)<br/><br/>&quot;Lyte, please! Its not what you think at all! It has to do with military necessity and our gambesons!&quot; The very illogic of that statement stopped all the mortified knights and weeping matrons in their tracks.<br/><br/>&quot;Red, what on Earth has wearing...I can't even say it!!! Have to do with the garment you put under your armor?&quot; asked Lyte with a shudder of disgust, and utter perplexity.<br/><br/>&quot;Yes, the gambeson...made of layers of thick wool felt, so thick it takes a week to dry, and years to break in...you can never ever get rid of the itch of raw wool felt...its bad enough on the arms, and legs and torso, but on a man's...&quot; replied Red with a grimace. All the men in the audience sucked in their breaths in sympathy. A itch there was simply no laughing matter.<br/><br/>&quot;Yes, I know you need the padding of the gambeson to take the blows to your armor, and I know exactly how smelly and uncomfortable that thing is...and I can certainly understand your situation with...urm...you know...&quot; replied Lyte sympathetically.<br/><br/>&quot;So years ago, I am most ashamed to admit, I filched some of your silk things before leaving for a post...else I would have shamed myself by trying to scratch...you know, and it wouldn't have worked anyway since I had armor on...it saved my dignity and made the long thread endurable...and some of my fellow knights found out about it...&quot; said Red with a woebegone hang of his head.<br/><br/>&quot;So that lacey red teddy I ordered from Amazon, with the peekaboo panels that I thought CJ stole...&quot; asked Lyte.<br/><br/>&quot;I'm wearing it right now...&quot; replied Red.<br/><br/>At this point, one of the knights who still had his visor covered shouted out in a voice that the whole party recognized...<br/><br/>&quot;I CAN ABSOLUTELY ASSURE YOU THAT I AM NOT WEARING ANY FRILLY FEMININE UNMENTIONABLES!!!&quot; shouted Sir Freak. He had also travelled with the party for a short time, before leaving with Sir Red.<br/><br/>&quot;YEAH RIGHT!!! STRIP HIM!!! STRIP HIM!!!&quot; yelled the audience, scenting blood.<br/><br/>David and other bouncers advance enmass, and despite his furious shouts and screams of protest, removed his armor and padded garments to reveal he's wearing a black maid's outfit...with sheer fishnet black stockings. The other knights ignored his desperate pleas for assistance, figuring out that Freak finally got what he deserved.<br/><br/>Freak screamed, &quot;HOW DID THAT GET THERE!!! I SWEAR TO YOU THAT THIS IS SOME HORRIBLE MISTAKE!!!&quot;<br/><br/>Sir Steve and the other knights look on him with disgust...<br/><br/>&quot;Oh Reddy...urm...why not have some silken undergarments made to order by our tailor?&quot; she asked in perplexity.<br/><br/>&quot;Impossible!!! Those are the garments of a gigalo!!! This was merely a military expediency for the purpose of comfort and hygene!!!&quot; he replied heatedly.<br/><br/>&quot;Yeah, right...&quot; mocked Thanatos. <br/><br/>&quot;Silence knave and buffoon!!! Lyte, I did actually think of that years ago, and at the time I was worried that our tailor would blab, bringing public condemnation on the Website. I guess that's a moot point right now...&quot; glaring at a sniggering Thanatos.<br/><br/>&quot;Urm...not all the silk things I have are all that comfortable...you know, I'm missing some of my thongs...&quot;<br/><br/>&quot;I'm afraid you're going to have to look to CJ for them...&quot;<br/><br/>&quot;Thanks buddy, good save...&quot; whispers the bachelor Sir Steve.<br/><br/>&quot;Well, I'll forgive you this time, but...&quot; said Lyte.<br/><br/>&quot;Only if you model them for me tonight.&quot; Lyte finished the rest of her sentence in a whisper.<br/><br/>&quot;Deal!!!&quot;<br/><br/>&quot;I love you, Redsun!&quot;<br/><br/>&quot;And I love you, Lyteside!&quot; the two of them embraced, Lyteside crying and Red shaking in relief.<br/><br/>Sir Freak sobbed, &quot;I'm so touched...this is so moving..someone give me a hug!!&quot;<br/><br/>&quot;Dragon crap! Where is the violence, where's the hitting and screaming? I thought for sure I had them!&quot; muttered a unhappy Thanatos to David. He was sure that this particular thread would result in a rating booster for his games.<br/><br/>At this point a very disatisfied Thanatos leaped to the top of his desk, and yanked his shirt off, reavealing the suit of chainmail that he started wearing 24/7 since he started the thread. He quickly grabbed a bed pan from a pile of them lying behind the curtain of the stage, and put it on his head, in obvious imitation of a knight's helm. (The next thread to be made on the forum was an episode of &quot;Quest Hospital&quot;, the long running soap opera.) Then he started singing.<br/><br/>We're Knights wearing silk and sable,<br/>We'd prance but in armor we're quite unable,<br/>Please don't be mean, we're not drag queens<br/>This itch is quite abominable.<br/>Comfy things we need a lot,<br/>Or we'll be doing the itchy crotchy trot-alot.<br/>We're Knights who dance on the table,<br/>Our feathered Boa's are formidable,<br/>Our dancing is bold, to earn your gold<br/>Just to pay for trims in black sable.<br/>We're all stage mad in the Chapter,<br/>A ceiling brass pole has us in a raptu-u-u-u-ure!<br/>In Games we're tough and able,<br/>Quite indefatigable,<br/>Between using quest we wear skimpy vests,<br/>with glittering falsies and of course black sable.<br/>It's a hard life as a righteous knight,<br/>But with sexy lingerie we feel ALRIGHT!<br/><br/>Thanatos got his riot. The Quest Users gave a gigantic shout of rage and indignation, and pulled their swords out of their scabbards. The force of bouncers tossed their pitifully inadequate inflated pigs bladders, and grabbed the nearest handy weapons...from the pile of bedpans lying around for the next thread. Sir Red at the vanguard was swarmed over by 3 gnomes, wielding bedpans as they mobbed him like rabid pirahna poodles. The gnomes, as they were wont to do in intense combat, shortened their traditional war cry from &quot;Your knees are mine!&quot; to &quot;KNEE!!!&quot; The gnomes shouting &quot;KNEE!!!&quot; used their bedpans to great effect, bashing the knights in their parade armor, the weight of it making their movements sluggish, as they flailed away with the flats of their swords. The ogre bouncers grabbed the first thing that came to hand as they finally engaged the knights. The gnomes had grabbed all the bedpans, so they were forced to grab the fake shrubbery stacked beside the bedpans in anticipation for the thread being made after &quot;Quest Hospital&quot;. The ogre bouncers advanced en-mass on the cowering Sir Freak, who had tried to run away from the general melee, and proceeded to pummel him with the fake shrubbery from the set of &quot;Gnome Watch&quot;, the show by Thanatos Hasselhoff. Most disturbing of all, his moans and shrieks of pain soon changed to something completely different...<br/><br/>At this point, Tr0n had enough. Rising from his seat, he called the party together, and they left the Forums.<br/><br/>&quot;Well, on second thought, let's not stay in Axeuk. It is a silly place. Off to Tads! We Ride!&quot; Tr0n began to trot in his armor, and the party all followed, trotting along in their full plate mail armor, each party member followed by a squire clapping two coconut shells together. <br/><br/>As usual, poor Dr. Froth was heard to grumble, &quot;You'd think it would kill him to buy some real horses!&quot; as he faithfully trotted behind Elexxorine, clapping his two coconut shells together.",
      "PostDate": "2009-02-18T08:08:24+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "16077",
      "UserId": 0,
      "Username": "Thanatos",
      "UserAvatar": "2160_1332681621.jpg",
      "UserGravatar": "c6621a24cf53876c4083bfb52afd2cc9",
      "EditableText": "[b:3ukeaczn]Language Lesson of the Week[/b:3ukeaczn]\n\nI bumped into an old acquaintance the other day. I wouldn’t have bumped into a younger acquaintance because they can retaliate.\n\nI saw this guy outside the shops in anjimup. I ran towards him flat out, which for me is a good eight kilometres per hour, and shoulder-charged him into the street.\n\n&quot;Hey! What did you do that for?&quot; he exclaimed.\n\n&quot;I just wanted to make contact with you again.&quot;\n\nThis reminded me that &quot;contact&quot; is nor properly a verb. If it was, I would have said, &quot;I wanted to contact you again.&quot; This argument is moot, however, since it is usage that controls a language, not the other way around. Hence we now use &quot;contact&quot; as a verb in the same way that we use other nouns such as &quot;bank&quot; and &quot;shop&quot; which were not verbs until the 20th century.\n\n&quot;I will contact you and then you can bank while I shop. Put lots of money into your bank because I am planning a big shop.&quot; Aargh! Usage is one thing, but it becomes awful when people talk about &quot;the cost of my shop&quot; in place of &quot;the cost of my shopping.&quot;\n\nWe need to formalise the way we use former nouns as verbs. Let's start with &quot;contact&quot;. My suggestion is going to become enormously popular with technical writers, ad agencies and Americans, so I'll use &quot;z&quot; instead of &quot;s&quot; where appropriate.\n\nTo distinguish between the noun and the verb, when you make contact with someone you will &quot;contactify&quot; them. It follows logically that a new noun will spring from this new verb. When you contactify someone, you will be making &quot;contactifization&quot; with them. The person who makes contactifization with you could be the &quot;contactifier&quot;, which would make you the &quot;contactifyee&quot;, but this second word is clumsy. Let's rather use &quot;contactifizationist&quot; and &quot;contactifizationee.&quot; Then it's an obvious step to introduce another slick word for the act of staying in contactifization; we have &quot;contactifizationalism.&quot;\n\nCan't you just see the brilliant new slogans? &quot;Facebook, where contactifizationists engage in socializationisming.&quot;",
      "EditableFormat": "bbcode",
      "HTML": "<span style=\"font-weight:bold;\">Language Lesson of the Week</span><br/><br/>I bumped into an old acquaintance the other day. I wouldn’t have bumped into a younger acquaintance because they can retaliate.<br/><br/>I saw this guy outside the shops in anjimup. I ran towards him flat out, which for me is a good eight kilometres per hour, and shoulder-charged him into the street.<br/><br/>&quot;Hey! What did you do that for?&quot; he exclaimed.<br/><br/>&quot;I just wanted to make contact with you again.&quot;<br/><br/>This reminded me that &quot;contact&quot; is nor properly a verb. If it was, I would have said, &quot;I wanted to contact you again.&quot; This argument is moot, however, since it is usage that controls a language, not the other way around. Hence we now use &quot;contact&quot; as a verb in the same way that we use other nouns such as &quot;bank&quot; and &quot;shop&quot; which were not verbs until the 20th century.<br/><br/>&quot;I will contact you and then you can bank while I shop. Put lots of money into your bank because I am planning a big shop.&quot; Aargh! Usage is one thing, but it becomes awful when people talk about &quot;the cost of my shop&quot; in place of &quot;the cost of my shopping.&quot;<br/><br/>We need to formalise the way we use former nouns as verbs. Let's start with &quot;contact&quot;. My suggestion is going to become enormously popular with technical writers, ad agencies and Americans, so I'll use &quot;z&quot; instead of &quot;s&quot; where appropriate.<br/><br/>To distinguish between the noun and the verb, when you make contact with someone you will &quot;contactify&quot; them. It follows logically that a new noun will spring from this new verb. When you contactify someone, you will be making &quot;contactifization&quot; with them. The person who makes contactifization with you could be the &quot;contactifier&quot;, which would make you the &quot;contactifyee&quot;, but this second word is clumsy. Let's rather use &quot;contactifizationist&quot; and &quot;contactifizationee.&quot; Then it's an obvious step to introduce another slick word for the act of staying in contactifization; we have &quot;contactifizationalism.&quot;<br/><br/>Can't you just see the brilliant new slogans? &quot;Facebook, where contactifizationists engage in socializationisming.&quot;",
      "PostDate": "2009-02-18T08:10:59+00:00",
      "LastEditDate": null
    }
  ]
}
