{
  "Topic": {
    "TopicId": "2637",
    "ForumId": "5",
    "Title": "Weezil_Of_Mods' \"Unlucky 13\" Discussion",
    "LastUpdated": "2011-09-02T22:22:47+01:00",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "18799",
      "UserId": 0,
      "Username": "Weezil_Of_Mods",
      "UserAvatar": null,
      "UserGravatar": "4e373a518f29abfcb92df27927b26f30",
      "EditableText": "Weezil_Of_Mods is releasing a game series known as &quot;Unlucky 13.&quot; 12 games featuring apocalyptic scenario's. Games like [i:3tr4pvx1]Psychosis, Infection,[/i:3tr4pvx1] and [i:3tr4pvx1]Cave-in,[/i:3tr4pvx1] are currently in the works. Each is a &quot;Hostile Puzzle&quot; game, meaning you will be facing enemies of increasing strength and hostility. However, being a puzzle, there are certain ways of avoiding conflict, and others that put you right there. Each has specific gameplay, but the same goal: Survive. However, the means of achieving this goal are different. This topic has been introduced so that more ideas for games can be submitted, and used in &quot;Unlucky 13.&quot;\n\nNotice I've mentioned only 3 of them. Those are the only ones that are in the works. Therefore, the Quest community can choose what it wants from the series. However, [i:3tr4pvx1]Lucky Thirteen[/i:3tr4pvx1] is the final game in the series. Twelve puzzles that can only be solved by completing the other twelve games. And the final puzzle puts a twist on the whole show.\n\nAnd also, so the games are fun, there are Easter Eggs, Achievements, and yes, Cheats. Though difficult to find, easter eggs tend to be either comical, such as a strange echo, &quot;I want my sock monkey!&quot; Or maybe a gameplay enhancement, like a skeleton key, or a secret weapon. These make you want to play the game over and over, trying to find them all. Achievements are small awards for doing things in-game. For example, the achievement &quot;Disco Inferno&quot; in &quot;Infection&quot; is achieved by using only fire weapons to clear out the dance hall full of zombies. And the achievement &quot;Born in a Cave&quot; in &quot;Cave-in&quot; is achieved by beating the game on Hard Mode. When you earn one, you will recieve a code. Send that code to me via message and you will be both posted on the Wall of Fame, along with your achievements, but ALSO in the honorable mentions in &quot;Lucky Thirteens'&quot; credits. Cheats are even harder to find, but they offer many things. I will reveal one cheat in &quot;Psychosis&quot; for you. Enter the command &quot;Free Willy Got My Animal Crackers!&quot; And every patient at the Psychosis Ward will shout &quot;Free Willy!&quot; before they charge you.\n\nNow, I've said enough. Now it's time to hear YOUR ideas. You, the community, are what will make this series famous. <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D -->",
      "EditableFormat": "bbcode",
      "HTML": "Weezil_Of_Mods is releasing a game series known as &quot;Unlucky 13.&quot; 12 games featuring apocalyptic scenario's. Games like <span style=\"font-style:italic;\">Psychosis, Infection,</span> and <span style=\"font-style:italic;\">Cave-in,</span> are currently in the works. Each is a &quot;Hostile Puzzle&quot; game, meaning you will be facing enemies of increasing strength and hostility. However, being a puzzle, there are certain ways of avoiding conflict, and others that put you right there. Each has specific gameplay, but the same goal: Survive. However, the means of achieving this goal are different. This topic has been introduced so that more ideas for games can be submitted, and used in &quot;Unlucky 13.&quot;<br/><br/>Notice I've mentioned only 3 of them. Those are the only ones that are in the works. Therefore, the Quest community can choose what it wants from the series. However, <span style=\"font-style:italic;\">Lucky Thirteen</span> is the final game in the series. Twelve puzzles that can only be solved by completing the other twelve games. And the final puzzle puts a twist on the whole show.<br/><br/>And also, so the games are fun, there are Easter Eggs, Achievements, and yes, Cheats. Though difficult to find, easter eggs tend to be either comical, such as a strange echo, &quot;I want my sock monkey!&quot; Or maybe a gameplay enhancement, like a skeleton key, or a secret weapon. These make you want to play the game over and over, trying to find them all. Achievements are small awards for doing things in-game. For example, the achievement &quot;Disco Inferno&quot; in &quot;Infection&quot; is achieved by using only fire weapons to clear out the dance hall full of zombies. And the achievement &quot;Born in a Cave&quot; in &quot;Cave-in&quot; is achieved by beating the game on Hard Mode. When you earn one, you will recieve a code. Send that code to me via message and you will be both posted on the Wall of Fame, along with your achievements, but ALSO in the honorable mentions in &quot;Lucky Thirteens'&quot; credits. Cheats are even harder to find, but they offer many things. I will reveal one cheat in &quot;Psychosis&quot; for you. Enter the command &quot;Free Willy Got My Animal Crackers!&quot; And every patient at the Psychosis Ward will shout &quot;Free Willy!&quot; before they charge you.<br/><br/>Now, I've said enough. Now it's time to hear YOUR ideas. You, the community, are what will make this series famous. <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D -->",
      "PostDate": "2011-09-02T22:22:47+01:00",
      "LastEditDate": null
    }
  ]
}
