{
  "Topic": {
    "TopicId": "2787",
    "ForumId": "10",
    "Title": "introductions",
    "LastUpdated": "2012-01-25T22:54:32+00:00",
    "ReplyCount": 1
  },
  "Posts": [
    {
      "PostId": "19431",
      "UserId": 0,
      "Username": "Mike",
      "UserAvatar": null,
      "UserGravatar": "b78ae60d2100b72726782e68a55b2ecf",
      "EditableText": "Ok so im probably being very stupid here (i'm totally new) but all i want to do is have some introductory text before the game begins to appear on its own on the screen, without the whole &quot;there is an x to the north&quot; etc stuff below it, and then have some wait for key press moments, with a few more bits of information, THEN have the standard &quot;There is an x to the north&quot; etc stuff pop up. But i cant stop the &quot;there is an x to the north&quot; bit popping up immediatly after my introduction no matter how i try and orgranise things. \nI tried putting my intro as a start script followed by a wait for key press script, and still the intro text pops up followed by &quot;there is an x to the north&quot; room description stuff, and pressing a key brings any subsequent text up to be after this point.  I dont want to reveal what the room is and where the objects are till after the whole introduction. \nhaha i dont know if im being clear with my problem, its hard to articulate :p\nthanks in advance for any help you could offer me though guys",
      "EditableFormat": "bbcode",
      "HTML": "Ok so im probably being very stupid here (i'm totally new) but all i want to do is have some introductory text before the game begins to appear on its own on the screen, without the whole &quot;there is an x to the north&quot; etc stuff below it, and then have some wait for key press moments, with a few more bits of information, THEN have the standard &quot;There is an x to the north&quot; etc stuff pop up. But i cant stop the &quot;there is an x to the north&quot; bit popping up immediatly after my introduction no matter how i try and orgranise things. <br/>I tried putting my intro as a start script followed by a wait for key press script, and still the intro text pops up followed by &quot;there is an x to the north&quot; room description stuff, and pressing a key brings any subsequent text up to be after this point.  I dont want to reveal what the room is and where the objects are till after the whole introduction. <br/>haha i dont know if im being clear with my problem, its hard to articulate :p<br/>thanks in advance for any help you could offer me though guys",
      "PostDate": "2012-01-25T22:38:13+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "19432",
      "UserId": 0,
      "Username": "derekb",
      "UserAvatar": null,
      "UserGravatar": "d08a3fb86b85f7da42a93238334e7a17",
      "EditableText": "Hi Mike ...\n\nI had the same question and recently posted it on this forum ...\n\nCheck out the results on &quot;Absolutely the most basic questions&quot;\n\nCheers,\nderekb",
      "EditableFormat": "bbcode",
      "HTML": "Hi Mike ...<br/><br/>I had the same question and recently posted it on this forum ...<br/><br/>Check out the results on &quot;Absolutely the most basic questions&quot;<br/><br/>Cheers,<br/>derekb",
      "PostDate": "2012-01-25T22:54:32+00:00",
      "LastEditDate": null
    }
  ]
}
