{
  "Topic": {
    "TopicId": "2909",
    "ForumId": "10",
    "Title": "Making Responsive Interactions",
    "LastUpdated": "2012-04-10T21:30:09+01:00",
    "ReplyCount": 3
  },
  "Posts": [
    {
      "PostId": "19987",
      "UserId": 0,
      "Username": "pcarver",
      "UserAvatar": null,
      "UserGravatar": "2f114b6e697cf5b61be16f8f47eb6c2a",
      "EditableText": "Dear Folks of Quest,\n  First, thank you to those who helped me with my first problem, it definitely helped my group out a lot! We really appreciate it. My second (and hopefully) final question has to do with interaction with a character in the game. We wanted to write our game so our player had to answer a riddle before being able to proceed in the game. How would we have to write it so they can talk back and forth but the answer to the riddle is specific? Thank you to everyone helping!",
      "EditableFormat": "bbcode",
      "HTML": "Dear Folks of Quest,<br/>  First, thank you to those who helped me with my first problem, it definitely helped my group out a lot! We really appreciate it. My second (and hopefully) final question has to do with interaction with a character in the game. We wanted to write our game so our player had to answer a riddle before being able to proceed in the game. How would we have to write it so they can talk back and forth but the answer to the riddle is specific? Thank you to everyone helping!",
      "PostDate": "2012-04-09T16:27:21+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "19991",
      "UserId": 0,
      "Username": "Pertex",
      "UserAvatar": "5940_1369854251.gif",
      "UserGravatar": "4cc1e52f99452e841ecf4cbee9eadde9",
      "EditableText": "[quote=&quot;pcarver&quot;:dkyuqhlt] so they can talk back and forth but the answer to the riddle is specific? [/quote:dkyuqhlt]\n\nCould you explain this a little more spezific?",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><cite>pcarver wrote:</cite> so they can talk back and forth but the answer to the riddle is specific? </blockquote><br/><br/>Could you explain this a little more spezific?",
      "PostDate": "2012-04-10T08:40:35+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "19992",
      "UserId": 0,
      "Username": "pcarver",
      "UserAvatar": null,
      "UserGravatar": "2f114b6e697cf5b61be16f8f47eb6c2a",
      "EditableText": "We wanted to write the game so when the player entered the room, they would have to answer a riddle to be able to get the item from the room they need to complete the game. For example, one of the rooms is called Baker's Alley. When the player enters the room, there is the Baker waiting for the player. He asks what he's doing there and says &quot;you must be here for the baking challenge and you want the perfect pie crust. If you want the crust, you have to answer my riddle.&quot; We need for the Baker to ask the riddle and [u:1b84gk9w]only[/u:1b84gk9w] accept a particular answer, such as what do you call cheese thats not yours? The answer nacho cheese would be the only acceptable answer. Thank you, sorry for the confusion!",
      "EditableFormat": "bbcode",
      "HTML": "We wanted to write the game so when the player entered the room, they would have to answer a riddle to be able to get the item from the room they need to complete the game. For example, one of the rooms is called Baker's Alley. When the player enters the room, there is the Baker waiting for the player. He asks what he's doing there and says &quot;you must be here for the baking challenge and you want the perfect pie crust. If you want the crust, you have to answer my riddle.&quot; We need for the Baker to ask the riddle and <span style=\"text-decoration:underline;\">only</span> accept a particular answer, such as what do you call cheese thats not yours? The answer nacho cheese would be the only acceptable answer. Thank you, sorry for the confusion!",
      "PostDate": "2012-04-10T17:35:59+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "19996",
      "UserId": 0,
      "Username": "sgreig",
      "UserAvatar": null,
      "UserGravatar": "9117185af66d72729b195384e3a446f0",
      "EditableText": "That's actually not too difficult. All you need is a script that executes when the player speaks to the baker. The script would be something like this:\n\n[code:k7fu8fjv]\nmsg (&quot;You must be here for the baking challenge and you want the perfect pie crust&#46; If you want the crust, you have to answer my riddle&#46;&quot;)\nmsg (&quot;The riddle is&#58; What do you call cheese that is not yours?&quot;)\nplayer_response = GetInput()\nif (player_response = &quot;nacho cheese&quot;) {\n  msg (&quot;Correct! Here is the pie crust&#46;&quot;)\n  pie_crust&#46;parent = player\n}\nelse {\n  msg (&quot;I'm sorry, that's not the correct answer&#46;&quot;)\n}\n[/code:k7fu8fjv]",
      "EditableFormat": "bbcode",
      "HTML": "That's actually not too difficult. All you need is a script that executes when the player speaks to the baker. The script would be something like this:<br/><br/><pre><code><br/>msg (&quot;You must be here for the baking challenge and you want the perfect pie crust&#46; If you want the crust, you have to answer my riddle&#46;&quot;)<br/>msg (&quot;The riddle is&#58; What do you call cheese that is not yours?&quot;)<br/>player_response = GetInput()<br/>if (player_response = &quot;nacho cheese&quot;) {<br/>  msg (&quot;Correct! Here is the pie crust&#46;&quot;)<br/>  pie_crust&#46;parent = player<br/>}<br/>else {<br/>  msg (&quot;I'm sorry, that's not the correct answer&#46;&quot;)<br/>}<br/></code></pre>",
      "PostDate": "2012-04-10T21:30:09+01:00",
      "LastEditDate": null
    }
  ]
}
