{
  "Topic": {
    "TopicId": "3442",
    "ForumId": "3",
    "Title": "Who I am and what I'm doing",
    "LastUpdated": "2013-02-06T16:04:57+00:00",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "22617",
      "UserId": 0,
      "Username": "TriangleGames",
      "UserAvatar": null,
      "UserGravatar": "134d9e995777da65c5cf8efda551d579",
      "EditableText": "Hi, I'm Evan Williams, but I always go by Triangle Games online, or when designing games elsewhere. My family had a dairy feed business named &quot;Triangle Grain&quot; that went under when I was very young, so ever since I was a kid I've wanted to start a game company named after it. That should show I'm a sentimental fellow.\n\nI started looking at programming back on the old [i:3u5g6rbb]Apple ][e[/i:3u5g6rbb] when I was about twelve.\nAt twenty, I had a brief stint in community college where I took a course on Introductory Programming. It mostly taught me how to make flow charts, read hexadecimal, ask and return a user's name, print &quot;hello world,&quot; etc. (and also what the guy in [i:3u5g6rbb]Office Space[/i:3u5g6rbb] who insists he's a &quot;people person&quot; actually does, and why it matters.)\nOff and on over the ten years since, I've toyed around with various &quot;maker&quot; IDE's like [i:3u5g6rbb]SUDS[/i:3u5g6rbb] and Enterbrain's [i:3u5g6rbb]RPG Maker[/i:3u5g6rbb] series. I've also done some self study in C++ and C# (mostly [i:3u5g6rbb]For Dummies[/i:3u5g6rbb] books), visual studio, etc. I actually made the beginning of a text game from scratch in C++, but I had some trouble with it.\n\nNow, I'm a stay-at-home father of two (Mr.Mom), who is trying to find some way to exert my creative ideas into something that anybody might care about. So, I try to find time to work with &quot;makers,&quot; like Quest!\n\nFor a variety of reasons, I have been doing most of my work with Quest on my smart phone through the WebEditor. For anyone who may be thinking about that, I caution you strongly. My browser doesn't display the editor quite right, among other things. The last issue I had was spending a week trying to figure out how to use two wait commands in the same area. When I finally broke down and asked, Alex told me what I needed to do, and it was EXACTLY what I had done in the first place, a week ago. It turns out, that in addition to the editor being wonky, the play-test doesn't run entirely smooth either. Almost every time I try to run it [i:3u5g6rbb]on my phone[/i:3u5g6rbb] the game hangs at the second wait. When I run it on an actual computer, it works just fine. So I spent a week trying to fix something that wasn't broken just to end up asking a question I didn't really need to, all because I didn't realize the phone's browser was the problem. Suffice it to say, from now on I will be double checking any future problems I have on a good computer.\n\nP.S.: I'm also an avid table-top gamer, and have worked on non-electronic game design such as board games, RPG's, and even a CCG.",
      "EditableFormat": "bbcode",
      "HTML": "Hi, I'm Evan Williams, but I always go by Triangle Games online, or when designing games elsewhere. My family had a dairy feed business named &quot;Triangle Grain&quot; that went under when I was very young, so ever since I was a kid I've wanted to start a game company named after it. That should show I'm a sentimental fellow.<br/><br/>I started looking at programming back on the old <span style=\"font-style:italic;\">Apple ][e</span> when I was about twelve.<br/>At twenty, I had a brief stint in community college where I took a course on Introductory Programming. It mostly taught me how to make flow charts, read hexadecimal, ask and return a user's name, print &quot;hello world,&quot; etc. (and also what the guy in <span style=\"font-style:italic;\">Office Space</span> who insists he's a &quot;people person&quot; actually does, and why it matters.)<br/>Off and on over the ten years since, I've toyed around with various &quot;maker&quot; IDE's like <span style=\"font-style:italic;\">SUDS</span> and Enterbrain's <span style=\"font-style:italic;\">RPG Maker</span> series. I've also done some self study in C++ and C# (mostly <span style=\"font-style:italic;\">For Dummies</span> books), visual studio, etc. I actually made the beginning of a text game from scratch in C++, but I had some trouble with it.<br/><br/>Now, I'm a stay-at-home father of two (Mr.Mom), who is trying to find some way to exert my creative ideas into something that anybody might care about. So, I try to find time to work with &quot;makers,&quot; like Quest!<br/><br/>For a variety of reasons, I have been doing most of my work with Quest on my smart phone through the WebEditor. For anyone who may be thinking about that, I caution you strongly. My browser doesn't display the editor quite right, among other things. The last issue I had was spending a week trying to figure out how to use two wait commands in the same area. When I finally broke down and asked, Alex told me what I needed to do, and it was EXACTLY what I had done in the first place, a week ago. It turns out, that in addition to the editor being wonky, the play-test doesn't run entirely smooth either. Almost every time I try to run it <span style=\"font-style:italic;\">on my phone</span> the game hangs at the second wait. When I run it on an actual computer, it works just fine. So I spent a week trying to fix something that wasn't broken just to end up asking a question I didn't really need to, all because I didn't realize the phone's browser was the problem. Suffice it to say, from now on I will be double checking any future problems I have on a good computer.<br/><br/>P.S.: I'm also an avid table-top gamer, and have worked on non-electronic game design such as board games, RPG's, and even a CCG.",
      "PostDate": "2013-02-06T16:04:57+00:00",
      "LastEditDate": null
    }
  ]
}
