{
  "Topic": {
    "TopicId": "3968",
    "ForumId": "10",
    "Title": "Total newbie, needs an advisor/teacher",
    "LastUpdated": "2013-10-20T00:56:56+01:00",
    "ReplyCount": 1
  },
  "Posts": [
    {
      "PostId": "26622",
      "UserId": 0,
      "Username": "JestersMagpie",
      "UserAvatar": null,
      "UserGravatar": "88a90bec2f53ec7247034ac92251287f",
      "EditableText": "Hi,\nI found Quest whilst researching a project I have in mind. To explain, I play a game called geocaching. This uses a hand held gps to find caches placed by other players. Once you have found it, you sign the log book and replace it then move on to hopefully find another etc. The players place the geocaches so it's self generating. There are several different types of caches and the ones I place are termed puzzle caches. For this you solve a puzzle, usually decrypting the route and location then go and find it. All my caches are placed in abandoned stone quarries here in Wiltshire, UK. Because the encryption part is in HTML it can be easily broken or at least got round. \nI had an idea and that''s where I'm hoping Quest will come in. The plan is to create an adventure game based on a film and as the players work their way through it they will get given real pieces of the geocache solution in the form of segments of the route through the quarry. \nThis is where I need some help. I need somebody or bodies to help me learn to use Quest and act as advisor when I get problems.\nI have made a small start, which would probably take you 5 minutes and took me a couple of hours. \nBut I am getting it to look like what I want it to. For the start the player is on a footpath heading towards a geocache. \nThey hear a bleep. This is the gps they're holding which I haven't made an object as I don't need then to pick it up, just look at it to follow a direction (north). I want the option that if they use a command to move they get asked &quot;are you sure that's the direction you wish to go?&quot; But once they are aware of the gps by having looked at it, they can move north. \nHow do I do that and can replies please be in layman terms so I can understand it please. \nAs I become more familiar with Quest things will get easier, I hope.\nThanks\nJester",
      "EditableFormat": "bbcode",
      "HTML": "Hi,<br/>I found Quest whilst researching a project I have in mind. To explain, I play a game called geocaching. This uses a hand held gps to find caches placed by other players. Once you have found it, you sign the log book and replace it then move on to hopefully find another etc. The players place the geocaches so it's self generating. There are several different types of caches and the ones I place are termed puzzle caches. For this you solve a puzzle, usually decrypting the route and location then go and find it. All my caches are placed in abandoned stone quarries here in Wiltshire, UK. Because the encryption part is in HTML it can be easily broken or at least got round. <br/>I had an idea and that''s where I'm hoping Quest will come in. The plan is to create an adventure game based on a film and as the players work their way through it they will get given real pieces of the geocache solution in the form of segments of the route through the quarry. <br/>This is where I need some help. I need somebody or bodies to help me learn to use Quest and act as advisor when I get problems.<br/>I have made a small start, which would probably take you 5 minutes and took me a couple of hours. <br/>But I am getting it to look like what I want it to. For the start the player is on a footpath heading towards a geocache. <br/>They hear a bleep. This is the gps they're holding which I haven't made an object as I don't need then to pick it up, just look at it to follow a direction (north). I want the option that if they use a command to move they get asked &quot;are you sure that's the direction you wish to go?&quot; But once they are aware of the gps by having looked at it, they can move north. <br/>How do I do that and can replies please be in layman terms so I can understand it please. <br/>As I become more familiar with Quest things will get easier, I hope.<br/>Thanks<br/>Jester",
      "PostDate": "2013-10-19T22:20:36+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "26623",
      "UserId": 0,
      "Username": "george",
      "UserAvatar": null,
      "UserGravatar": "dc6fe8e6172303d85249a13c9a49c1ff",
      "EditableText": "hi Jester, welcome to the forum. You're not the only one who has thought text adventures and geocaching are a good combination -- see <!-- m --><a class=\"postlink\" href=\"http://www.intfiction.org/forum/viewtopic.php?f=19&amp;t=2430\">http://www.intfiction.org/forum/viewtop ... =19&amp;t=2430</a><!-- m --> for example. Interesting stuff. \n\nAnyway, for your questions. \n\n[quote:dyh42gxi]I want the option that if they use a command to move they get asked &quot;are you sure that's the direction you wish to go?&quot; But once they are aware of the gps by having looked at it, they can move north. [/quote:dyh42gxi]\n\nSo you want to block all movement until they've looked at the gps. I think just to make life easier you should go ahead and make the gps an object. You can set it up later so that the player can't get rid of it if you like. \n\nThere are a couple of ways you could do this but I think the easiest way (though it might look complicated at first) is to [b:dyh42gxi]modify the go command[/b:dyh42gxi]. There is a guide on how to do that here, <!-- m --><a class=\"postlink\" href=\"http://quest5.net/wiki/Immobilise_the_player\">http://quest5.net/wiki/Immobilise_the_player</a><!-- m -->. Note that you can do that in the GUI but it's actually easier to do it like the tutorial says. You'll also want to set the attributes that tutorial mentions on your player object. You can do that part in the GUI. \n\nThe final piece is to change the player.immobilized flag to false once the player looks at the GPS. To do that, go to the GPS object you made and then the Verbs tab. Create a new verb of 'look', and choose 'run a script'. From there, you can create a new if script that tests if the GPS has been looked at. Here's the general form the code should take:\n\n1) create an attribute of the GPS called 'noticed' and set it to Boolean false. \n2) in the script for the look verb, check if the GPS is noticed. If it is, just print its description. If it isn't, set the noticed attribute to true, change the player to mobile, and then print the description (with perhaps another message that tells the player they can move now). \n\nI deliberately left out all the intermediate steps so you'd get more value out of learning this, but if you have any questions don't hesitate to ask <!-- s:) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) -->\n\nBy the way, I accidentally hit the submit button halfway through this, sorry for any confusion.",
      "EditableFormat": "bbcode",
      "HTML": "hi Jester, welcome to the forum. You're not the only one who has thought text adventures and geocaching are a good combination -- see <!-- m --><a class=\"postlink\" href=\"http://www.intfiction.org/forum/viewtopic.php?f=19&amp;t=2430\">http://www.intfiction.org/forum/viewtop ... =19&amp;t=2430</a><!-- m --> for example. Interesting stuff. <br/><br/>Anyway, for your questions. <br/><br/><blockquote><p>I want the option that if they use a command to move they get asked &quot;are you sure that's the direction you wish to go?&quot; But once they are aware of the gps by having looked at it, they can move north. </p></blockquote><br/><br/>So you want to block all movement until they've looked at the gps. I think just to make life easier you should go ahead and make the gps an object. You can set it up later so that the player can't get rid of it if you like. <br/><br/>There are a couple of ways you could do this but I think the easiest way (though it might look complicated at first) is to <span style=\"font-weight:bold;\">modify the go command</span>. There is a guide on how to do that here, <!-- m --><a class=\"postlink\" href=\"http://quest5.net/wiki/Immobilise_the_player\">http://quest5.net/wiki/Immobilise_the_player</a><!-- m -->. Note that you can do that in the GUI but it's actually easier to do it like the tutorial says. You'll also want to set the attributes that tutorial mentions on your player object. You can do that part in the GUI. <br/><br/>The final piece is to change the player.immobilized flag to false once the player looks at the GPS. To do that, go to the GPS object you made and then the Verbs tab. Create a new verb of 'look', and choose 'run a script'. From there, you can create a new if script that tests if the GPS has been looked at. Here's the general form the code should take:<br/><br/>1) create an attribute of the GPS called 'noticed' and set it to Boolean false. <br/>2) in the script for the look verb, check if the GPS is noticed. If it is, just print its description. If it isn't, set the noticed attribute to true, change the player to mobile, and then print the description (with perhaps another message that tells the player they can move now). <br/><br/>I deliberately left out all the intermediate steps so you'd get more value out of learning this, but if you have any questions don't hesitate to ask <!-- s:) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) --><br/><br/>By the way, I accidentally hit the submit button halfway through this, sorry for any confusion.",
      "PostDate": "2013-10-20T00:56:56+01:00",
      "LastEditDate": null
    }
  ]
}
