{
  "Topic": {
    "TopicId": "4898",
    "ForumId": "5",
    "Title": "Looking for beta testers for \"The Nebula\"",
    "LastUpdated": "2014-12-15T11:34:08+00:00",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "32887",
      "UserId": 0,
      "Username": "adrao",
      "UserAvatar": null,
      "UserGravatar": "ed34572a31feba854c8fd911793f6b1d",
      "EditableText": "I was advised that maybe it would be better to start a new thread to indicate that I am looking for beta testers for my game, the Nebula\n\n<!-- m --><a class=\"postlink\" href=\"http://textadventures.co.uk/games/view/sjyscd3w3eqhqdfa6kzmmq/the-nebula\">http://textadventures.co.uk/games/view/ ... the-nebula</a><!-- m -->\n\nThe game is an improved version of my previous game, which features a more clear character creation system (the page to create the character has been improved), a better explanation of the game mechanics, acknowledgement of playtesters, and has been expanded to include extra dialogue options in some places. \n\nAny feedback would be greatly welcome! Especially,  please let me know which parts of the game you enjoyed most/least, so that I can expand the game accordingly\n\nSome of the key features are below\n\n-Character creation system (5 attributes and 6 different skills)\n-Combat system (includes the character's dodge, laser attack skill, armour, etc), there are around 11 combat sequences, which are resolved automatically by the game using random number generation. \n-328 pages (although some of them change depending on actions taken by the character, so I suspect that this underestimates the true size of the game). \n-Around 17 star systems to explore (though not all are developed to the same extent, still working on adding more things to do in some of them)",
      "EditableFormat": "bbcode",
      "HTML": "I was advised that maybe it would be better to start a new thread to indicate that I am looking for beta testers for my game, the Nebula<br/><br/><!-- m --><a class=\"postlink\" href=\"http://textadventures.co.uk/games/view/sjyscd3w3eqhqdfa6kzmmq/the-nebula\">http://textadventures.co.uk/games/view/ ... the-nebula</a><!-- m --><br/><br/>The game is an improved version of my previous game, which features a more clear character creation system (the page to create the character has been improved), a better explanation of the game mechanics, acknowledgement of playtesters, and has been expanded to include extra dialogue options in some places. <br/><br/>Any feedback would be greatly welcome! Especially,  please let me know which parts of the game you enjoyed most/least, so that I can expand the game accordingly<br/><br/>Some of the key features are below<br/><br/>-Character creation system (5 attributes and 6 different skills)<br/>-Combat system (includes the character's dodge, laser attack skill, armour, etc), there are around 11 combat sequences, which are resolved automatically by the game using random number generation. <br/>-328 pages (although some of them change depending on actions taken by the character, so I suspect that this underestimates the true size of the game). <br/>-Around 17 star systems to explore (though not all are developed to the same extent, still working on adding more things to do in some of them)",
      "PostDate": "2014-12-15T11:34:08+00:00",
      "LastEditDate": null
    }
  ]
}
