{
  "Topic": {
    "TopicId": "5656",
    "ForumId": "10",
    "Title": "Simple question - No programming background",
    "LastUpdated": "2015-11-30T20:00:06+00:00",
    "ReplyCount": 14
  },
  "Posts": [
    {
      "PostId": "38893",
      "UserId": 0,
      "Username": "omgrun",
      "UserAvatar": null,
      "UserGravatar": "2c7e7eed7ccc3b44137db318c0117da4",
      "EditableText": "Hi... as you can see from the title, I have no programming background and I'm trying to do something very simple. Most of the threads I've read are confusing and are too advanced for me to understand, I really need help.\n\nI have a simple chose your own adventure game.\n\nI have &quot;starting point&quot; with option 1, option 2, and option 3.\nOnce the player has exhausted option 3, I want to be able to link back to &quot;starting point&quot; with &quot;option 3&quot; now removed. Is this possible?\nIf so, what's the easiest way to implement it?\n\nPlease explain these concepts to me like I'm five years old. When I mean I have no programming background, I mean I know literally nothing.\nI need to have this project done in four days, so it's sort of time sensitive.\n\nI'd appreciate any help you can offer me!",
      "EditableFormat": "bbcode",
      "HTML": "Hi... as you can see from the title, I have no programming background and I'm trying to do something very simple. Most of the threads I've read are confusing and are too advanced for me to understand, I really need help.<br/><br/>I have a simple chose your own adventure game.<br/><br/>I have &quot;starting point&quot; with option 1, option 2, and option 3.<br/>Once the player has exhausted option 3, I want to be able to link back to &quot;starting point&quot; with &quot;option 3&quot; now removed. Is this possible?<br/>If so, what's the easiest way to implement it?<br/><br/>Please explain these concepts to me like I'm five years old. When I mean I have no programming background, I mean I know literally nothing.<br/>I need to have this project done in four days, so it's sort of time sensitive.<br/><br/>I'd appreciate any help you can offer me!",
      "PostDate": "2015-11-27T17:37:54+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "38894",
      "UserId": 0,
      "Username": "TinFoilMkIV",
      "UserAvatar": null,
      "UserGravatar": "d70c7b1a4be0b3fe6f68912d606f4298",
      "EditableText": "While maybe not the most efficient method, one of the more basic ways to pull this off is to use basic 'if' checks for text display. The text processor for quest allows you to put this directly into your text itself without having to run any extra scripts controlling it.\nformat for in text 'if' check\n[quote:2kr5x3v8]{if object.attribute:text}\nDisplay text only if object attribute is true[/quote:2kr5x3v8]\\\nyou insert the whole expression with the braces directly into your text display. So it will look something like\n[code:2kr5x3v8]msg (&quot;Option 1 text here, Option 2 text here{if object&#46;attribute&#58;, Option3 text here} &quot;)[/code:2kr5x3v8]\n\nNow you will need to work outside the basic text display and such to make this function the way you want, but not a whole lot. What you will need is an attribute stored in the location of your choice that will be used to control what text you will see at any given time. I personally recommend creating a control object outside the normal game area to hold such things, as it generally helps to keep things organized and isn't likely to get modified by something unrelated on accident.\n\nWhat the  actual {if object.attribute:text} does is this. When Quest is printing out your text and runs into this line, it goes and looks at the '[b:2kr5x3v8]object.attribute[/b:2kr5x3v8]' part first, and will then try to locate the said 'attribute' within the named 'object'. If the names are incorrect or simply doesn't match anything in your game, you'll get an error, so spelling and such is important here. Now when this does match an object and attribute, it will then see if your attribute equates to either &quot;true&quot; or &quot;false&quot;, so the easiest way to manage this is to make sure the attribute in question is a boolean attribute, which literally means it equals either &quot;true&quot; or &quot;false&quot; as it's only possible values, basically like a light switch, it's either set to &quot;on&quot; or &quot;off&quot; at any given time.\n\nSo now assuming your attribute is set correctly and no typos involved, the whole {if object.attribute:text} will do one of two things. If your attribute was set to &quot;false&quot;, then it will not display the '[b:2kr5x3v8]text[/b:2kr5x3v8]', however when it's true it will display the '[b:2kr5x3v8]text[/b:2kr5x3v8]' section as if it was normally part of your normal text string. So you can setup a situation where text only shows up under certain circumstances. You will of course at some point need to modify the attribute to turn it either on or off as you need.\n\nSo in your case you have text that is normally there but will disappear at some point. So your control attribute will start out as &quot;true&quot;. So the first time through, your option 3 will be seen by the player. Now when they reach whatever your endpoint for option 3 is, you will need to have to do a bit of scripting, tho nothing terribly complicated. So before you send the player back to &quot;starting point&quot; you will need something like this[code:2kr5x3v8]object&#46;attribute = false[/code:2kr5x3v8] Replacing Object, and Attribute with the name of the object and attribute you are using, this will then &quot;turn off&quot; your option 3, so that when they go back to &quot;starting point&quot; it will no longer be there.\n\nThere are other ways to pull this off, and most are pretty similar in concept tho this should be the least coding intensive method.\n\nText Processor commands for reference\n<!-- m --><a class=\"postlink\" href=\"http://docs.textadventures.co.uk/quest/text_processor.html\">http://docs.textadventures.co.uk/quest/ ... essor.html</a><!-- m -->",
      "EditableFormat": "bbcode",
      "HTML": "While maybe not the most efficient method, one of the more basic ways to pull this off is to use basic 'if' checks for text display. The text processor for quest allows you to put this directly into your text itself without having to run any extra scripts controlling it.<br/>format for in text 'if' check<br/><blockquote><p>{if object.attribute:text}<br/>Display text only if object attribute is true</p></blockquote>\\<br/>you insert the whole expression with the braces directly into your text display. So it will look something like<br/><pre><code>msg (&quot;Option 1 text here, Option 2 text here{if object&#46;attribute&#58;, Option3 text here} &quot;)</code></pre><br/><br/>Now you will need to work outside the basic text display and such to make this function the way you want, but not a whole lot. What you will need is an attribute stored in the location of your choice that will be used to control what text you will see at any given time. I personally recommend creating a control object outside the normal game area to hold such things, as it generally helps to keep things organized and isn't likely to get modified by something unrelated on accident.<br/><br/>What the  actual {if object.attribute:text} does is this. When Quest is printing out your text and runs into this line, it goes and looks at the '<span style=\"font-weight:bold;\">object.attribute</span>' part first, and will then try to locate the said 'attribute' within the named 'object'. If the names are incorrect or simply doesn't match anything in your game, you'll get an error, so spelling and such is important here. Now when this does match an object and attribute, it will then see if your attribute equates to either &quot;true&quot; or &quot;false&quot;, so the easiest way to manage this is to make sure the attribute in question is a boolean attribute, which literally means it equals either &quot;true&quot; or &quot;false&quot; as it's only possible values, basically like a light switch, it's either set to &quot;on&quot; or &quot;off&quot; at any given time.<br/><br/>So now assuming your attribute is set correctly and no typos involved, the whole {if object.attribute:text} will do one of two things. If your attribute was set to &quot;false&quot;, then it will not display the '<span style=\"font-weight:bold;\">text</span>', however when it's true it will display the '<span style=\"font-weight:bold;\">text</span>' section as if it was normally part of your normal text string. So you can setup a situation where text only shows up under certain circumstances. You will of course at some point need to modify the attribute to turn it either on or off as you need.<br/><br/>So in your case you have text that is normally there but will disappear at some point. So your control attribute will start out as &quot;true&quot;. So the first time through, your option 3 will be seen by the player. Now when they reach whatever your endpoint for option 3 is, you will need to have to do a bit of scripting, tho nothing terribly complicated. So before you send the player back to &quot;starting point&quot; you will need something like this<pre><code>object&#46;attribute = false</code></pre> Replacing Object, and Attribute with the name of the object and attribute you are using, this will then &quot;turn off&quot; your option 3, so that when they go back to &quot;starting point&quot; it will no longer be there.<br/><br/>There are other ways to pull this off, and most are pretty similar in concept tho this should be the least coding intensive method.<br/><br/>Text Processor commands for reference<br/><!-- m --><a class=\"postlink\" href=\"http://docs.textadventures.co.uk/quest/text_processor.html\">http://docs.textadventures.co.uk/quest/ ... essor.html</a><!-- m -->",
      "PostDate": "2015-11-27T18:23:19+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "38895",
      "UserId": 0,
      "Username": "omgrun",
      "UserAvatar": null,
      "UserGravatar": "2c7e7eed7ccc3b44137db318c0117da4",
      "EditableText": "So I should use an &quot;if&quot; script?\n\nThis is what I currently have: [url:ad2hjf3u]https&#58;//i&#46;gyazo&#46;com/8a18474ae6c760c21334a89550f5f727&#46;png[/url:ad2hjf3u]\n\nIf player has seen (page for option 1), remove page link from (start screen) to (??)\nI don't understand the rest. What purpose does the &quot;to&quot; have?\nWhat if I just want to remove it, and not move it &quot;to&quot; anywhere?",
      "EditableFormat": "bbcode",
      "HTML": "So I should use an &quot;if&quot; script?<br/><br/>This is what I currently have: <a href=\"https&#58;//i&#46;gyazo&#46;com/8a18474ae6c760c21334a89550f5f727&#46;png\" rel=\"nofollow\">https&#58;//i&#46;gyazo&#46;com/8a18474ae6c760c21334a89550f5f727&#46;png</a><br/><br/>If player has seen (page for option 1), remove page link from (start screen) to (??)<br/>I don't understand the rest. What purpose does the &quot;to&quot; have?<br/>What if I just want to remove it, and not move it &quot;to&quot; anywhere?",
      "PostDate": "2015-11-27T18:51:28+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "38896",
      "UserId": 0,
      "Username": "TinFoilMkIV",
      "UserAvatar": null,
      "UserGravatar": "d70c7b1a4be0b3fe6f68912d606f4298",
      "EditableText": "For reference, look at the 'add page link' script. It creates a link from one page, to a second page. The 'remove page link' function works the same but in reverse, you have to tell it what page it's going from and what page the link goes to, so that it can remove the correct link, and not just any random link on the from page.\n\nEDIT: feel free to skip down to the big lined off edit section as I wrote this first part from more of a building everything via page scripts and not the normal game book format due to my own lack of familiarity with it.\n\n\nYou have the right idea however you're doing more in the scripting rather than running off the text processor, which really is a matter of preference and what is easier for you to read.\n\nI'll see if I can give you a good example of both methods. So first thing first, a useful trick if you want to understand more of the coding behind the gui scripts, as well as should help you understand what you're looking at when people post code, and to more easily copy some code into your game. So in your screenshot, down where you actually have your scripts and such, the tab to the left says &quot;Script&#058;&quot;. Now if you look to the right of that you have a bunch of buttons. The one that I want to point out here is the &quot;code view&quot;, its to the right of the clipboard and looks like a single page with text on it. What this does is switches the gui view of your scripts for the actual text based code, and clicking it again will switch back (if the code is typed correctly, errors in the code will cause it to go red instead of converting back to the gui mode).\n\nFor example, the code view of what you have there in that image comes out to this (minus page names)\n[code:3jlg12hl]if (HasSeenPage(Page1)) {\n  RemovePageLink (Page1, )\n}[/code:3jlg12hl]\nand again clicking the code view button to turn it off should go back to exactly what you saw before.\n\nNow game books tend to be more limited and the type of scripting you can actively use to manipulate them, which is why I was recommending using the build in text functions. What you have there will certainly work, as it will take the link out of the page. What I was saying would be to have the text itself look to see what it should be showing instead of actually moving the links around. ie:\n[code:3jlg12hl]msg (&quot;blah blah blah, page 1 and whatnot stuff is happening, what will you do?&quot;)\nmsg (&quot;&quot;)  //this is a blank line\nmsg (&quot;&#91;option1&#93; &#91;option2&#93; {if object&#46;attribute&#58;&#91;option3&#93;}&quot;)[/code:3jlg12hl]\n\nThey accomplish basically the same thing, an option 3 that is not always there, the method depends on personal preference and organization.\n\n\nAlso an alternative that may be a bit more messy but actually simpler, would be to duplicate the start page onto page 2, so you have &quot;start page&quot; and &quot;start page 2&quot; or whatever you want to call them, and simply have &quot;start page 2&quot; not have option 3. This would basically be the method you would have to apply to a physical game book since you can't really re-write a physical book. Although I personally think that method would likely get messy very quickly if it's a situation that comes up more than a very few times.\n\n[b:3jlg12hl]=============================================================================================[/b:3jlg12hl]\n\nEDIT: okay so part of this is my severe lack of familiarity with the game book option, as I'm the kind of guy that would just make a fake gamebook in text adventure mode if I was going to make one so I honestly haven't looked at them much, so sorry for any added confusion caused by this. Turns out I was thinking this was a bit more in depth than it is with build in features.\n\nSo, What you'll want is for a page where something important happens to have the page type set from &quot;text&quot; to &quot;script + text&quot;. What this will do is allow you to have some code run when the player sees this page. In this case the main thing we want is to set some flags to say what text will and will not show up.\n\nFor your starting page, we will need a two part script, first we need to go down to scripts, and select &quot;first time&quot;, this way we only turn the flag on once, otherwise it will just turn back on every time we come to this page. Then we need to set a flag to on, so under the add scripts, variables, set flag on. Leave the drop down at its default of 'flag name', and enter a name of your choice for the flag, so in this case I'm calling it &quot;ShowOption3&quot;. The other option is to have a page before the &quot;start page&quot; that turns the flag on, then returning to &quot;start page&quot; will not turn it back on every time. Now in the Description section of the page you have some buttons on the right side for doing special text functions which are going to help with the next part.\n\nSo since we want the page options to be under our control without going through a bunch of different scripts, I would remove all of the page links at the bottom, instead we are going to use the 'Page' button on the right hand side to make our own links within the text.\n\nSo when you click the 'Page' button, it will ask you for the text for the link, and what page it will go to. This works the same as an actual page link, however its built right into the description of the page. You can even turn words anywhere in the description into such links. Anyways the important thing here is that we can now control our links without having to setup a bunch of functions and such. This is where the {if} for the text processor comes in. I'm going to use {if ShowOption3:{page:Page4:Choose options 3}}, instead of just a normal page link, so that this specific page link will only be seen when I want it to. The reason we don't just leave the other links as normal is that they will be below the description so we end up with option 1 and 2 being below 3, plus you can do more fancy stuff like building the links into the actual description and such.\n\nAnyways, to make 'option3' dissappear we have the page it leads to set to 'script + text', and simply run the script 'set flag off' for the flag &quot;ShowOption3&quot; now when we return to the starting page, option 3 is now turned off.",
      "EditableFormat": "bbcode",
      "HTML": "For reference, look at the 'add page link' script. It creates a link from one page, to a second page. The 'remove page link' function works the same but in reverse, you have to tell it what page it's going from and what page the link goes to, so that it can remove the correct link, and not just any random link on the from page.<br/><br/>EDIT: feel free to skip down to the big lined off edit section as I wrote this first part from more of a building everything via page scripts and not the normal game book format due to my own lack of familiarity with it.<br/><br/><br/>You have the right idea however you're doing more in the scripting rather than running off the text processor, which really is a matter of preference and what is easier for you to read.<br/><br/>I'll see if I can give you a good example of both methods. So first thing first, a useful trick if you want to understand more of the coding behind the gui scripts, as well as should help you understand what you're looking at when people post code, and to more easily copy some code into your game. So in your screenshot, down where you actually have your scripts and such, the tab to the left says &quot;Script&#058;&quot;. Now if you look to the right of that you have a bunch of buttons. The one that I want to point out here is the &quot;code view&quot;, its to the right of the clipboard and looks like a single page with text on it. What this does is switches the gui view of your scripts for the actual text based code, and clicking it again will switch back (if the code is typed correctly, errors in the code will cause it to go red instead of converting back to the gui mode).<br/><br/>For example, the code view of what you have there in that image comes out to this (minus page names)<br/><pre><code>if (HasSeenPage(Page1)) {<br/>  RemovePageLink (Page1, )<br/>}</code></pre><br/>and again clicking the code view button to turn it off should go back to exactly what you saw before.<br/><br/>Now game books tend to be more limited and the type of scripting you can actively use to manipulate them, which is why I was recommending using the build in text functions. What you have there will certainly work, as it will take the link out of the page. What I was saying would be to have the text itself look to see what it should be showing instead of actually moving the links around. ie:<br/><pre><code>msg (&quot;blah blah blah, page 1 and whatnot stuff is happening, what will you do?&quot;)<br/>msg (&quot;&quot;)  //this is a blank line<br/>msg (&quot;&#91;option1&#93; &#91;option2&#93; {if object&#46;attribute&#58;&#91;option3&#93;}&quot;)</code></pre><br/><br/>They accomplish basically the same thing, an option 3 that is not always there, the method depends on personal preference and organization.<br/><br/><br/>Also an alternative that may be a bit more messy but actually simpler, would be to duplicate the start page onto page 2, so you have &quot;start page&quot; and &quot;start page 2&quot; or whatever you want to call them, and simply have &quot;start page 2&quot; not have option 3. This would basically be the method you would have to apply to a physical game book since you can't really re-write a physical book. Although I personally think that method would likely get messy very quickly if it's a situation that comes up more than a very few times.<br/><br/><span style=\"font-weight:bold;\">=============================================================================================</span><br/><br/>EDIT: okay so part of this is my severe lack of familiarity with the game book option, as I'm the kind of guy that would just make a fake gamebook in text adventure mode if I was going to make one so I honestly haven't looked at them much, so sorry for any added confusion caused by this. Turns out I was thinking this was a bit more in depth than it is with build in features.<br/><br/>So, What you'll want is for a page where something important happens to have the page type set from &quot;text&quot; to &quot;script + text&quot;. What this will do is allow you to have some code run when the player sees this page. In this case the main thing we want is to set some flags to say what text will and will not show up.<br/><br/>For your starting page, we will need a two part script, first we need to go down to scripts, and select &quot;first time&quot;, this way we only turn the flag on once, otherwise it will just turn back on every time we come to this page. Then we need to set a flag to on, so under the add scripts, variables, set flag on. Leave the drop down at its default of 'flag name', and enter a name of your choice for the flag, so in this case I'm calling it &quot;ShowOption3&quot;. The other option is to have a page before the &quot;start page&quot; that turns the flag on, then returning to &quot;start page&quot; will not turn it back on every time. Now in the Description section of the page you have some buttons on the right side for doing special text functions which are going to help with the next part.<br/><br/>So since we want the page options to be under our control without going through a bunch of different scripts, I would remove all of the page links at the bottom, instead we are going to use the 'Page' button on the right hand side to make our own links within the text.<br/><br/>So when you click the 'Page' button, it will ask you for the text for the link, and what page it will go to. This works the same as an actual page link, however its built right into the description of the page. You can even turn words anywhere in the description into such links. Anyways the important thing here is that we can now control our links without having to setup a bunch of functions and such. This is where the {if} for the text processor comes in. I'm going to use {if ShowOption3:{page:Page4:Choose options 3}}, instead of just a normal page link, so that this specific page link will only be seen when I want it to. The reason we don't just leave the other links as normal is that they will be below the description so we end up with option 1 and 2 being below 3, plus you can do more fancy stuff like building the links into the actual description and such.<br/><br/>Anyways, to make 'option3' dissappear we have the page it leads to set to 'script + text', and simply run the script 'set flag off' for the flag &quot;ShowOption3&quot; now when we return to the starting page, option 3 is now turned off.",
      "PostDate": "2015-11-27T19:20:42+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "38897",
      "UserId": 0,
      "Username": "omgrun",
      "UserAvatar": null,
      "UserGravatar": "2c7e7eed7ccc3b44137db318c0117da4",
      "EditableText": "I really appreciate you trying to work this out with me. I promise I'm not intentionally trying to be dumb or difficult. But explaining things like this requires a lot of basic knowledge that I don't have. I don't know what an attribute is or what it does. I don't understand what things like a &quot;control object&quot; even are or what it means to be &quot;outside the normal game area&quot;\nI don't understand code at all and half of what you're saying is complete greek to me I'm gonna try to explain what I currently have, what I currently understand, and what I can do to make the game do what I want. It doesnt need to be fancy, and I'd prefer to be able to work within the stuff I already have instead of re-working it to do something else.\n\nI'm not trying to add an option that the player hasn't seen before, only remove options that they have already been attempted.\n I've been using the main interface and not the script view to construct my game, so it looks like this.\n\n[code:1w4q6ra0] &lt;object name=&quot;Start screen&quot;&gt;\n    &lt;description&gt;&lt;!&#91;CDATA&#91;You're a senior in art school&#46;&lt;br/&gt;&lt;br/&gt;-description of your sort of lackluster history in art school&lt;br/&gt;-You're so close to graduation now, all you have to do is finish one more project!&lt;br/&gt;-description of room&lt;br/&gt;-Your brain is blank, and you're experiencing quite a bit of art block&#46;&lt;br/&gt;-So, what will you do?&#93;&#93;&gt;&lt;/description&gt;\n    &lt;options type=&quot;stringdictionary&quot;&gt;\n      &lt;item&gt;\n        &lt;key&gt;Idea start&lt;/key&gt;\n        &lt;value&gt;Try to come up with an idea&#46;&lt;/value&gt;\n      &lt;/item&gt;\n      &lt;item&gt;\n        &lt;key&gt;Friend start&lt;/key&gt;\n        &lt;value&gt;Call your friend to hang out&#46;&lt;/value&gt;\n      &lt;/item&gt;\n      &lt;item&gt;\n        &lt;key&gt;Video games start&lt;/key&gt;\n        &lt;value&gt;Slack off and play video games&#46;&lt;/value&gt;\n      &lt;/item&gt;\n      &lt;item&gt;\n        &lt;key&gt;Go for a walk start&lt;/key&gt;\n        &lt;value&gt;Go for a walk&#46;&lt;/value&gt;\n      &lt;/item&gt;[/code:1w4q6ra0]\n\nI don't have any tags that say &quot;msg&quot; and I don't understand how I would make them print &quot;msg&quot; instead of giving options in the string dictionary, which is what it seems to be doing?\n\nWhat I'm gathering is that I should make an object attribute (??) for when the page has been seen and use it to control which options are available. \n\nSo would I add a function... right? Or type it onto each page individually?  I might label it &quot;ifseen&quot; and either set to true (yes, the player has seen it) or  false (no, the player has not seen it) but HOW exactly I would do that is kind of lost on me. \n\nIs it possible to hide &quot;item: video games start&quot; after the player has already seen the &quot;video games&quot; option?\n\nUse small words. Dang. This is killing me... it should not be so hard, but I'm so confused.",
      "EditableFormat": "bbcode",
      "HTML": "I really appreciate you trying to work this out with me. I promise I'm not intentionally trying to be dumb or difficult. But explaining things like this requires a lot of basic knowledge that I don't have. I don't know what an attribute is or what it does. I don't understand what things like a &quot;control object&quot; even are or what it means to be &quot;outside the normal game area&quot;<br/>I don't understand code at all and half of what you're saying is complete greek to me I'm gonna try to explain what I currently have, what I currently understand, and what I can do to make the game do what I want. It doesnt need to be fancy, and I'd prefer to be able to work within the stuff I already have instead of re-working it to do something else.<br/><br/>I'm not trying to add an option that the player hasn't seen before, only remove options that they have already been attempted.<br/> I've been using the main interface and not the script view to construct my game, so it looks like this.<br/><br/><pre><code> &lt;object name=&quot;Start screen&quot;&gt;<br/>    &lt;description&gt;&lt;!&#91;CDATA&#91;You're a senior in art school&#46;&lt;br/&gt;&lt;br/&gt;-description of your sort of lackluster history in art school&lt;br/&gt;-You're so close to graduation now, all you have to do is finish one more project!&lt;br/&gt;-description of room&lt;br/&gt;-Your brain is blank, and you're experiencing quite a bit of art block&#46;&lt;br/&gt;-So, what will you do?&#93;&#93;&gt;&lt;/description&gt;<br/>    &lt;options type=&quot;stringdictionary&quot;&gt;<br/>      &lt;item&gt;<br/>        &lt;key&gt;Idea start&lt;/key&gt;<br/>        &lt;value&gt;Try to come up with an idea&#46;&lt;/value&gt;<br/>      &lt;/item&gt;<br/>      &lt;item&gt;<br/>        &lt;key&gt;Friend start&lt;/key&gt;<br/>        &lt;value&gt;Call your friend to hang out&#46;&lt;/value&gt;<br/>      &lt;/item&gt;<br/>      &lt;item&gt;<br/>        &lt;key&gt;Video games start&lt;/key&gt;<br/>        &lt;value&gt;Slack off and play video games&#46;&lt;/value&gt;<br/>      &lt;/item&gt;<br/>      &lt;item&gt;<br/>        &lt;key&gt;Go for a walk start&lt;/key&gt;<br/>        &lt;value&gt;Go for a walk&#46;&lt;/value&gt;<br/>      &lt;/item&gt;</code></pre><br/><br/>I don't have any tags that say &quot;msg&quot; and I don't understand how I would make them print &quot;msg&quot; instead of giving options in the string dictionary, which is what it seems to be doing?<br/><br/>What I'm gathering is that I should make an object attribute (??) for when the page has been seen and use it to control which options are available. <br/><br/>So would I add a function... right? Or type it onto each page individually?  I might label it &quot;ifseen&quot; and either set to true (yes, the player has seen it) or  false (no, the player has not seen it) but HOW exactly I would do that is kind of lost on me. <br/><br/>Is it possible to hide &quot;item: video games start&quot; after the player has already seen the &quot;video games&quot; option?<br/><br/>Use small words. Dang. This is killing me... it should not be so hard, but I'm so confused.",
      "PostDate": "2015-11-27T19:50:52+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "38898",
      "UserId": 0,
      "Username": "omgrun",
      "UserAvatar": null,
      "UserGravatar": "2c7e7eed7ccc3b44137db318c0117da4",
      "EditableText": "Okay, I read your edit and this is starting to make sense to me! I'm changing the stuff I've already made now. I think I can figure this out now, But I'll come back if I run into any errors I can't figure out.\n\n\nThanks so much for your help, you're a lifesaver!",
      "EditableFormat": "bbcode",
      "HTML": "Okay, I read your edit and this is starting to make sense to me! I'm changing the stuff I've already made now. I think I can figure this out now, But I'll come back if I run into any errors I can't figure out.<br/><br/><br/>Thanks so much for your help, you're a lifesaver!",
      "PostDate": "2015-11-27T20:00:41+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "38899",
      "UserId": 0,
      "Username": "TinFoilMkIV",
      "UserAvatar": null,
      "UserGravatar": "d70c7b1a4be0b3fe6f68912d606f4298",
      "EditableText": "yea sorry about the added confusion, I'm used to working 99% in scripts and barely even looked at how the game books are actually formatted in the editor before now. all the msg(&quot;asfdsafs&quot;) stuff is how you show text in a script so I kinda default to that when thinking in text.\n\nGood to hear you're making some progress now.\n\nEDIT: Just to hopefully clear up some confusion and maybe help down the road I'll try to clarify a bit.\n\nDon't worry too much about the attributes stuff, seems they're almost exclusively for text adventure mode so it makes sense that you had no idea what I was talking about. Basically tho an attribute is some sort of value that belongs to a specific object, and example is that a flag is actually a type of attribute that belongs to the game object itself, so it applies everywhere. But yea apparently the Game Book mode doesn't use any attributes outside game flags, so no need to really worry about it.\n\nThe idea of a &quot;control object&quot; is something that exists solely to hold information or activate code on other objects. So something that the player will never directly interact with but helps to keep the game moving. Generally they're not actually necessary but they help a lot with organization and avoiding mishaps with objects that see a lot of action.\n\nAnd &quot;normal game area&quot; is kinda subjective, I use the term to mean &quot;area a player can encounter or interact with&quot;, so something outside of this is basically like an unreachable room where you keep things you want to mess with as the game developer but aren't supposed to be part of the actual game experience. Or in terms of a game book a page 9999 that has no links that you keep notes on or test scripts on and that the player will never see in the actual game.",
      "EditableFormat": "bbcode",
      "HTML": "yea sorry about the added confusion, I'm used to working 99% in scripts and barely even looked at how the game books are actually formatted in the editor before now. all the msg(&quot;asfdsafs&quot;) stuff is how you show text in a script so I kinda default to that when thinking in text.<br/><br/>Good to hear you're making some progress now.<br/><br/>EDIT: Just to hopefully clear up some confusion and maybe help down the road I'll try to clarify a bit.<br/><br/>Don't worry too much about the attributes stuff, seems they're almost exclusively for text adventure mode so it makes sense that you had no idea what I was talking about. Basically tho an attribute is some sort of value that belongs to a specific object, and example is that a flag is actually a type of attribute that belongs to the game object itself, so it applies everywhere. But yea apparently the Game Book mode doesn't use any attributes outside game flags, so no need to really worry about it.<br/><br/>The idea of a &quot;control object&quot; is something that exists solely to hold information or activate code on other objects. So something that the player will never directly interact with but helps to keep the game moving. Generally they're not actually necessary but they help a lot with organization and avoiding mishaps with objects that see a lot of action.<br/><br/>And &quot;normal game area&quot; is kinda subjective, I use the term to mean &quot;area a player can encounter or interact with&quot;, so something outside of this is basically like an unreachable room where you keep things you want to mess with as the game developer but aren't supposed to be part of the actual game experience. Or in terms of a game book a page 9999 that has no links that you keep notes on or test scripts on and that the player will never see in the actual game.",
      "PostDate": "2015-11-27T22:09:46+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "38901",
      "UserId": 0,
      "Username": "omgrun",
      "UserAvatar": null,
      "UserGravatar": "2c7e7eed7ccc3b44137db318c0117da4",
      "EditableText": "I managed to figure out the flagging, and even a few things on my own. A lot of this stuff is still way too advanced, but I feel like I've reached the &quot;stick figure drawing&quot; level of skill required. \nNow the problem I'm having is that the game is over 20 MB, and won't upload on this site.\n\nI have no idea how it could be so big. It's 38 unique pages, Some choices go away after they've been flagged, but there's no fancy code or anything like that.\nI don't know how to transfer it to another filetype or anything else... dang it.",
      "EditableFormat": "bbcode",
      "HTML": "I managed to figure out the flagging, and even a few things on my own. A lot of this stuff is still way too advanced, but I feel like I've reached the &quot;stick figure drawing&quot; level of skill required. <br/>Now the problem I'm having is that the game is over 20 MB, and won't upload on this site.<br/><br/>I have no idea how it could be so big. It's 38 unique pages, Some choices go away after they've been flagged, but there's no fancy code or anything like that.<br/>I don't know how to transfer it to another filetype or anything else... dang it.",
      "PostDate": "2015-11-28T04:34:47+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "38904",
      "UserId": 0,
      "Username": "TinFoilMkIV",
      "UserAvatar": null,
      "UserGravatar": "d70c7b1a4be0b3fe6f68912d606f4298",
      "EditableText": "Hmm, do you have any images or sound files in your game? Those are the only things I can think of that would increase the size by that much without an incredibly huge game.",
      "EditableFormat": "bbcode",
      "HTML": "Hmm, do you have any images or sound files in your game? Those are the only things I can think of that would increase the size by that much without an incredibly huge game.",
      "PostDate": "2015-11-28T12:26:45+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "38907",
      "UserId": 0,
      "Username": "XanMag",
      "UserAvatar": "7161_1436827710.jpg",
      "UserGravatar": "4b45a3afd18077f76f6569225c422bdb",
      "EditableText": "I'm guessing you have MP3 files on there.  Converting them to .wav will save a ton of space.  X2 is far bigger than that even... Not sure how I'm going to widdle it down... I use media.io as my converter.  Very simple.\n\nAlso, check the folder you have your .aslx file in.  Is there a chance other files got saved in there?  On upload, Quest takes the entire folder, not just the .aslx file.",
      "EditableFormat": "bbcode",
      "HTML": "I'm guessing you have MP3 files on there.  Converting them to .wav will save a ton of space.  X2 is far bigger than that even... Not sure how I'm going to widdle it down... I use media.io as my converter.  Very simple.<br/><br/>Also, check the folder you have your .aslx file in.  Is there a chance other files got saved in there?  On upload, Quest takes the entire folder, not just the .aslx file.",
      "PostDate": "2015-11-28T14:39:22+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "38909",
      "UserId": 0,
      "Username": "omgrun",
      "UserAvatar": null,
      "UserGravatar": "2c7e7eed7ccc3b44137db318c0117da4",
      "EditableText": "I don't even have pictures. No music, no anything. The game is all text. \n\n.... I moved the folder. it's 18 KB now. HAHA. what? I think It was saving my entire folder full of crap along with it.",
      "EditableFormat": "bbcode",
      "HTML": "I don't even have pictures. No music, no anything. The game is all text. <br/><br/>.... I moved the folder. it's 18 KB now. HAHA. what? I think It was saving my entire folder full of crap along with it.",
      "PostDate": "2015-11-28T16:04:04+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "38910",
      "UserId": 0,
      "Username": "TinFoilMkIV",
      "UserAvatar": null,
      "UserGravatar": "d70c7b1a4be0b3fe6f68912d606f4298",
      "EditableText": "Yea it had to have been picking up a bunch of other files you didn't want with it to get that kind of size. Quest games without any extra sounds/music/images/whatever are quite small.",
      "EditableFormat": "bbcode",
      "HTML": "Yea it had to have been picking up a bunch of other files you didn't want with it to get that kind of size. Quest games without any extra sounds/music/images/whatever are quite small.",
      "PostDate": "2015-11-28T16:14:26+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "39031",
      "UserId": 0,
      "Username": "omgrun",
      "UserAvatar": null,
      "UserGravatar": "2c7e7eed7ccc3b44137db318c0117da4",
      "EditableText": "More painfully basic questions incoming. I'm pretty much finished with my game and I'm trying to do one last thing... I want the html body area to be black to match my actual game. (right now only my gameborder background is black)\n\nI can use the &quot;web tools&quot; view to modify it and get what I want, but it never makes a lasting change and I can't figure out how to edit the actual css stylesheets.\n\nI've been poring over the &quot;modifying the UI&quot; section and I'm trying to use a Jquery command to edit the html body background to be black, but either my syntax is wrong or I'm not understanding the right way to do it. \n\nplz help :'(\n\nYou guys have been super awesome so far. I really would not have made it this far without help.",
      "EditableFormat": "bbcode",
      "HTML": "More painfully basic questions incoming. I'm pretty much finished with my game and I'm trying to do one last thing... I want the html body area to be black to match my actual game. (right now only my gameborder background is black)<br/><br/>I can use the &quot;web tools&quot; view to modify it and get what I want, but it never makes a lasting change and I can't figure out how to edit the actual css stylesheets.<br/><br/>I've been poring over the &quot;modifying the UI&quot; section and I'm trying to use a Jquery command to edit the html body background to be black, but either my syntax is wrong or I'm not understanding the right way to do it. <br/><br/>plz help :'(<br/><br/>You guys have been super awesome so far. I really would not have made it this far without help.",
      "PostDate": "2015-11-30T18:17:37+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "39032",
      "UserId": 0,
      "Username": "XanMag",
      "UserAvatar": "7161_1436827710.jpg",
      "UserGravatar": "4b45a3afd18077f76f6569225c422bdb",
      "EditableText": "I'm not sure if this thread is helpful or not but I read your recent query and remembered this was posted not too long ago.  Hope it is useful.\n\n<!-- l --><a class=\"postlink-local\" href=\"http://forum.textadventures.co.uk/viewtopic.php?f=18&amp;t=5283\">viewtopic.php?f=18&amp;t=5283</a><!-- l -->",
      "EditableFormat": "bbcode",
      "HTML": "I'm not sure if this thread is helpful or not but I read your recent query and remembered this was posted not too long ago.  Hope it is useful.<br/><br/><!-- l --><a class=\"postlink-local\" href=\"http://forum.textadventures.co.uk/viewtopic.php?f=18&amp;t=5283\">viewtopic.php?f=18&amp;t=5283</a><!-- l -->",
      "PostDate": "2015-11-30T19:22:56+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "39033",
      "UserId": 0,
      "Username": "omgrun",
      "UserAvatar": null,
      "UserGravatar": "2c7e7eed7ccc3b44137db318c0117da4",
      "EditableText": "I was trying to use that thread. \nMy problem is all of those things refer to changing stuff within the game border. I'm just trying to get the area outside the gameborder, the body color, or the margin color to go black.\nif there's a way to edit the &quot;playercore.css&quot; sheet and get it to stick, that would be valuable. \nI've seen other games do it, I just can't figure it out. \nSomething so simple should not be this hard, but I have 0 coding experience so having nothing work and having no idea why it doesn't work is like continually tumbling down an escalator.\n\nHere is a link to the game, for reference. [url:1e7075qv]http&#58;//play&#46;textadventures&#46;co&#46;uk/Play&#46;aspx?id=xdsujcqx3kwc9pv3x6vmpw[/url:1e7075qv]\n\n\nEdit: I jury-rigged it by increasing the game size and the padding.\nSloppy solution, but it's better than a white background.",
      "EditableFormat": "bbcode",
      "HTML": "I was trying to use that thread. <br/>My problem is all of those things refer to changing stuff within the game border. I'm just trying to get the area outside the gameborder, the body color, or the margin color to go black.<br/>if there's a way to edit the &quot;playercore.css&quot; sheet and get it to stick, that would be valuable. <br/>I've seen other games do it, I just can't figure it out. <br/>Something so simple should not be this hard, but I have 0 coding experience so having nothing work and having no idea why it doesn't work is like continually tumbling down an escalator.<br/><br/>Here is a link to the game, for reference. <a href=\"http&#58;//play&#46;textadventures&#46;co&#46;uk/Play&#46;aspx?id=xdsujcqx3kwc9pv3x6vmpw\" rel=\"nofollow\">http&#58;//play&#46;textadventures&#46;co&#46;uk/Play&#46;aspx?id=xdsujcqx3kwc9pv3x6vmpw</a><br/><br/><br/>Edit: I jury-rigged it by increasing the game size and the padding.<br/>Sloppy solution, but it's better than a white background.",
      "PostDate": "2015-11-30T20:00:06+00:00",
      "LastEditDate": null
    }
  ]
}
