{
  "Topic": {
    "TopicId": "704",
    "ForumId": "10",
    "Title": "Scoring?",
    "LastUpdated": "2005-03-07T07:25:47+00:00",
    "ReplyCount": 1
  },
  "Posts": [
    {
      "PostId": "5359",
      "UserId": 0,
      "Username": "Insigma",
      "UserAvatar": null,
      "UserGravatar": "1b8dd07c85d0c6670446fe6efcc6d214",
      "EditableText": "Is it possible (I'm sure it is) to implement a simple scoring system into games? I'm sure I've read it in the help files, but if it [i:2jsgcnb3]is[/i:2jsgcnb3] there I can't find it now at all. Basically I need to set up a command that can only be implemented once the player has completed a set number of tasks. I could organise it using flags, but theoretically it'd be much easier if it could just be activated when a certain score is reached.\n\nAny suggestions? Thanks.",
      "EditableFormat": "bbcode",
      "HTML": "Is it possible (I'm sure it is) to implement a simple scoring system into games? I'm sure I've read it in the help files, but if it <span style=\"font-style:italic;\">is</span> there I can't find it now at all. Basically I need to set up a command that can only be implemented once the player has completed a set number of tasks. I could organise it using flags, but theoretically it'd be much easier if it could just be activated when a certain score is reached.<br/><br/>Any suggestions? Thanks.",
      "PostDate": "2005-03-07T02:53:40+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "5361",
      "UserId": 0,
      "Username": "francisstokes",
      "UserAvatar": null,
      "UserGravatar": "a4b7bf4c5684f5131a294bcd35564442",
      "EditableText": "You could set up a status variable for this.When the player does something that earns points,add a script that increses the variable.Then add a conditional script to check if the score is equal to whatever and add the necessary script.",
      "EditableFormat": "bbcode",
      "HTML": "You could set up a status variable for this.When the player does something that earns points,add a script that increses the variable.Then add a conditional script to check if the score is equal to whatever and add the necessary script.",
      "PostDate": "2005-03-07T07:25:47+00:00",
      "LastEditDate": null
    }
  ]
}
