{
  "Topic": {
    "TopicId": "b-c3euvs402dtfnf4wmzpg",
    "ForumId": "10",
    "Title": "Broken.",
    "LastUpdated": "2019-04-09T21:14:52.8657533Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "bf553b28-19a6-4c03-883a-d673af61ee50",
      "UserId": 344924,
      "Username": "Satan666",
      "AvatarUrl": "https://i.imgur.com/d8tGjZNb.jpg",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Okay. This is IT. I am not gonna let myself get disappointed again. This website has successfully broken me.  \r\n\r\n_You can skip this paragraph if you don't want to let me vent._\r\nI just want to ask; How the actual FUCK did I loose data on a **SAVED GAME FILE DOWNLOADED TO MY FUCKING COMPUTER?** I would fucking think that by that point, it's safe. It's LITERALLY downloaded to my computer's hard drive! It's absolutely ridiculous. I have lost progress on my online games multiple times, and the first time I blamed myself. The second time, I blamed both myself, and this dumb website for not having more safeguards. But I understand, that sometimes when you save stuff on the internet, they aren't always saved. But this time? No, this time, I just... I really don't have words. I just can't imagine how this could happen.\r\n\r\nLet me explain. I was working on a text adventure, using the Quest application, and doing it all at my computer. I put a LOT of effort into the writing, sometimes spending HOURS on just ONE VERB. I had quite a bit of progress done. And I saved. Every time, I ALWAYS saved. Even if I just took my hands off the keyboard for a second, I saved first.\r\n\r\nAnd here's the thing, I didn't loose ALL my work, but I lost a goddamn lot of it. _MAYBE_ I will try and salvage it, but it probably won't be happening any time soon. I'm just way too pissed. And y'know, the fact that I _didn't_ loose all the progress, is why I blame this stupid application. And why I'm even more mad than I would be if I _HAD_ lost all my progress. Because then, I could have chalked it up to my computer somehow messing it up. \r\n\r\n But instead, I only lost the progress that mattered. It's like it somehow knew. I started out with basic writing on the verbs and descriptions, and then afterwards started with some REAL writing. That's when I started spending hours per verb. I had slowly upgraded each and every verb, saving multiple times in between each verb.  And now, most of the verbs are reverted back to their original versions. I don't even see how that's possible, it just picked a random save, and somehow reverted to it? \r\n\r\nBut that COULDN'T have happened. It's literally impossible, unless it saves every verb separately, and here's why: This will sound confusing, but try and follow it. The ONLY verb that WAS NOT reverted to its previous state, was NOT the first one that I updated. Which means, in order for me to have just not saved, or for it to have reverted to a previous save, then the ones I updated BEFORE that one should also be intact. Does that make sense?\r\n\r\nAnyway, it doesn't matter now. I highly doubt there is anything anyone can do, but I want to know WHY. WHY did they do this to me? WHAT did I do? HOW did they do it? WHY DO THEY HATE ME? I ask that not just because of this, but because I also had TONS of other problems that set me back for days during production of the text adventure. \r\n\r\nThe worst part is, I was actually looking forward to this, and it was one of the ONLY things in my life that I looked forward to working on every day. So I'd like to thank the Textadventures crew for taking that away from me, just as well as you gave it to me. \r\n\r\nThanks.",
      "EditableFormat": "markdown",
      "HTML": "<p>Okay. This is IT. I am not gonna let myself get disappointed again. This website has successfully broken me.</p>\n<p><em>You can skip this paragraph if you don't want to let me vent.</em><br>\nI just want to ask; How the actual FUCK did I loose data on a <strong>SAVED GAME FILE DOWNLOADED TO MY FUCKING COMPUTER?</strong> I would fucking think that by that point, it's safe. It's LITERALLY downloaded to my computer's hard drive! It's absolutely ridiculous. I have lost progress on my online games multiple times, and the first time I blamed myself. The second time, I blamed both myself, and this dumb website for not having more safeguards. But I understand, that sometimes when you save stuff on the internet, they aren't always saved. But this time? No, this time, I just... I really don't have words. I just can't imagine how this could happen.</p>\n<p>Let me explain. I was working on a text adventure, using the Quest application, and doing it all at my computer. I put a LOT of effort into the writing, sometimes spending HOURS on just ONE VERB. I had quite a bit of progress done. And I saved. Every time, I ALWAYS saved. Even if I just took my hands off the keyboard for a second, I saved first.</p>\n<p>And here's the thing, I didn't loose ALL my work, but I lost a goddamn lot of it. <em>MAYBE</em> I will try and salvage it, but it probably won't be happening any time soon. I'm just way too pissed. And y'know, the fact that I <em>didn't</em> loose all the progress, is why I blame this stupid application. And why I'm even more mad than I would be if I <em>HAD</em> lost all my progress. Because then, I could have chalked it up to my computer somehow messing it up.</p>\n<p>But instead, I only lost the progress that mattered. It's like it somehow knew. I started out with basic writing on the verbs and descriptions, and then afterwards started with some REAL writing. That's when I started spending hours per verb. I had slowly upgraded each and every verb, saving multiple times in between each verb.  And now, most of the verbs are reverted back to their original versions. I don't even see how that's possible, it just picked a random save, and somehow reverted to it?</p>\n<p>But that COULDN'T have happened. It's literally impossible, unless it saves every verb separately, and here's why: This will sound confusing, but try and follow it. The ONLY verb that WAS NOT reverted to its previous state, was NOT the first one that I updated. Which means, in order for me to have just not saved, or for it to have reverted to a previous save, then the ones I updated BEFORE that one should also be intact. Does that make sense?</p>\n<p>Anyway, it doesn't matter now. I highly doubt there is anything anyone can do, but I want to know WHY. WHY did they do this to me? WHAT did I do? HOW did they do it? WHY DO THEY HATE ME? I ask that not just because of this, but because I also had TONS of other problems that set me back for days during production of the text adventure.</p>\n<p>The worst part is, I was actually looking forward to this, and it was one of the ONLY things in my life that I looked forward to working on every day. So I'd like to thank the Textadventures crew for taking that away from me, just as well as you gave it to me.</p>\n<p>Thanks.</p>\n\n",
      "PostDate": "2019-04-09T21:14:52.8657533Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "3a593d29-b88c-4db9-a9ec-edf8ddf1c4fc",
      "UserId": 260569,
      "Username": "DarkLizerd",
      "AvatarUrl": "https://i.imgur.com/vjdH3t6b.jpg",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "The Men in Black knew what you were up to, and deleted your changes because you had figured out \"the wrong thing\"...\r\n\r\nBeen there, done that... Sucks DOES NOT cover how you feel...\r\nMaybe the web version saves each \"save\" separately, (IE: several save files) and it just gave you a previous save file.\r\nI have slow satellite internet... I do NOTING on-line that I cannot do locally.\r\n That way, I knows whose's ass to kick when a new block of code \"goes missing\"...\r\nI have a very good star system simulator that I lost the source code for... but I still have the compiled .exe that still runs...\r\n",
      "EditableFormat": "markdown",
      "HTML": "<p>The Men in Black knew what you were up to, and deleted your changes because you had figured out \"the wrong thing\"...</p>\n<p>Been there, done that... Sucks DOES NOT cover how you feel...<br>\nMaybe the web version saves each \"save\" separately, (IE: several save files) and it just gave you a previous save file.<br>\nI have slow satellite internet... I do NOTING on-line that I cannot do locally.<br>\nThat way, I knows whose's ass to kick when a new block of code \"goes missing\"...<br>\nI have a very good star system simulator that I lost the source code for... but I still have the compiled .exe that still runs...</p>\n\n",
      "PostDate": "2019-04-10T03:25:35.4970003Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "eace1a25-3402-4eba-b1ea-73e14fa06975",
      "UserId": 344924,
      "Username": "Satan666",
      "AvatarUrl": "https://i.imgur.com/d8tGjZNb.jpg",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "I wasn't using the web version, so unless you meant the application, that couldn't have been it.\r\n\r\nAnd yes, I would normally jump to the conclusion that it reverted to an older save, because that happens all the time, even in other games. BUT, the strange thing about this is that I never had a save file that looked like this. Unless it has the power to merge save files, this doesn't make sense. \r\n\r\nLet me give an example:\r\n\r\nSay you are playing a game, and in the game, you start out with a wooden sword and a wooden bow. Later on, you upgrade your sword to an iron sword, and get rid of your wooden sword in the process. So now you have an Iron sword and a wooden bow, and you save your progress. Next, you go and find a golden bow, which gets rid of your wooden bow, at which point you save once more. After that you get off for the day. When you come back, the game reverted to an older save, so now you only had an Iron sword and a wooden bow. This would make sense, because that's what you had last, before your latest save after you got the golden bow. Make sense? Well, in my case, it didn't work out that way. Instead of going back to the save where I had an iron sword and a wooden bow, I went back to a save (Which, just to clarify, never existed.) where I had a _wooden_ sword and a **golden bow**. Even though by the time I got the golden bow, I lost the wooden sword forever, it was taken away and replaced. \r\n\r\nGet what I'm saying now? It's fucking strange.  ",
      "EditableFormat": "markdown",
      "HTML": "<p>I wasn't using the web version, so unless you meant the application, that couldn't have been it.</p>\n<p>And yes, I would normally jump to the conclusion that it reverted to an older save, because that happens all the time, even in other games. BUT, the strange thing about this is that I never had a save file that looked like this. Unless it has the power to merge save files, this doesn't make sense.</p>\n<p>Let me give an example:</p>\n<p>Say you are playing a game, and in the game, you start out with a wooden sword and a wooden bow. Later on, you upgrade your sword to an iron sword, and get rid of your wooden sword in the process. So now you have an Iron sword and a wooden bow, and you save your progress. Next, you go and find a golden bow, which gets rid of your wooden bow, at which point you save once more. After that you get off for the day. When you come back, the game reverted to an older save, so now you only had an Iron sword and a wooden bow. This would make sense, because that's what you had last, before your latest save after you got the golden bow. Make sense? Well, in my case, it didn't work out that way. Instead of going back to the save where I had an iron sword and a wooden bow, I went back to a save (Which, just to clarify, never existed.) where I had a <em>wooden</em> sword and a <strong>golden bow</strong>. Even though by the time I got the golden bow, I lost the wooden sword forever, it was taken away and replaced.</p>\n<p>Get what I'm saying now? It's fucking strange.</p>\n\n",
      "PostDate": "2019-04-10T21:30:55.4790355Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "f4502513-778a-419d-909c-39f41831f683",
      "UserId": 301690,
      "Username": "Richard Headkid",
      "AvatarUrl": "http://i.imgur.com/WUGXS8yb.png",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Which f---ing game are you playing?",
      "EditableFormat": "markdown",
      "HTML": "<p>Which f---ing game are you playing?</p>\n\n",
      "PostDate": "2019-04-10T23:31:15.463806Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "3a66294e-a521-4ea1-93bc-b7537dc10c8f",
      "UserId": 319917,
      "Username": "mrangel",
      "AvatarUrl": "https://secure.gravatar.com/avatar/?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Sounds like an issue with incremental saves. (The same thing that happens sometimes on the web version if you make a large edit in a textbox, then press save *while the cursor is still in that box*, and then go to edit a different object immediately)",
      "EditableFormat": "markdown",
      "HTML": "<p>Sounds like an issue with incremental saves. (The same thing that happens sometimes on the web version if you make a large edit in a textbox, then press save <em>while the cursor is still in that box</em>, and then go to edit a different object immediately)</p>\n\n",
      "PostDate": "2019-04-11T00:59:21.6699424Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "d51ee4f7-447c-45d3-a165-de167dba8bcb",
      "UserId": 260569,
      "Username": "DarkLizerd",
      "AvatarUrl": "https://i.imgur.com/vjdH3t6b.jpg",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "So... You are saving the game you are PLAYING, not a game you are writing...\r\n",
      "EditableFormat": "markdown",
      "HTML": "<p>So... You are saving the game you are PLAYING, not a game you are writing...</p>\n\n",
      "PostDate": "2019-04-11T06:31:51.089195Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "3f9c7fd5-d497-4ae6-9818-85257b580733",
      "UserId": 326173,
      "Username": "Curt A. P.",
      "AvatarUrl": "https://secure.gravatar.com/avatar/bc1d5d57408cf4d13f9d9f23c1e3dc56?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "I started with the web version two yeas ago and suddenly I had lost two weeks of progression. I logged in, loaded my project and it was like the last two weeks of work never happened. After that I used the Win version and assumed to be save for things like that...",
      "EditableFormat": "markdown",
      "HTML": "<p>I started with the web version two yeas ago and suddenly I had lost two weeks of progression. I logged in, loaded my project and it was like the last two weeks of work never happened. After that I used the Win version and assumed to be save for things like that...</p>\n\n",
      "PostDate": "2019-04-12T00:03:40.614077Z",
      "LastEditDate": null,
      "link": null
    }
  ]
}
