{
  "Topic": {
    "TopicId": "c94u6om5yusk5omocmpisg",
    "ForumId": "5",
    "Title": "Pink Corruption AU: The Melanomorphosis (WIP)",
    "LastUpdated": "2019-11-07T16:01:28.7106234Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "f8813e4a-93c7-43cd-8c44-dee2537245af",
      "UserId": 397856,
      "Username": "BubbytheAdminofStoryMode",
      "AvatarUrl": "https://secure.gravatar.com/avatar/18c87bbedd8c5968e97b225713e49850?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "I have put out a game for the Pink Corruption fans to play! https://textadventures.co.uk/games/view/o-ssi8lvw06tx4mktqzmfg/pink-corruption-au-the-melanomorphosis\r\n\r\nIn The Melanomorphosis, you play as Cube. There is a new virus that changes a shape's body, behavior, and even needs, so long as it's dark outside. During the day, this virus is nearly completely hidden and cannot do anything to a shape. Unfortunately, you have recently learned that, unlike Corruption, Heroes can be infected with Melanomorphosis. Your goal is to make it through the night without getting infected or worse killed. Of course, there will be many obstacles, including the fact that **normal shapes are not nocturnal.** Eventually you will fall asleep, and either wake up infected or wake up in the morning. **Certain objects are infected as well.** Bathe in the wrong water, play with the wrong red dot, or even sit near the wrong leaf and you'll find they're hiding a shocking surprise. \r\n\r\n**This game is still unfinished!** So far there are only two good endings and dead ends aplenty! If you find a dead end, consider yourself to have found a temporary good ending.",
      "EditableFormat": "markdown",
      "HTML": "<p>I have put out a game for the Pink Corruption fans to play! https://textadventures.co.uk/games/view/o-ssi8lvw06tx4mktqzmfg/pink-corruption-au-the-melanomorphosis</p>\n<p>In The Melanomorphosis, you play as Cube. There is a new virus that changes a shape's body, behavior, and even needs, so long as it's dark outside. During the day, this virus is nearly completely hidden and cannot do anything to a shape. Unfortunately, you have recently learned that, unlike Corruption, Heroes can be infected with Melanomorphosis. Your goal is to make it through the night without getting infected or worse killed. Of course, there will be many obstacles, including the fact that <strong>normal shapes are not nocturnal.</strong> Eventually you will fall asleep, and either wake up infected or wake up in the morning. <strong>Certain objects are infected as well.</strong> Bathe in the wrong water, play with the wrong red dot, or even sit near the wrong leaf and you'll find they're hiding a shocking surprise.</p>\n<p><strong>This game is still unfinished!</strong> So far there are only two good endings and dead ends aplenty! If you find a dead end, consider yourself to have found a temporary good ending.</p>\n\n",
      "PostDate": "2019-11-07T16:01:28.7106234Z",
      "LastEditDate": null,
      "link": null
    }
  ]
}
