{
  "Topic": {
    "TopicId": "dohvylgymua98ygabpweka",
    "ForumId": "3",
    "Title": "Suggestion: iOS Quest interpreter",
    "LastUpdated": "2018-01-31T09:01:31.703945Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "5ffbd168-ddb6-481b-a3d6-be301a91bf48",
      "UserId": 342999,
      "Username": "moet36",
      "AvatarUrl": "https://secure.gravatar.com/avatar/4d1c667d132df0aaaac67035c08f80a4?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Hey there. I'd like to this this suggestion to Alex and anyone who'd care to comment.\r\n\r\nI know that Quest has a nifty way of wrapping games into an iOS app. That's very cool indeed, but it seems to me that it was underused. I suppose one of the reasons is, lots of people don't HAVE an iOS device. Another reason is the extra step of getting the game converted, then put in the app store. It takes some dedication, when most people just want to finish their game, polish it up, and release it to the unsuspecting world for them to enjoy - in an *immediate* fashion.\r\n\r\n(more ambitious Quest projects are birds of a different feather, of course)\r\n\r\nI was wondering, therefore, whether it wouldn't be a good idea to get that framework into an iOS *interpreter* for any Quest games. I suggested this some time ago in another place, and Alex told me of a few Apple limitations that made it hard or impossible, and I'd like to point to iFrotz as an example of how it can be achieved (one of the best features of iFrotz is how I can just go in there, using an application like iMazing, née DiskAid, and just extract the savegame file so I can, if I want to, switch between desktop and portable play as the occasion mandates).\r\n\r\nI am all for playing portable IF, it's a beauty of a thing. I would very much like to take a game I'm enjoying out on the road, and play it at my leisure instead of the few hours I spend home, most of which are devoted to sleeping, eating, bodily functions-ing, and working. An interpreter would make that possible; an app-wrapper like there is now just makes it possible to me to play a very, very, very, very limited selection, and they're not even games that grab my interest.",
      "EditableFormat": "markdown",
      "HTML": "<p>Hey there. I'd like to this this suggestion to Alex and anyone who'd care to comment.</p>\n<p>I know that Quest has a nifty way of wrapping games into an iOS app. That's very cool indeed, but it seems to me that it was underused. I suppose one of the reasons is, lots of people don't HAVE an iOS device. Another reason is the extra step of getting the game converted, then put in the app store. It takes some dedication, when most people just want to finish their game, polish it up, and release it to the unsuspecting world for them to enjoy - in an <em>immediate</em> fashion.</p>\n<p>(more ambitious Quest projects are birds of a different feather, of course)</p>\n<p>I was wondering, therefore, whether it wouldn't be a good idea to get that framework into an iOS <em>interpreter</em> for any Quest games. I suggested this some time ago in another place, and Alex told me of a few Apple limitations that made it hard or impossible, and I'd like to point to iFrotz as an example of how it can be achieved (one of the best features of iFrotz is how I can just go in there, using an application like iMazing, née DiskAid, and just extract the savegame file so I can, if I want to, switch between desktop and portable play as the occasion mandates).</p>\n<p>I am all for playing portable IF, it's a beauty of a thing. I would very much like to take a game I'm enjoying out on the road, and play it at my leisure instead of the few hours I spend home, most of which are devoted to sleeping, eating, bodily functions-ing, and working. An interpreter would make that possible; an app-wrapper like there is now just makes it possible to me to play a very, very, very, very limited selection, and they're not even games that grab my interest.</p>\n\n",
      "PostDate": "2018-01-31T09:01:31.703945Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "8856d3e5-b008-4616-a2ba-99a6ffe0fca4",
      "UserId": 247325,
      "Username": "hegemonkhan",
      "AvatarUrl": "https://secure.gravatar.com/avatar/a96cf34d8d97c57de38f54ee22b1759b?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Alex is gone... but Pertex is still around and so is Pixie (handling/in-charge-of quest development), and there's KV too, who's quickly becoming an expert on a lot of stuff",
      "EditableFormat": "markdown",
      "HTML": "<p>Alex is gone... but Pertex is still around and so is Pixie (handling/in-charge-of quest development), and there's KV too, who's quickly becoming an expert on a lot of stuff</p>\n\n",
      "PostDate": "2018-01-31T12:10:08.0867989Z",
      "LastEditDate": "2018-01-31T12:10:40.7244521Z",
      "link": null
    }
  ]
}
