{
  "Topic": {
    "TopicId": "f__c07kymeaqyruu0znduq",
    "ForumId": "10",
    "Title": "Beginners problems",
    "LastUpdated": "2019-09-26T07:41:08.7242986Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "af657bb8-2c57-4ce4-87d5-d2111f19627f",
      "UserId": 438601,
      "Username": "Uyenvu123",
      "AvatarUrl": "https://secure.gravatar.com/avatar/0665df8a3cf75927d08c090deaa77f81?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "<p>BẠN sở hữu THỂ khiến GÌ sở hữu ADOBE AFTER EFFECTS</p>\r\n\r\n<p>Adobe After Effects là 1 trong số ít chương trình hi hữu hoi trên toàn cầu mang khả năng tạo ra những tác phẩm nghệ thuật xuất sắc. Bên cạnh đó, nếu bạn chưa quen sở hữu Adobe After Effects, bạn có thể hơi bối rối về những gì AE có thể khiến cho. Để khắc phục một số lầm lẫn, chúng tôi đã tổng hợp bài đăng này giải thích các khả năng sáng tạo và kỹ thuật của Adobe After Effects . Ví như bạn mang bất kỳ thắc mắc nào về các gì bạn có thể khiến trong After Effects, tôi rất vui lòng giải đáp chúng trong những bình luận bên dưới.<br />\r\nbên cạnh đó, Adobe After Effects là một chương trình nằm trong bộ phần mềm Adobe bản quyền. Hãy cũng Nhận định về ích lợi tuyệt vời lúc dùng Adobe và nên tậu Adobe bản quyền ở đâu để nhận được giá rẻ nhất và nhà cung cấp tương trợ giỏi.</p>\r\n\r\n<p>Xem thêm: <a href=\"http://arena.fpt.edu.vn/khoa-hoc-after-effect/\">khóa học after effect</a><br />\r\nI. Vậy bạn có thể làm gì sở hữu Adobe After Effects?<br />\r\nvới Adobe After Effects, bạn có thể tạo, kết hợp và dáng điệu những lớp cảnh 2D trong ko gian 3D. Adobe After Effects đóng góp vai trò khác nhau tùy thuộc vào nhu cầu của các bạn. Ví dụ: một nghệ sĩ VFX độc lập chỉ dùng After Effects để tổng hợp những cảnh quay được kết xuất 3D. Trình chỉnh sửa video sở hữu thể khai thác ích lợi After Effects phổ thông hơn cho thiết kế tiêu đề và nhà khiến cho phim hoạt hình mang thể tiêu dùng nó để tạo các nhân vật hoạt hình 2D. Đó là lý do vì sao đầy đủ các bạn gặp khó khăn trong việc xác định những khả năng và lợi ích dùng của After Effects, do thực tiễn là chương trình này làm cho được số đông thứ và đem đến kết quả tốt.<br />\r\nCần lưu ý rằng dù rằng After Effects là phần mềm sở hữu rộng rãi tính năng làm bạn ngạc nhiên, nhưng nó ko lý tưởng để chỉnh sửa cảnh quay. Bởi vì nó ko sở hữu khả năng phát lại hoặc thiết lập bố cục giống như một ứng dụng chỉnh sửa video. Trong văn cảnh chỉnh sửa, Adobe After Effects thường được tiêu dùng để áp dụng các hiệu ứng cho các đoạn phim.</p>\r\n\r\n<p>mặc dù mang tính ứng dụng cao, cấu trúc của After Effects thực thụ rất đơn giản. Giống như mọi vận dụng chỉnh sửa video khác, After Effects sử dụng hệ thống lớp, tưởng tượng dễ liên tưởng nhất là hình ảnh một chồng giấy. Lúc Nhìn vào, bạn sẽ trông thấy tờ giấy mặt trên cùng mà chẳng thể thấy tờ giấy dặt dưới nó. Thí dụ này như vậy như bạn đang khiến cho việc trên một tác phẩm 2D.<br />\r\nnếu bạn đặt những lớp của mình thành 3D, bạn với thể đưa chúng ra trước các lớp 3D khác giả dụ chúng ở gần máy ảnh của bạn hơn trong ko gian 3D. Nếu như điều ấy nghe với vẻ khó hiểu, chỉ cần xem thí dụ dưới đây. Lúc lớp di chuyển qua lớp nền về phía máy ảnh, nó sẽ hiển thị. Khi nó đi đằng sau nền, nó bị che qua đời.</p>\r\n\r\n<p>1. Thư viện hiệu ứng<br />\r\nđiểm đặc sắc khiến cho After Effects dị biệt có hầu hết những áp dụng video khác là thư viện hiệu ứng rộng to của nó. Có hàng trăm hiệu ứng tích hợp sở hữu thể được phối hợp để phục vụ ti tỉ khả năng thông minh. Điều này nghe với vẻ khá phi lý, nhưng trong After Effects,bạn hoàn toàn sở hữu thể thực hiện điều ấy. Chúng ta hãy xem một vài cái hiệu ứng mang trong Adobe After Effects.<br />\r\n1.1. Hiệu ứng mô hình<br />\r\ncó 18 hiệu ứng mô hình được tích hợp trong Adobe After Effects . Những hiệu ứng mô phỏng này sở hữu thể được sử dụng để đáp ứng bất cứ thứ gì trong khoảng mưa tới tóc. Đầy đủ những hiệu ứng này là hoàn toàn tùy biến. Lúc bạn ghép chúng với những hiệu ứng khác, bạn có thể đưa chức năng của chúng đi xa hơn nữa. Dưới đây là một ví dụ về hiệu ứng CC Snowfall được tích hợp trong After Effects . Để tạo hiệu ứng, bạn thực sự chỉ cần kéo và thả. Không cần tùy biến.</p>\r\n\r\n<p>1.2. Hiệu ứng dáng điệu<br />\r\ncác hiệu ứng dáng điệu được mua thấy trong After Effects rất hữu dụng để áp dụng cho những videos, layers, styles mà mang những phần mềm khác bạn chẳng thể làm được. Những hiệu ứng kéo và thả này có thể được thao tác thuận lợi để tạo ra vẻ ngoài và bắt mắt hoàn hảo. Các hiệu ứng đáng chú ý trong danh mục này bao gồm hiệu ứng CC Glass và hiệu ứng posterize . Dưới đây là một tỉ dụ về hiệu ứng Find Edges được ứng dụng.</p>\r\n\r\n<p>một.3. Phần nhiều những loại hiệu ứng khác<br />\r\nNgoài những loại hiệu ứng tiêu biểu được nhắc ở trên, còn phần nhiều hiệu ứng khác góp phần tạo nên bản thiết kế đáp ứng kì vọng của bạn. Thí dụ, hiệu ứng khiến mờ sở hữu nhiều kiểu mờ khác nhau; hay khả năng Color Correction category (Chỉnh màu với các hiệu ứng) sở hữu thể tạo ra bất kỳ giao diện nào bạn muốn đưa ra cho cảnh quay của mình.<br />\r\nkhông những thế còn mang Perspective category (Danh mục phối cảnh) bao gồm hiệu ứng 3D Camera Tracker effect (Trình theo dõi máy ảnh 3D) giúp tiện dụng theo dõi các cảnh quay video của bạn. Ảnh gif dưới đây cho thấy Linear Wipe effect (hiệu ứng Wipe tuyến tính) đang được sử dụng. Bạn sở hữu thể tìm thấy hiệu ứng chuyển tiếp Wipe tuyến tính trong thư mục Transition Effects (Hiệu ứng chuyển tiếp).</p>\r\n\r\n<p>hai. Dòng Adobe After Effects<br />\r\ncác loại Adobe After Effects là một lý do rất lớn tại sao tất cả các trình chỉnh sửa video đều chọn sử dụng After Effects . Bạn mang thể dành đông đảo sự nghiệp của mình để vững mạnh những kỹ năng như 1 các kiến trúc sư chuyển động. Ngoài ra, thường nhật những người chỉnh sửa video với thể ko mang thời kì hoặc chuyên môn cần thiết để tạo ra những thiết kế họ muốn hoặc cần. Thay vào ấy, những các kiến trúc sư vận động trong khoảng khắp nơi trên thế giới đã thiết lập các tệp Dự án After Effects theo bí quyết mà quý khách chỉ cần kéo và thả đoạn phim của họ để với được kết quả xuất sắc.<br />\r\ncác thị phần chiếc After Effects trực tuyến như RocketStock sở hữu những Dự án dễ dùng, bởi vậy, ngay cả những khách hàng After Effects ở trình độ nhàng nhàng cũng với thể tạo ra các bề ngoài tuyệt đẹp cho các Dự án video của họ.<br />\r\n3. Kiểu dáng tiêu đề<br />\r\nsở hữu các tính năng bề ngoài tiêu đề phổ quát như Photoshop, After Effects là 1 chương trình lý tưởng để đáp ứng những tiêu đề xuất sắc cho những Công trình video của bạn. Công cụ tiêu đề được tích hợp trong After Effects hoạt động rất giống mang dụng cụ tậu thấy trong hầu hết những trình xử lý văn bản. Điều này bao gồm những tùy chọn đoạn và điều khiển tùy chỉnh cho các thứ như khoảng cách thức cái và tùy chình co kéo kích thước.<br />\r\nbên cạnh đó, điều làm khả năng mẫu mã tiêu đề của After Effects nhận được Nhận định cao nằm ở những trình hoạt hình tiêu đề cho phép người mua tự động làm động các ký tự, từ hoặc loại tùy theo nhu cầu mong muốn của mình.</p>\r\n\r\n<p>hồ hết các hiệu ứng được kể ở trên cũng sở hữu thể được vận dụng cho văn bản, do vậy thực sự ko với giới hạn đối mang những cái tiêu đề bạn mang thể tạo trong After Effects . Không những thế, cần lưu ý rằng rất khó khăn để tạo tiêu đề 3D như ý trong After Effects . Một số người với thể tạo nhái 3D bằng phương pháp tiêu dùng một công nghệ được gọi là xếp chồng lớp, nhưng tất cả mọi người chỉ cần sử dụng plugin Element 3D để cố gắng tạo ra 3D text.<br />\r\nBạn có thể mua thấy 1 số bài viết trực tuyến về phương pháp dùng thứ tự được gọi là 3D Ray-traced (Truy tậu tia) để tạo tiêu đề 3D, nhưng kỹ thuật này không hoạt động thấp, do vậy nên hạn chế trong số đông mọi cảnh huống.</p>\r\n\r\n<p>Xem thêm: <a href=\"http://arena.fpt.edu.vn/hoc-adobe-after-effect/\">học after effect cơ bản</a><br />\r\n4. Khả năng tổng hợp<br />\r\n1 phần mềm tổng hợp đơn thuần là 1 phần mềm sở hữu thể được dùng để kết hợp phổ biến tài nguyên lại mang nhau để tạo ra 1 cảnh hoàn chỉnh. Tỉ dụ, 1 shot VFX độc nhất sở hữu thể đề xuất một tấm màn hình màu xanh lá cây, hậu cảnh, một số nguyên tố vụ nổ, bụi và khói đều được phối hợp thành 1 cảnh độc nhất. Điều này sẽ khôn xiết khó thực hành bên trong 1 vận dụng chỉnh sửa video, vì thế một vận dụng đặc thù như After Effects là một giải pháp hữu ích.</p>\r\n\r\n<p>tuy nhiên, đông đảo những trình chỉnh sửa video đều tiêu dùng khả năng kết hợp của After Effects cho những Dự án ít kỹ xảo cầu kỳ, hào nhoáng hơn. Ko có gì lạ khi tiêu dùng After Effects để thay thế màn hình nhanh cho bản demo sản phẩm hoặc làm mờ logo bằng trình theo dõi camera 3D.<br />\r\nGiống như trong Photoshop, những lớp After Effects với thể cáng đáng một số chế độ hòa trộn ảnh hưởng tới chúng theo bí quyết mà lớp của bạn được diễn giải mang các cảnh quay đằng sau nó. Điều này rất cấp thiết cho những mô hình và thiết kế 3D, vì bạn thường thực hành kết xuất phổ thông lượt trong đó những yếu tố khác nhau sẽ được hài hòa sở hữu nhau để tạo ra hình ảnh 3D rút cuộc. Trong trường hợp này, bạn có thể mang 1 lớp bóng trong ấy bạn muốn chỉ trông thấy các phần tối của hình ảnh và 1 lớp nổi trội trong ấy bạn chỉ muốn nhận ra các phần ánh sáng.</p>\r\n\r\n<p>1 chế độ hòa trộn được coi là xuất sắc lúc được hài hòa tất cả những yếu tố này lại có nhau. Trên thực tại, bạn sở hữu thể tiêu dùng các chế độ hòa trộn để thêm những yếu tố trên đoạn phim của mình. Ví dụ, lúc phát hiện ra là rò rỉ ánh sáng, bằng phương pháp &lsquo;Add&rsquo; hoặc &lsquo;Screen&rsquo; chế độ hòa trộn, khách hàng sở hữu thể tiện dụng tổng hợp ánh sáng rò rỉ trên đoạn phim của mình trong After Effects để tạo cảnh quay dáng điệu.<br />\r\n5. Chữ viết<br />\r\nkhông giống như các plugin, các tập lệnh không mở khóa bất cứ thứ gì mà After Effects ko sở hữu khả năng thực hiện &ndash; mà chỉ thuần tuý là tự động hóa 1 trật tự để tiết kiệm thời gian và thao tác thực hành. Ví dụ: mang 1 số tập lệnh như AE Sweets tạo hình động bằng phương pháp chỉ cần nhấp vào nút.<br />\r\nví như bạn là một chuyên gia Adobe After Effects dày dạn kinh nghiệm, có lẽ bạn sẽ không gặp vấn đề gì lúc tạo các dạng hình hoạt hình &ndash; nhưng ví như được bổ sung khả năng tạo chúng chỉ bằng vài cú click chuột khiến cho hầu hết quá trình ngoài mặt nhanh hơn nhiều.<br />\r\nmang vô số tập lệnh khác được tiêu dùng để thực hiện 1 số tác vụ khác nhau, trong khoảng việc bù đắp các lớp cho tới kết xuất những tác phẩm. Điều lớn nhất cần nhớ lúc thực hiện 1 nhiệm vụ lặp đi lặp lại trong After Effects: hãy nhìn quanh đó, rất có thể bạn sẽ mua thấy một tập lệnh với thể giúp bạn tiết kiệm thời kì thực hành.<br />\r\n6. Plugin được tiêu dùng sau khi nâng cấp hiệu ứng<br />\r\nNgoài tất cả các hiệu ứng được kể ở trên, sở hữu hàng trăm hiệu ứng bổ sung khác sở hữu thể được cài đặt để đảm đương chức năng của After Effects hơn nữa. Các plugin này về căn bản là các ứng dụng thu nhỏ được phát triển bởi các tổ chức bên thứ ba với thể được cài đặt và tiêu dùng bên trong After Effects.</p>\r\n\r\n<p>với đa số plugin khác nhau, nhưng một vài plugin phổ biến nhất mang sẵn cho After Effects là Element 3D, Trapcode Particular (Trapcode đặc biệt), Plexus và Optical Flares (Quang pháo sáng). Plugin Element 3D là plugin được vun đắp bởi bên thứ ba gây ấn tượng nhất vì nó cho phép quý khách nhập, kết cấu, màu sắc, ánh sáng và tạo các đối tượng 3D bên trong After Effects. Nó không thay thế hoàn toàn được áp dụng mô hình 3D &ndash; nhưng ví như thỉnh thoảng bạn chỉ làm việc sở hữu những đối tượng 3D, thì ấy là một công cụ hữu ích để nâng cao tốc thời kỳ bề ngoài 3D.<br />\r\nII. Điều gì mà Adobe After Effects không thể làm?<br />\r\nthắc mắc về những gì chẳng thể mang trong After Effects là 1 câu hỏi rất khó; dù rằng bạn mang thể tạo ra đông đảo mọi thứ trong After Effects, nhưng ấy chưa chắc là dụng cụ lý tưởng để dùng cho mọi Công trình đồ họa chuyển động hoặc VFX. Đối có mọi Công trình, những thủ thuật trên After Effects mà bạn mang thể tiêu dùng để mô phỏng hiệu ứng mong muốn. Dưới đây là 2 điều bạn chẳng thể làm (hoặc ít ra là khiến tốt) trong Adobe After Effects .<br />\r\n1. Mô phỏng và hoạt hình 3D</p>\r\n\r\n<p>sử dụng Element 3D, bạn mang thể nhập những đối tượng 3D vào Adobe After Effects &ndash; nhưng sẽ bị ngừng lúc tạo hiệu ứng cho chúng, cho nên bạn sẽ không bao giờ mang thể thay thế phần mềm tạo mô hình / hoạt hình 3D truyền thống. Không những thế, bạn cũng sẽ bị dừng trong các mẫu mô phỏng bạn sở hữu thể tạo. Nếu như bạn nghiêm trang về bề ngoài 3D, bạn đích thực cần bắt đầu học một phần mềm 3D như Cinema 4D hoặc Maya .</p>\r\n\r\n<p>Xem thêm: <span style=\"color:rgb(17, 85, 204); font-family:arial; font-size:10pt\"><a class=\"in-cell-link\" href=\"https://arena.fpt.edu.vn/\" target=\"_blank\">https://arena.fpt.edu.vn/</a></span><br />\r\n2. Chỉnh sửa video (kinda)</p>\r\n\r\n<p>Như chúng tôi đã biểu thị trong bài đăng này, Adobe After Effects chẳng phải là 1 phần mềm hoàn hảo để chỉnh sửa âm thanh hoặc video. Vững chắc bạn với thể hoàn tất công tác giả dụ bạn hoàn toàn phải làm, nhưng nó ko được thực hành cho điều đó. Adobe After Effects hoạt động phải chăng nhất lúc được ghép nối có phần mềm chỉnh sửa video. Adobe Premiere Pro phối hợp tốt nhất mang Adobe After Effects , nhưng bạn luôn với thể dùng một phần mềm như Final Cut Pro hoặc Media Composer để hoàn thành công tác</p>\r\n",
      "EditableFormat": "markdown",
      "HTML": "<p>BẠN sở hữu THỂ khiến GÌ sở hữu ADOBE AFTER EFFECTS</p>\n<p>Adobe After Effects là 1 trong số ít chương trình hi hữu hoi trên toàn cầu mang khả năng tạo ra những tác phẩm nghệ thuật xuất sắc. Bên cạnh đó, nếu bạn chưa quen sở hữu Adobe After Effects, bạn có thể hơi bối rối về những gì AE có thể khiến cho. Để khắc phục một số lầm lẫn, chúng tôi đã tổng hợp bài đăng này giải thích các khả năng sáng tạo và kỹ thuật của Adobe After Effects . Ví như bạn mang bất kỳ thắc mắc nào về các gì bạn có thể khiến trong After Effects, tôi rất vui lòng giải đáp chúng trong những bình luận bên dưới.<br>\nbên cạnh đó, Adobe After Effects là một chương trình nằm trong bộ phần mềm Adobe bản quyền. Hãy cũng Nhận định về ích lợi tuyệt vời lúc dùng Adobe và nên tậu Adobe bản quyền ở đâu để nhận được giá rẻ nhất và nhà cung cấp tương trợ giỏi.</p>\n<p>Xem thêm: <a href=\"http://arena.fpt.edu.vn/khoa-hoc-after-effect/\">khóa học after effect</a><br>\nI. Vậy bạn có thể làm gì sở hữu Adobe After Effects?<br>\nvới Adobe After Effects, bạn có thể tạo, kết hợp và dáng điệu những lớp cảnh 2D trong ko gian 3D. Adobe After Effects đóng góp vai trò khác nhau tùy thuộc vào nhu cầu của các bạn. Ví dụ: một nghệ sĩ VFX độc lập chỉ dùng After Effects để tổng hợp những cảnh quay được kết xuất 3D. Trình chỉnh sửa video sở hữu thể khai thác ích lợi After Effects phổ thông hơn cho thiết kế tiêu đề và nhà khiến cho phim hoạt hình mang thể tiêu dùng nó để tạo các nhân vật hoạt hình 2D. Đó là lý do vì sao đầy đủ các bạn gặp khó khăn trong việc xác định những khả năng và lợi ích dùng của After Effects, do thực tiễn là chương trình này làm cho được số đông thứ và đem đến kết quả tốt.<br>\nCần lưu ý rằng dù rằng After Effects là phần mềm sở hữu rộng rãi tính năng làm bạn ngạc nhiên, nhưng nó ko lý tưởng để chỉnh sửa cảnh quay. Bởi vì nó ko sở hữu khả năng phát lại hoặc thiết lập bố cục giống như một ứng dụng chỉnh sửa video. Trong văn cảnh chỉnh sửa, Adobe After Effects thường được tiêu dùng để áp dụng các hiệu ứng cho các đoạn phim.</p>\n<p>mặc dù mang tính ứng dụng cao, cấu trúc của After Effects thực thụ rất đơn giản. Giống như mọi vận dụng chỉnh sửa video khác, After Effects sử dụng hệ thống lớp, tưởng tượng dễ liên tưởng nhất là hình ảnh một chồng giấy. Lúc Nhìn vào, bạn sẽ trông thấy tờ giấy mặt trên cùng mà chẳng thể thấy tờ giấy dặt dưới nó. Thí dụ này như vậy như bạn đang khiến cho việc trên một tác phẩm 2D.<br>\nnếu bạn đặt những lớp của mình thành 3D, bạn với thể đưa chúng ra trước các lớp 3D khác giả dụ chúng ở gần máy ảnh của bạn hơn trong ko gian 3D. Nếu như điều ấy nghe với vẻ khó hiểu, chỉ cần xem thí dụ dưới đây. Lúc lớp di chuyển qua lớp nền về phía máy ảnh, nó sẽ hiển thị. Khi nó đi đằng sau nền, nó bị che qua đời.</p>\n<p>1. Thư viện hiệu ứng<br>\nđiểm đặc sắc khiến cho After Effects dị biệt có hầu hết những áp dụng video khác là thư viện hiệu ứng rộng to của nó. Có hàng trăm hiệu ứng tích hợp sở hữu thể được phối hợp để phục vụ ti tỉ khả năng thông minh. Điều này nghe với vẻ khá phi lý, nhưng trong After Effects,bạn hoàn toàn sở hữu thể thực hiện điều ấy. Chúng ta hãy xem một vài cái hiệu ứng mang trong Adobe After Effects.<br>\n1.1. Hiệu ứng mô hình<br>\ncó 18 hiệu ứng mô hình được tích hợp trong Adobe After Effects . Những hiệu ứng mô phỏng này sở hữu thể được sử dụng để đáp ứng bất cứ thứ gì trong khoảng mưa tới tóc. Đầy đủ những hiệu ứng này là hoàn toàn tùy biến. Lúc bạn ghép chúng với những hiệu ứng khác, bạn có thể đưa chức năng của chúng đi xa hơn nữa. Dưới đây là một ví dụ về hiệu ứng CC Snowfall được tích hợp trong After Effects . Để tạo hiệu ứng, bạn thực sự chỉ cần kéo và thả. Không cần tùy biến.</p>\n<p>1.2. Hiệu ứng dáng điệu<br>\ncác hiệu ứng dáng điệu được mua thấy trong After Effects rất hữu dụng để áp dụng cho những videos, layers, styles mà mang những phần mềm khác bạn chẳng thể làm được. Những hiệu ứng kéo và thả này có thể được thao tác thuận lợi để tạo ra vẻ ngoài và bắt mắt hoàn hảo. Các hiệu ứng đáng chú ý trong danh mục này bao gồm hiệu ứng CC Glass và hiệu ứng posterize . Dưới đây là một tỉ dụ về hiệu ứng Find Edges được ứng dụng.</p>\n<p>một.3. Phần nhiều những loại hiệu ứng khác<br>\nNgoài những loại hiệu ứng tiêu biểu được nhắc ở trên, còn phần nhiều hiệu ứng khác góp phần tạo nên bản thiết kế đáp ứng kì vọng của bạn. Thí dụ, hiệu ứng khiến mờ sở hữu nhiều kiểu mờ khác nhau; hay khả năng Color Correction category (Chỉnh màu với các hiệu ứng) sở hữu thể tạo ra bất kỳ giao diện nào bạn muốn đưa ra cho cảnh quay của mình.<br>\nkhông những thế còn mang Perspective category (Danh mục phối cảnh) bao gồm hiệu ứng 3D Camera Tracker effect (Trình theo dõi máy ảnh 3D) giúp tiện dụng theo dõi các cảnh quay video của bạn. Ảnh gif dưới đây cho thấy Linear Wipe effect (hiệu ứng Wipe tuyến tính) đang được sử dụng. Bạn sở hữu thể tìm thấy hiệu ứng chuyển tiếp Wipe tuyến tính trong thư mục Transition Effects (Hiệu ứng chuyển tiếp).</p>\n<p>hai. Dòng Adobe After Effects<br>\ncác loại Adobe After Effects là một lý do rất lớn tại sao tất cả các trình chỉnh sửa video đều chọn sử dụng After Effects . Bạn mang thể dành đông đảo sự nghiệp của mình để vững mạnh những kỹ năng như 1 các kiến trúc sư chuyển động. Ngoài ra, thường nhật những người chỉnh sửa video với thể ko mang thời kì hoặc chuyên môn cần thiết để tạo ra những thiết kế họ muốn hoặc cần. Thay vào ấy, những các kiến trúc sư vận động trong khoảng khắp nơi trên thế giới đã thiết lập các tệp Dự án After Effects theo bí quyết mà quý khách chỉ cần kéo và thả đoạn phim của họ để với được kết quả xuất sắc.<br>\ncác thị phần chiếc After Effects trực tuyến như RocketStock sở hữu những Dự án dễ dùng, bởi vậy, ngay cả những khách hàng After Effects ở trình độ nhàng nhàng cũng với thể tạo ra các bề ngoài tuyệt đẹp cho các Dự án video của họ.<br>\n3. Kiểu dáng tiêu đề<br>\nsở hữu các tính năng bề ngoài tiêu đề phổ quát như Photoshop, After Effects là 1 chương trình lý tưởng để đáp ứng những tiêu đề xuất sắc cho những Công trình video của bạn. Công cụ tiêu đề được tích hợp trong After Effects hoạt động rất giống mang dụng cụ tậu thấy trong hầu hết những trình xử lý văn bản. Điều này bao gồm những tùy chọn đoạn và điều khiển tùy chỉnh cho các thứ như khoảng cách thức cái và tùy chình co kéo kích thước.<br>\nbên cạnh đó, điều làm khả năng mẫu mã tiêu đề của After Effects nhận được Nhận định cao nằm ở những trình hoạt hình tiêu đề cho phép người mua tự động làm động các ký tự, từ hoặc loại tùy theo nhu cầu mong muốn của mình.</p>\n<p>hồ hết các hiệu ứng được kể ở trên cũng sở hữu thể được vận dụng cho văn bản, do vậy thực sự ko với giới hạn đối mang những cái tiêu đề bạn mang thể tạo trong After Effects . Không những thế, cần lưu ý rằng rất khó khăn để tạo tiêu đề 3D như ý trong After Effects . Một số người với thể tạo nhái 3D bằng phương pháp tiêu dùng một công nghệ được gọi là xếp chồng lớp, nhưng tất cả mọi người chỉ cần sử dụng plugin Element 3D để cố gắng tạo ra 3D text.<br>\nBạn có thể mua thấy 1 số bài viết trực tuyến về phương pháp dùng thứ tự được gọi là 3D Ray-traced (Truy tậu tia) để tạo tiêu đề 3D, nhưng kỹ thuật này không hoạt động thấp, do vậy nên hạn chế trong số đông mọi cảnh huống.</p>\n<p>Xem thêm: <a href=\"http://arena.fpt.edu.vn/hoc-adobe-after-effect/\">học after effect cơ bản</a><br>\n4. Khả năng tổng hợp<br>\n1 phần mềm tổng hợp đơn thuần là 1 phần mềm sở hữu thể được dùng để kết hợp phổ biến tài nguyên lại mang nhau để tạo ra 1 cảnh hoàn chỉnh. Tỉ dụ, 1 shot VFX độc nhất sở hữu thể đề xuất một tấm màn hình màu xanh lá cây, hậu cảnh, một số nguyên tố vụ nổ, bụi và khói đều được phối hợp thành 1 cảnh độc nhất. Điều này sẽ khôn xiết khó thực hành bên trong 1 vận dụng chỉnh sửa video, vì thế một vận dụng đặc thù như After Effects là một giải pháp hữu ích.</p>\n<p>tuy nhiên, đông đảo những trình chỉnh sửa video đều tiêu dùng khả năng kết hợp của After Effects cho những Dự án ít kỹ xảo cầu kỳ, hào nhoáng hơn. Ko có gì lạ khi tiêu dùng After Effects để thay thế màn hình nhanh cho bản demo sản phẩm hoặc làm mờ logo bằng trình theo dõi camera 3D.<br>\nGiống như trong Photoshop, những lớp After Effects với thể cáng đáng một số chế độ hòa trộn ảnh hưởng tới chúng theo bí quyết mà lớp của bạn được diễn giải mang các cảnh quay đằng sau nó. Điều này rất cấp thiết cho những mô hình và thiết kế 3D, vì bạn thường thực hành kết xuất phổ thông lượt trong đó những yếu tố khác nhau sẽ được hài hòa sở hữu nhau để tạo ra hình ảnh 3D rút cuộc. Trong trường hợp này, bạn có thể mang 1 lớp bóng trong ấy bạn muốn chỉ trông thấy các phần tối của hình ảnh và 1 lớp nổi trội trong ấy bạn chỉ muốn nhận ra các phần ánh sáng.</p>\n<p>1 chế độ hòa trộn được coi là xuất sắc lúc được hài hòa tất cả những yếu tố này lại có nhau. Trên thực tại, bạn sở hữu thể tiêu dùng các chế độ hòa trộn để thêm những yếu tố trên đoạn phim của mình. Ví dụ, lúc phát hiện ra là rò rỉ ánh sáng, bằng phương pháp ‘Add’ hoặc ‘Screen’ chế độ hòa trộn, khách hàng sở hữu thể tiện dụng tổng hợp ánh sáng rò rỉ trên đoạn phim của mình trong After Effects để tạo cảnh quay dáng điệu.<br>\n5. Chữ viết<br>\nkhông giống như các plugin, các tập lệnh không mở khóa bất cứ thứ gì mà After Effects ko sở hữu khả năng thực hiện – mà chỉ thuần tuý là tự động hóa 1 trật tự để tiết kiệm thời gian và thao tác thực hành. Ví dụ: mang 1 số tập lệnh như AE Sweets tạo hình động bằng phương pháp chỉ cần nhấp vào nút.<br>\nví như bạn là một chuyên gia Adobe After Effects dày dạn kinh nghiệm, có lẽ bạn sẽ không gặp vấn đề gì lúc tạo các dạng hình hoạt hình – nhưng ví như được bổ sung khả năng tạo chúng chỉ bằng vài cú click chuột khiến cho hầu hết quá trình ngoài mặt nhanh hơn nhiều.<br>\nmang vô số tập lệnh khác được tiêu dùng để thực hiện 1 số tác vụ khác nhau, trong khoảng việc bù đắp các lớp cho tới kết xuất những tác phẩm. Điều lớn nhất cần nhớ lúc thực hiện 1 nhiệm vụ lặp đi lặp lại trong After Effects: hãy nhìn quanh đó, rất có thể bạn sẽ mua thấy một tập lệnh với thể giúp bạn tiết kiệm thời kì thực hành.<br>\n6. Plugin được tiêu dùng sau khi nâng cấp hiệu ứng<br>\nNgoài tất cả các hiệu ứng được kể ở trên, sở hữu hàng trăm hiệu ứng bổ sung khác sở hữu thể được cài đặt để đảm đương chức năng của After Effects hơn nữa. Các plugin này về căn bản là các ứng dụng thu nhỏ được phát triển bởi các tổ chức bên thứ ba với thể được cài đặt và tiêu dùng bên trong After Effects.</p>\n<p>với đa số plugin khác nhau, nhưng một vài plugin phổ biến nhất mang sẵn cho After Effects là Element 3D, Trapcode Particular (Trapcode đặc biệt), Plexus và Optical Flares (Quang pháo sáng). Plugin Element 3D là plugin được vun đắp bởi bên thứ ba gây ấn tượng nhất vì nó cho phép quý khách nhập, kết cấu, màu sắc, ánh sáng và tạo các đối tượng 3D bên trong After Effects. Nó không thay thế hoàn toàn được áp dụng mô hình 3D – nhưng ví như thỉnh thoảng bạn chỉ làm việc sở hữu những đối tượng 3D, thì ấy là một công cụ hữu ích để nâng cao tốc thời kỳ bề ngoài 3D.<br>\nII. Điều gì mà Adobe After Effects không thể làm?<br>\nthắc mắc về những gì chẳng thể mang trong After Effects là 1 câu hỏi rất khó; dù rằng bạn mang thể tạo ra đông đảo mọi thứ trong After Effects, nhưng ấy chưa chắc là dụng cụ lý tưởng để dùng cho mọi Công trình đồ họa chuyển động hoặc VFX. Đối có mọi Công trình, những thủ thuật trên After Effects mà bạn mang thể tiêu dùng để mô phỏng hiệu ứng mong muốn. Dưới đây là 2 điều bạn chẳng thể làm (hoặc ít ra là khiến tốt) trong Adobe After Effects .<br>\n1. Mô phỏng và hoạt hình 3D</p>\n<p>sử dụng Element 3D, bạn mang thể nhập những đối tượng 3D vào Adobe After Effects – nhưng sẽ bị ngừng lúc tạo hiệu ứng cho chúng, cho nên bạn sẽ không bao giờ mang thể thay thế phần mềm tạo mô hình / hoạt hình 3D truyền thống. Không những thế, bạn cũng sẽ bị dừng trong các mẫu mô phỏng bạn sở hữu thể tạo. Nếu như bạn nghiêm trang về bề ngoài 3D, bạn đích thực cần bắt đầu học một phần mềm 3D như Cinema 4D hoặc Maya .</p>\n<p>Xem thêm: <span style=\"color: rgb(17, 85, 204); font-family: arial; font-size: 10pt\"><a href=\"https://arena.fpt.edu.vn/\" target=\"_blank\">https://arena.fpt.edu.vn/</a></span><br>\n2. Chỉnh sửa video (kinda)</p>\n<p>Như chúng tôi đã biểu thị trong bài đăng này, Adobe After Effects chẳng phải là 1 phần mềm hoàn hảo để chỉnh sửa âm thanh hoặc video. Vững chắc bạn với thể hoàn tất công tác giả dụ bạn hoàn toàn phải làm, nhưng nó ko được thực hành cho điều đó. Adobe After Effects hoạt động phải chăng nhất lúc được ghép nối có phần mềm chỉnh sửa video. Adobe Premiere Pro phối hợp tốt nhất mang Adobe After Effects , nhưng bạn luôn với thể dùng một phần mềm như Final Cut Pro hoặc Media Composer để hoàn thành công tác</p>\n\n",
      "PostDate": "2019-09-26T07:41:08.7242986Z",
      "LastEditDate": "2020-06-25T01:54:54.7780725Z",
      "link": null
    },
    {
      "PostId": "b74812a1-b546-4797-9486-a6e597fd1a26",
      "UserId": 319917,
      "Username": "mrangel",
      "AvatarUrl": "https://secure.gravatar.com/avatar/?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Unfortunately that's a problem with the way text effects are applied. It should be possible to work around this, but it'll take some javascript code.\r\n\r\nOff the top of my head (I'm typing on my phone, so not in a position to test this), the javascript code would look something like:\r\n```\r\n$(function () {\r\n  var typewriter_timer;\r\n  var typewriter_iterator = function () {\r\n    var $ele = $('span[typewritertext]');\r\n    if ($ele.length) {\r\n      $ele = $ele.first();\r\n      var text = $ele.attr('typewritertext');\r\n      var speed = $ele.attr('typewriterspeed');\r\n      if (text) {\r\n        $ele.append(text.substr(0, 1));\r\n        $ele.attr('typewritertext', text.substr(1));\r\n      } else {\r\n        $ele.removeAttr('typewritertext').removeAttr('typewriterspeed');\r\n      }\r\n      typewriter_timer = setTimeout(typewriter_iterator, speed);\r\n    } else {\r\n      typewriter_timer = 0;\r\n    }\r\n  };\r\n  $.fn.typewriter = function (speed) {\r\n    this.each(function () {\r\n      $(this).attr({typewritertext: $(this).text(), typewriterspeed: speed}).text();\r\n    });\r\n    if (!typewriter_timer) {\r\n      typewriter_iterator();\r\n    }\r\n  };\r\n});\r\n```\r\n\r\nHere's a compressed version of that code to paste into quest if you don't want to include a javascript file. You should be able to paste this into the \"UI Initialisation\" script on the \"Advanced scripts\" tab.\r\n```\r\nJS.eval(\"$(function(){var i,p=function(){var t=$('span[typewritertext]');if(t.length){var e=(t=t.first()).attr('typewritertext'),r=t.attr('typewriterspeed');e?(t.append(e.substr(0,1)),t.attr('typewritertext',e.substr(1))):t.removeAttr('typewritertext').removeAttr('typewriterspeed'),i=setTimeout(p,r)}else i=0};$.fn.typewriter=function(t){this.each(function(){$(this).attr({typewritertext:$(this).text(),typewriterspeed:t}).text()}),i||p()}});\")\r\n```\r\n\r\nSorry if I've made mistakes there; hopefully someone who has access to an actual copy of Quest will be able to fix it up.",
      "EditableFormat": "markdown",
      "HTML": "<p>Unfortunately that's a problem with the way text effects are applied. It should be possible to work around this, but it'll take some javascript code.</p>\n<p>Off the top of my head (I'm typing on my phone, so not in a position to test this), the javascript code would look something like:</p>\n<pre><code>$(function () {\n  var typewriter_timer;\n  var typewriter_iterator = function () {\n    var $ele = $('span[typewritertext]');\n    if ($ele.length) {\n      $ele = $ele.first();\n      var text = $ele.attr('typewritertext');\n      var speed = $ele.attr('typewriterspeed');\n      if (text) {\n        $ele.append(text.substr(0, 1));\n        $ele.attr('typewritertext', text.substr(1));\n      } else {\n        $ele.removeAttr('typewritertext').removeAttr('typewriterspeed');\n      }\n      typewriter_timer = setTimeout(typewriter_iterator, speed);\n    } else {\n      typewriter_timer = 0;\n    }\n  };\n  $.fn.typewriter = function (speed) {\n    this.each(function () {\n      $(this).attr({typewritertext: $(this).text(), typewriterspeed: speed}).text();\n    });\n    if (!typewriter_timer) {\n      typewriter_iterator();\n    }\n  };\n});\n</code></pre>\n<p>Here's a compressed version of that code to paste into quest if you don't want to include a javascript file. You should be able to paste this into the \"UI Initialisation\" script on the \"Advanced scripts\" tab.</p>\n<pre><code>JS.eval(\"$(function(){var i,p=function(){var t=$('span[typewritertext]');if(t.length){var e=(t=t.first()).attr('typewritertext'),r=t.attr('typewriterspeed');e?(t.append(e.substr(0,1)),t.attr('typewritertext',e.substr(1))):t.removeAttr('typewritertext').removeAttr('typewriterspeed'),i=setTimeout(p,r)}else i=0};$.fn.typewriter=function(t){this.each(function(){$(this).attr({typewritertext:$(this).text(),typewriterspeed:t}).text()}),i||p()}});\")\n</code></pre>\n<p>Sorry if I've made mistakes there; hopefully someone who has access to an actual copy of Quest will be able to fix it up.</p>\n\n",
      "PostDate": "2019-09-26T09:55:31.1689401Z",
      "LastEditDate": null,
      "link": null
    }
  ]
}
