{
  "Topic": {
    "TopicId": "nodm3vwprkwuc8pidpwbfa",
    "ForumId": "16",
    "Title": "New feature: Upload a custom avatar",
    "LastUpdated": "2016-07-16T19:46:39.6988Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "25ccc2ff-467d-46e3-91ac-dbd5c6cf6e84",
      "UserId": 82,
      "Username": "Alex Warren",
      "AvatarUrl": "http://i.imgur.com/xlYHjF4b.jpg",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "This has been a much-requested feature over the years, and I've now implemented it - you can now upload your own avatar image.\r\n\r\nPreviously, to change your avatar image you had to change it over at [Gravatar](https://en.gravatar.com/), which wasn't really documented anywhere (and doesn't work if you log in using a Facebook account, as we use your Facebook profile picture in preference to your Gravatar image if you have one).\r\n\r\nYou can still change your image via Gravatar if you want, but I've now added the ability to upload an image directly. To upload one, just head to your [My Profile](http://textadventures.co.uk/account/myprofile) page.\r\n\r\nYour avatar image appears on your profile and next to your games, reviews and forum posts. (Note that if you change your avatar image, it won't be applied to your existing forum posts, so it will only affect new posts you make after the change).",
      "EditableFormat": "markdown",
      "HTML": "<p>This has been a much-requested feature over the years, and I've now implemented it - you can now upload your own avatar image.</p>\n<p>Previously, to change your avatar image you had to change it over at <a href=\"https://en.gravatar.com/\">Gravatar</a>, which wasn't really documented anywhere (and doesn't work if you log in using a Facebook account, as we use your Facebook profile picture in preference to your Gravatar image if you have one).</p>\n<p>You can still change your image via Gravatar if you want, but I've now added the ability to upload an image directly. To upload one, just head to your <a href=\"http://textadventures.co.uk/account/myprofile\">My Profile</a> page.</p>\n<p>Your avatar image appears on your profile and next to your games, reviews and forum posts. (Note that if you change your avatar image, it won't be applied to your existing forum posts, so it will only affect new posts you make after the change).</p>\n\n",
      "PostDate": "2016-07-16T19:46:39.6988Z",
      "LastEditDate": "2016-07-16T19:48:45.5941865Z"
    }
  ]
}
