{
  "Topic": {
    "TopicId": "qbhurjdp_eoyz66bucshza",
    "ForumId": "10",
    "Title": "Thoughts about 'use on'",
    "LastUpdated": "2019-12-24T15:04:44.1767329Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "a98e8adb-002a-436c-b142-dca4044f4552",
      "UserId": 319917,
      "Username": "mrangel",
      "AvatarUrl": "https://secure.gravatar.com/avatar/?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Hi folks!\r\n\r\nA while back, I made a prototype game 'Circus' and 'The Time Machine', based on the _Mysterious Adventures_ series by Brian Howarth. I was trying to emulate the style of the first computer game I ever played, while making the UI easier and smoother. For that reason I decided to provide two ways of doing most commands.\r\n\r\nThe original Mysterious Adventures engine only supported two word commands. For example, \"siphon fuel\" or \"wedge lever\". But sometimes this might lead to a verb-guessing game, where there are a few possible words and you have to try them all to find the one the designers intended. So I also made alternates for most of them, for example \"use snorkel on fuel tank\" or \"put rock in lever\".\r\n\r\nI think that makes a lot of sense; either picking the right object or guessing the verb implies that you know the intended action.\r\n\r\nRecently, I got to wondering if anyone else would like a library to make it easier to do games in this style. I'm thinking that you could make some verbs require a particular object.\r\n\r\nSo, for example, if your screwdriver has an attribute set: `screwdriver.useonverb = \"unscrew\"`, then the verb `unscrew` will only appear when the player has the screwdriver. And \"use screwdriver on panel\" will be treated as an alternate way of writing \"unscrew panel\".\r\n\r\nWould anyone be interested if I took a little time to dig the relevant functions out of those games and made them into a library?",
      "EditableFormat": "markdown",
      "HTML": "<p>Hi folks!</p>\n<p>A while back, I made a prototype game 'Circus' and 'The Time Machine', based on the <em>Mysterious Adventures</em> series by Brian Howarth. I was trying to emulate the style of the first computer game I ever played, while making the UI easier and smoother. For that reason I decided to provide two ways of doing most commands.</p>\n<p>The original Mysterious Adventures engine only supported two word commands. For example, \"siphon fuel\" or \"wedge lever\". But sometimes this might lead to a verb-guessing game, where there are a few possible words and you have to try them all to find the one the designers intended. So I also made alternates for most of them, for example \"use snorkel on fuel tank\" or \"put rock in lever\".</p>\n<p>I think that makes a lot of sense; either picking the right object or guessing the verb implies that you know the intended action.</p>\n<p>Recently, I got to wondering if anyone else would like a library to make it easier to do games in this style. I'm thinking that you could make some verbs require a particular object.</p>\n<p>So, for example, if your screwdriver has an attribute set: <code>screwdriver.useonverb = \"unscrew\"</code>, then the verb <code>unscrew</code> will only appear when the player has the screwdriver. And \"use screwdriver on panel\" will be treated as an alternate way of writing \"unscrew panel\".</p>\n<p>Would anyone be interested if I took a little time to dig the relevant functions out of those games and made them into a library?</p>\n\n",
      "PostDate": "2019-12-24T15:04:44.1767329Z",
      "LastEditDate": null,
      "link": null
    }
  ]
}
