{
  "Topic": {
    "TopicId": "zuoieockruyui4bjsgkaga",
    "ForumId": "5",
    "Title": "humoristic sci-fi story about tea and spaceships",
    "LastUpdated": "2017-12-12T02:33:06.4173015Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "127fbca5-4e32-40e6-85b4-c26980d5f41a",
      "UserId": 282113,
      "Username": "Mr.GReen1",
      "AvatarUrl": "http://i.imgur.com/IYKBkf9b.png",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "I'd just like some feedback on my gamebook adventure/work in progress. It's mostly humour, but also some sci-fi. The story is _supposedly_ set in the Victorian era and talks about some guy who can't decide between doing a tea party, popping off into space with his spaceship and going on an adventure in a forest, so you'll have to decide for him.\r\n**Golly!**\r\nWhat an amazing plot, isn't it? Anyway, here's the link :\r\nhttp://textadventures.co.uk/games/view/yyqjqzacm0uhdpc65nmxyw/tea-party-act-1\r\nAlso I guess if you're realllllly sensible or get easily butthurt by such subjects as : death, drowning to death, bleeding to death, assassination, frog rains, death by intoxication, house fires, loss of memory, self-inserts, death by banana wrath and evil trees, I should _maybe_ warn you that all of these things are in the story.",
      "EditableFormat": "markdown",
      "HTML": "<p>I'd just like some feedback on my gamebook adventure/work in progress. It's mostly humour, but also some sci-fi. The story is <em>supposedly</em> set in the Victorian era and talks about some guy who can't decide between doing a tea party, popping off into space with his spaceship and going on an adventure in a forest, so you'll have to decide for him.<br>\n<strong>Golly!</strong><br>\nWhat an amazing plot, isn't it? Anyway, here's the link :<br>\nhttp://textadventures.co.uk/games/view/yyqjqzacm0uhdpc65nmxyw/tea-party-act-1<br>\nAlso I guess if you're realllllly sensible or get easily butthurt by such subjects as : death, drowning to death, bleeding to death, assassination, frog rains, death by intoxication, house fires, loss of memory, self-inserts, death by banana wrath and evil trees, I should <em>maybe</em> warn you that all of these things are in the story.</p>\n\n",
      "PostDate": "2017-12-12T02:33:06.4173015Z",
      "LastEditDate": null,
      "link": null
    }
  ]
}
