{
  "Topic": {
    "TopicId": "07wht9hrjkevg_w5wut21q",
    "ForumId": "10",
    "Title": "A quick question about Quest web version.",
    "LastUpdated": "2020-08-22T07:45:46.7894337Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "14ea4793-789f-4b53-8164-ae990e2750c1",
      "UserId": 496842,
      "Username": "IzyaboiCallume",
      "AvatarUrl": "https://secure.gravatar.com/avatar/?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Is the web version equally as good as the downloadable one? Or does the software version have more features than the web version? What's the downsides of using the web version?\r\n\r\nAlso, I think that the web version doesn't allow me to make attributes for players.",
      "EditableFormat": "markdown",
      "HTML": "<p>Is the web version equally as good as the downloadable one? Or does the software version have more features than the web version? What's the downsides of using the web version?</p>\n<p>Also, I think that the web version doesn't allow me to make attributes for players.</p>\n\n",
      "PostDate": "2020-08-22T07:45:46.7894337Z",
      "LastEditDate": "2020-08-22T08:46:11.4772352Z",
      "link": null
    },
    {
      "PostId": "453eaf9d-390b-41bb-92e7-526a470c3f63",
      "UserId": 319917,
      "Username": "mrangel",
      "AvatarUrl": "https://secure.gravatar.com/avatar/?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "> What's the downsides of using the web version?\r\n\r\nThe web version has a less flexible *editor*. There are a whole bunch of forms that there just aren't web versions of, so you have to use scripting to work around them.\r\n\r\nYou can still do most of this stuff, but it takes more effort. You can use scripting to modify core commands, and to set attributes. But you can't modify or override the core *functions*, or modify the language libraries. You also can't just import a library, although in most cases you can add all the objects/functions/commands from a library by creating them one-by-one in the editor.\r\n\r\n> Also, I think that the web version doesn't allow me to make attributes for players.\r\n\r\nThe web version doesn't have an Attributes tab in the editor.\r\n\r\nIn the downloaded version, to give the player a strength attribute you'd go to the Attributes tab, click 'add', give it a name and an initial value. (not  sure of the details, as I can't use the downloaded version as I don't have a Windows PC)\r\n\r\nOn the web version, you would need to go to the object's 'Features' tab, tick \"Run an initialisation script for this object\", then go to the initialisation script tab and enter something like:\r\n```\r\nthis.strength = 7\r\n```\r\n\r\nIf you mean status attributes that appear in the sidebar, I think you can add them fine once the attribute exists. They are stored in the stringdictionary attributes `game.povstatusattributes` (which I think appears in the editor, not 100% sure), and `game.pov.statusattributes` (which I think doesn't, so you'd need to create it during your start script)",
      "EditableFormat": "markdown",
      "HTML": "<blockquote>\n<p>What's the downsides of using the web version?</p>\n</blockquote>\n<p>The web version has a less flexible <em>editor</em>. There are a whole bunch of forms that there just aren't web versions of, so you have to use scripting to work around them.</p>\n<p>You can still do most of this stuff, but it takes more effort. You can use scripting to modify core commands, and to set attributes. But you can't modify or override the core <em>functions</em>, or modify the language libraries. You also can't just import a library, although in most cases you can add all the objects/functions/commands from a library by creating them one-by-one in the editor.</p>\n<blockquote>\n<p>Also, I think that the web version doesn't allow me to make attributes for players.</p>\n</blockquote>\n<p>The web version doesn't have an Attributes tab in the editor.</p>\n<p>In the downloaded version, to give the player a strength attribute you'd go to the Attributes tab, click 'add', give it a name and an initial value. (not  sure of the details, as I can't use the downloaded version as I don't have a Windows PC)</p>\n<p>On the web version, you would need to go to the object's 'Features' tab, tick \"Run an initialisation script for this object\", then go to the initialisation script tab and enter something like:</p>\n<pre><code>this.strength = 7\n</code></pre>\n<p>If you mean status attributes that appear in the sidebar, I think you can add them fine once the attribute exists. They are stored in the stringdictionary attributes <code>game.povstatusattributes</code> (which I think appears in the editor, not 100% sure), and <code>game.pov.statusattributes</code> (which I think doesn't, so you'd need to create it during your start script)</p>\n\n",
      "PostDate": "2020-08-22T11:12:00.0140015Z",
      "LastEditDate": null,
      "link": null
    }
  ]
}
