{
  "Topic": {
    "TopicId": "4490",
    "ForumId": "10",
    "Title": "How to make random monster spawns using GUI",
    "LastUpdated": "2014-07-17T23:28:50+01:00",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "29563",
      "UserId": 0,
      "Username": "Monkey Prodigy",
      "UserAvatar": null,
      "UserGravatar": "2540a9aa2249f4cadc735bd230b77c81",
      "EditableText": "I want to make random monster spawn for my game Gemsthrone, the RPG.\nI need it to where it will only spawn certain monsters in certain places, such as a zombie in a graveyard.\nThen, I need the zombie to be a certain level ( which will then choose the zombie's stats), which will be close to the players. \nOnce the player kills the zombie, it will drop items, which you can gather.\nCreatures will always drop certain items, but will sometimes will drop that item plus another item.\nZombies will always drop the clothes it was wearing, and perhaps something else.\nOn the clothes it was wearing, the code will need to:\n   Spawn the monster\n       decide the level and the items it has\n           equip those items its wearing to boost the creatures stats\n               \nThen, it will need to do this once it kills the monster:\n      drop the items",
      "EditableFormat": "bbcode",
      "HTML": "I want to make random monster spawn for my game Gemsthrone, the RPG.<br/>I need it to where it will only spawn certain monsters in certain places, such as a zombie in a graveyard.<br/>Then, I need the zombie to be a certain level ( which will then choose the zombie's stats), which will be close to the players. <br/>Once the player kills the zombie, it will drop items, which you can gather.<br/>Creatures will always drop certain items, but will sometimes will drop that item plus another item.<br/>Zombies will always drop the clothes it was wearing, and perhaps something else.<br/>On the clothes it was wearing, the code will need to:<br/>   Spawn the monster<br/>       decide the level and the items it has<br/>           equip those items its wearing to boost the creatures stats<br/>               <br/>Then, it will need to do this once it kills the monster:<br/>      drop the items",
      "PostDate": "2014-07-17T23:28:50+01:00",
      "LastEditDate": null
    }
  ]
}
