{
  "Topic": {
    "TopicId": "ocbs3rhgvu_5lqcvnfhw-a",
    "ForumId": "10",
    "Title": "Global (Literally) Variables?",
    "LastUpdated": "2019-10-01T21:01:29.0985162Z",
    "ReplyCount": 0
  },
  "Posts": [
    {
      "PostId": "3021ccbd-5766-49b9-a40d-a41430fa46f2",
      "UserId": 436688,
      "Username": "CabalisticKoala56252",
      "AvatarUrl": "https://secure.gravatar.com/avatar/?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "So is there a way to create a variable that is accessible across devices? For my game, I'd like to have a global counter so that each time somebody downloads the game, they get a different and unique number. Is that possible?",
      "EditableFormat": "markdown",
      "HTML": "<p>So is there a way to create a variable that is accessible across devices? For my game, I'd like to have a global counter so that each time somebody downloads the game, they get a different and unique number. Is that possible?</p>\n\n",
      "PostDate": "2019-10-01T21:01:29.0985162Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "a873b86d-b8c6-4012-9607-2c9641a30209",
      "UserId": 418279,
      "Username": "Zesc",
      "AvatarUrl": "https://i.imgur.com/bGcfC7sb.png",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "**Short answer:** yes, it is, but it's no easy task.\r\n\r\n**Long answer:** if said variable shall be accesible from various devices, it obviously must be stored somewhere in the web. Meaning that to check for this variable, every player must have an internet connection to read that variable, then increase it by one, etc. Even if we ignore that this is a security nightmare, you still would have to store it somewhere where it's guranteed to be always avaiable.\r\n\r\nThe easiest thing (which is still disproportionaly complex) would be reading this very page's download statistic, which is diificult and probably against the terms of service.\r\n\r\nThere are some trickeries that allow you to make it _seem_ like every player gets an unique number that increases with time (hint: system time), but i guess you consider it cheating. Not that many people would ever make the effort to double-check it.",
      "EditableFormat": "markdown",
      "HTML": "<p><strong>Short answer:</strong> yes, it is, but it's no easy task.</p>\n<p><strong>Long answer:</strong> if said variable shall be accesible from various devices, it obviously must be stored somewhere in the web. Meaning that to check for this variable, every player must have an internet connection to read that variable, then increase it by one, etc. Even if we ignore that this is a security nightmare, you still would have to store it somewhere where it's guranteed to be always avaiable.</p>\n<p>The easiest thing (which is still disproportionaly complex) would be reading this very page's download statistic, which is diificult and probably against the terms of service.</p>\n<p>There are some trickeries that allow you to make it <em>seem</em> like every player gets an unique number that increases with time (hint: system time), but i guess you consider it cheating. Not that many people would ever make the effort to double-check it.</p>\n\n",
      "PostDate": "2019-10-02T19:33:09.3898103Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "1233e102-acf1-4de2-a78b-04cebddb2d24",
      "UserId": 319917,
      "Username": "mrangel",
      "AvatarUrl": "https://secure.gravatar.com/avatar/?d=retro",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Shouldn't be that hard; but might stop working at some point in the future.\r\n\r\nFind a web service that provides free hit counters (<a href=\"https://freehostedscripts.net/texthitcounter/\">Here's one</a>). That little script contacts a script on their servers every time it is viewed, incrementing the number. Once you've signed up, you could easily modify the javascript they give you so that instead of writing the value to the page, it passes it to `ASLEvent` to give Quest its number.\r\n\r\nHowever, this will tell you how many times the game is started, not how many times it's been downloaded. If you want to keep the same number when the player starts a new game, you would have to store it in a cookie or LocalStorage – and that functionality is disabled in the desktop player. So you could do it in the web version, but not on desktop.",
      "EditableFormat": "markdown",
      "HTML": "<p>Shouldn't be that hard; but might stop working at some point in the future.</p>\n<p>Find a web service that provides free hit counters (<a href=\"https://freehostedscripts.net/texthitcounter/\">Here's one</a>). That little script contacts a script on their servers every time it is viewed, incrementing the number. Once you've signed up, you could easily modify the javascript they give you so that instead of writing the value to the page, it passes it to <code>ASLEvent</code> to give Quest its number.</p>\n<p>However, this will tell you how many times the game is started, not how many times it's been downloaded. If you want to keep the same number when the player starts a new game, you would have to store it in a cookie or LocalStorage – and that functionality is disabled in the desktop player. So you could do it in the web version, but not on desktop.</p>\n\n",
      "PostDate": "2019-10-02T20:08:08.0117307Z",
      "LastEditDate": null,
      "link": null
    },
    {
      "PostId": "5dd39038-e270-4c25-9606-8cf4c437b5f6",
      "UserId": 260569,
      "Username": "DarkLizerd",
      "AvatarUrl": "https://i.imgur.com/vjdH3t6b.jpg",
      "UserAvatar": null,
      "UserGravatar": null,
      "EditableText": "Why?",
      "EditableFormat": "markdown",
      "HTML": "<p>Why?</p>\n\n",
      "PostDate": "2019-10-04T01:15:16.8466158Z",
      "LastEditDate": null,
      "link": null
    }
  ]
}
