{
  "Topic": {
    "TopicId": "4075",
    "ForumId": "5",
    "Title": "Gothar's Hope",
    "LastUpdated": "2014-10-23T08:31:56+01:00",
    "ReplyCount": 40
  },
  "Posts": [
    {
      "PostId": "27222",
      "UserId": 0,
      "Username": "Avantar",
      "UserAvatar": "7009_1418309433.jpg",
      "UserGravatar": "86de2b95c147252a1c38b8d3996da855",
      "EditableText": "Hi guys,\n\nI have posted a demo of my ongoing game. This is just the preparation to your quest, but should give the general feel.\nI am not sure how to include the sound files and game manual for download, but here is the link:\n\n<!-- m --><a class=\"postlink\" href=\"http://textadventures.co.uk/games/view/_oqytzb6oewotdv9a_rzna/gothars-hope-demo\">http://textadventures.co.uk/games/view/ ... -hope-demo</a><!-- m -->\n\nI have attached the game manual, just in case it is not available for  download.\nI would like to know what you think and what possibly sucks.\n\nThank you in advance for the review! <!-- s:wink: --><img src=\"{SMILIES_PATH}/icon_wink.gif\" alt=\":wink:\" title=\"Wink\" /><!-- s:wink: -->",
      "EditableFormat": "bbcode",
      "HTML": "Hi guys,<br/><br/>I have posted a demo of my ongoing game. This is just the preparation to your quest, but should give the general feel.<br/>I am not sure how to include the sound files and game manual for download, but here is the link:<br/><br/><!-- m --><a class=\"postlink\" href=\"http://textadventures.co.uk/games/view/_oqytzb6oewotdv9a_rzna/gothars-hope-demo\">http://textadventures.co.uk/games/view/ ... -hope-demo</a><!-- m --><br/><br/>I have attached the game manual, just in case it is not available for  download.<br/>I would like to know what you think and what possibly sucks.<br/><br/>Thank you in advance for the review! <!-- s:wink: --><img src=\"{SMILIES_PATH}/icon_wink.gif\" alt=\":wink:\" title=\"Wink\" /><!-- s:wink: --><div><a href=\"/forumattachments/816/Game manual.zip\">Game manual.zip</a></div>",
      "PostDate": "2013-12-26T10:52:12+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27237",
      "UserId": 0,
      "Username": "Avantar",
      "UserAvatar": "7009_1418309433.jpg",
      "UserGravatar": "86de2b95c147252a1c38b8d3996da855",
      "EditableText": "For those that want to check out the demo - it is a good idea to download the manual, it could prove useful.",
      "EditableFormat": "bbcode",
      "HTML": "For those that want to check out the demo - it is a good idea to download the manual, it could prove useful.",
      "PostDate": "2013-12-26T18:53:25+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "27433",
      "UserId": 0,
      "Username": "Avantar",
      "UserAvatar": "7009_1418309433.jpg",
      "UserGravatar": "86de2b95c147252a1c38b8d3996da855",
      "EditableText": "I have updated the demo that I have posted earlier to show more or less the features I want to use in the game.\nBeing a bit busy at the moment, I will give this a rest for now; since I am a bit slow and new on Quest.\n\n-Fixes:\nA few errors with the combat system. (counterattack and defend had issues)\nMade your battle turn green as to read it more easily.\nFixed a problem where you could speak to the elder multiple times, scoring money multiple times.\nPut names on the map\n\n-Added features:\nAn encounter check\nA skill check\nA mini game\nAn archery range\n\n-Walkthrough:\n Since this is just the preparation before the real adventure starts; let's go through it:\n\n-In your bedroom\ntype 'search bedroom' to find your backpack - it can hold 10 items. (Some items won't fit. You can only carry a limited amount of items on your person - I think it is 22 or somewhere close)\nPick up the Summons letter and read it - now you will be able to leave the room - so do\n\n-In North corridor\ntype 'give letter to guards' - this will allow you entrance to the Elder's chambers.\n\n-Elder chambers\nGo through the conversation without canceling (You will choose your weapon of choice, receive a map, get your journal updated, unlock the chest and training manual and receive 10 coins.)\nChoose your skills from the training manual and equipment from the chest. (max five items from chest - choose carefully; since you can't put stuff back in the chest and take something else)\nLeave the room and head all the way South (the entrance to the south corridor will now be unlocked - yes it was locked)\n\n-South corridor\nGo NE to the Training grounds\n\n-Training grounds\nIt is a good idea to save your game here.\nSpeak to Trembemere\nAnswer 'yes' to the first question and 'yes' or 'no' to the second. (Regardless whether you would like to spar against him or not - you will travel the next morning to Talan harbour. Don't worry - It is a friendly match and you won't die)\nNotice that if you had any weapons equipped, it will be unequipped at this point.\n\n\n-Talan mountain pass\nThere is a 60% chance that you will encounter an event here. If you have chosen the Spotting skill as one of your skills, you will spot the danger and be given a chance to equip a weapon, else you will have to equip a weapon during combat.\nIf you do get the encounter and you do not die, type 'search talan pass' to find some coins.\nOtherwise, you will just continue to Talan harbour.\nIf you want to see what the encounter is about, play again from your saved game and hopefully you'll get the encounter.\n\n-Talan harbour\nThere is a small shop to the west to demonstrate selling and buying. You can buy whatever the shop has to offer and sell anything you own and that can be sold. (To find out the value of an item and whether it can be sold, click on the item and then on the 'Identify' button) Remember: You can rebuy any item sold as long as you stay in the shop - once you leave and come back, your items won't be available anymore.\nTo the south is an archery range\n\n-Archery training\nThere are 6 targets at different distances (25 meters to 150 meters in 25m increments)\nPick up the Practise Bow.\nClick on a target and hit the 'Shoot at' button. After you have released 10 arrows at a target, it will show you your total points achieved.\nThere is always a chance for missing the target or doing a bad shot, but the more CS points you have, the better your chances of scoring a bullseye.\n\n-Talan harbour\nSpeak to captain Winters\nYou are now in the ship, Stormrider. \n\n-Stormrider\nThere is a table where you can play a gambling game called: Snake Eyes. Read the game rules and see if you can make some money or loose some.\n\nThis is where it ends for now - you will sleep in your cabin after you have spoken to captain Winters and you will restore your health, or some of it; depending on....\n\n***Forgot to mention: When equipping the bow, it plays the sound for drawing a two-handed sword; since I do not have a sound for the bow yet - working on it.**\n\nEnjoy and give some crit - negative or positive is welcome",
      "EditableFormat": "bbcode",
      "HTML": "I have updated the demo that I have posted earlier to show more or less the features I want to use in the game.<br/>Being a bit busy at the moment, I will give this a rest for now; since I am a bit slow and new on Quest.<br/><br/>-Fixes:<br/>A few errors with the combat system. (counterattack and defend had issues)<br/>Made your battle turn green as to read it more easily.<br/>Fixed a problem where you could speak to the elder multiple times, scoring money multiple times.<br/>Put names on the map<br/><br/>-Added features:<br/>An encounter check<br/>A skill check<br/>A mini game<br/>An archery range<br/><br/>-Walkthrough:<br/> Since this is just the preparation before the real adventure starts; let's go through it:<br/><br/>-In your bedroom<br/>type 'search bedroom' to find your backpack - it can hold 10 items. (Some items won't fit. You can only carry a limited amount of items on your person - I think it is 22 or somewhere close)<br/>Pick up the Summons letter and read it - now you will be able to leave the room - so do<br/><br/>-In North corridor<br/>type 'give letter to guards' - this will allow you entrance to the Elder's chambers.<br/><br/>-Elder chambers<br/>Go through the conversation without canceling (You will choose your weapon of choice, receive a map, get your journal updated, unlock the chest and training manual and receive 10 coins.)<br/>Choose your skills from the training manual and equipment from the chest. (max five items from chest - choose carefully; since you can't put stuff back in the chest and take something else)<br/>Leave the room and head all the way South (the entrance to the south corridor will now be unlocked - yes it was locked)<br/><br/>-South corridor<br/>Go NE to the Training grounds<br/><br/>-Training grounds<br/>It is a good idea to save your game here.<br/>Speak to Trembemere<br/>Answer 'yes' to the first question and 'yes' or 'no' to the second. (Regardless whether you would like to spar against him or not - you will travel the next morning to Talan harbour. Don't worry - It is a friendly match and you won't die)<br/>Notice that if you had any weapons equipped, it will be unequipped at this point.<br/><br/><br/>-Talan mountain pass<br/>There is a 60% chance that you will encounter an event here. If you have chosen the Spotting skill as one of your skills, you will spot the danger and be given a chance to equip a weapon, else you will have to equip a weapon during combat.<br/>If you do get the encounter and you do not die, type 'search talan pass' to find some coins.<br/>Otherwise, you will just continue to Talan harbour.<br/>If you want to see what the encounter is about, play again from your saved game and hopefully you'll get the encounter.<br/><br/>-Talan harbour<br/>There is a small shop to the west to demonstrate selling and buying. You can buy whatever the shop has to offer and sell anything you own and that can be sold. (To find out the value of an item and whether it can be sold, click on the item and then on the 'Identify' button) Remember: You can rebuy any item sold as long as you stay in the shop - once you leave and come back, your items won't be available anymore.<br/>To the south is an archery range<br/><br/>-Archery training<br/>There are 6 targets at different distances (25 meters to 150 meters in 25m increments)<br/>Pick up the Practise Bow.<br/>Click on a target and hit the 'Shoot at' button. After you have released 10 arrows at a target, it will show you your total points achieved.<br/>There is always a chance for missing the target or doing a bad shot, but the more CS points you have, the better your chances of scoring a bullseye.<br/><br/>-Talan harbour<br/>Speak to captain Winters<br/>You are now in the ship, Stormrider. <br/><br/>-Stormrider<br/>There is a table where you can play a gambling game called: Snake Eyes. Read the game rules and see if you can make some money or loose some.<br/><br/>This is where it ends for now - you will sleep in your cabin after you have spoken to captain Winters and you will restore your health, or some of it; depending on....<br/><br/>***Forgot to mention: When equipping the bow, it plays the sound for drawing a two-handed sword; since I do not have a sound for the bow yet - working on it.**<br/><br/>Enjoy and give some crit - negative or positive is welcome",
      "PostDate": "2014-01-12T17:32:04+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "30672",
      "UserId": 0,
      "Username": "Avantar",
      "UserAvatar": "7009_1418309433.jpg",
      "UserGravatar": "86de2b95c147252a1c38b8d3996da855",
      "EditableText": "I have been working on this game up until last week, but decided to abandon this title.\n\nMy idea was to bring something unique to the table sporting shops, merchants, unique combat system, actual bow shooting with different arrows depicted on distance, dual wielding, shield wielding, armour ranging from helmets to cuisses and having your choices in game play out differently with chances of different encounters.\n\nI included all of this in the demo to see if there are any interest, but sadly there is too little interest to justify the amount of work that still need to go into it. I am not sure what the issue is with this game; since there wasn't really any feedback.\n\nNow it is time for a new project that will hopefully be more appealing to all of you here.\nThis time round I will post the full game for beta testing. <!-- s:-) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":-)\" title=\"Smile\" /><!-- s:-) -->",
      "EditableFormat": "bbcode",
      "HTML": "I have been working on this game up until last week, but decided to abandon this title.<br/><br/>My idea was to bring something unique to the table sporting shops, merchants, unique combat system, actual bow shooting with different arrows depicted on distance, dual wielding, shield wielding, armour ranging from helmets to cuisses and having your choices in game play out differently with chances of different encounters.<br/><br/>I included all of this in the demo to see if there are any interest, but sadly there is too little interest to justify the amount of work that still need to go into it. I am not sure what the issue is with this game; since there wasn't really any feedback.<br/><br/>Now it is time for a new project that will hopefully be more appealing to all of you here.<br/>This time round I will post the full game for beta testing. <!-- s:-) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":-)\" title=\"Smile\" /><!-- s:-) -->",
      "PostDate": "2014-10-15T11:51:22+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30673",
      "UserId": 0,
      "Username": "Silver",
      "UserAvatar": null,
      "UserGravatar": "13024be5ccbb463906b024d5bd3cb5e8",
      "EditableText": "I wouldn't be put off by lack of feedback; that's just how the cookie crumbles sometimes. I'll give it a look later if you're still after some feedback.",
      "EditableFormat": "bbcode",
      "HTML": "I wouldn't be put off by lack of feedback; that's just how the cookie crumbles sometimes. I'll give it a look later if you're still after some feedback.",
      "PostDate": "2014-10-15T12:16:04+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30674",
      "UserId": 0,
      "Username": "Avantar",
      "UserAvatar": "7009_1418309433.jpg",
      "UserGravatar": "86de2b95c147252a1c38b8d3996da855",
      "EditableText": "Feedback is always welcome.\n\nI had it linger for while and did not come to a conclusion on a whim, but would ideally create something  people would enjoy playing as much I have enjoyed creating it.",
      "EditableFormat": "bbcode",
      "HTML": "Feedback is always welcome.<br/><br/>I had it linger for while and did not come to a conclusion on a whim, but would ideally create something  people would enjoy playing as much I have enjoyed creating it.",
      "PostDate": "2014-10-15T12:28:38+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30675",
      "UserId": 0,
      "Username": "Silver",
      "UserAvatar": null,
      "UserGravatar": "13024be5ccbb463906b024d5bd3cb5e8",
      "EditableText": "I haven't looked yet (at work at the moment) but I think people can be a bit put off by demos. What may have been a substantial amount of work for the author can translate into a fairly skeleton experience for the player and as such difficult for them to respond positively - so they don't bother. \n\nI'll have a look tonight and give you a full and frank constructive critique.",
      "EditableFormat": "bbcode",
      "HTML": "I haven't looked yet (at work at the moment) but I think people can be a bit put off by demos. What may have been a substantial amount of work for the author can translate into a fairly skeleton experience for the player and as such difficult for them to respond positively - so they don't bother. <br/><br/>I'll have a look tonight and give you a full and frank constructive critique.",
      "PostDate": "2014-10-15T13:08:43+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30680",
      "UserId": 0,
      "Username": "Avantar",
      "UserAvatar": "7009_1418309433.jpg",
      "UserGravatar": "86de2b95c147252a1c38b8d3996da855",
      "EditableText": "I thank you for your efforts. <!-- s:wink: --><img src=\"{SMILIES_PATH}/icon_wink.gif\" alt=\":wink:\" title=\"Wink\" /><!-- s:wink: -->",
      "EditableFormat": "bbcode",
      "HTML": "I thank you for your efforts. <!-- s:wink: --><img src=\"{SMILIES_PATH}/icon_wink.gif\" alt=\":wink:\" title=\"Wink\" /><!-- s:wink: -->",
      "PostDate": "2014-10-15T15:20:13+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30683",
      "UserId": 0,
      "Username": "Silver",
      "UserAvatar": null,
      "UserGravatar": "13024be5ccbb463906b024d5bd3cb5e8",
      "EditableText": "Okay here goes. Firstly lets get the aesthetics out of the way.\n\nThe initial screen where it asks your name etc looks bland. The next one, the intro with the music, looks better - the third one - which is used for the game itself - I'm not too sure about. Or maybe that's because I've been presented with three different colour schemes in quick succession it's left me confused? I'd try and settle on a colour scheme that sort of makes the three intro pages uniform: chopping and changing colours and backgrounds seems a bit unpolished. Of the three the red text on black background is best (actually I'm not 100% on any of them really) but not by any means perfect. It visually looks better than the other two but red text on a black background can be a bit fatiguing on the eyes, I find. I'd probably experiment a little more on presentation and try and keep all the opening scenes to one theme. Of course changing background and foreground colours can be great if done well. I'd probably leave them for specific events though rather than screen by screen. The music also ends quite abruptly when you navigate to the the third page from the second. I'd be inclined to time how long it'd take someone to reasonably read the page and edit the music to fit. Then include a timer that allows the music to finish before presenting the 'press any key to continue' or you could even leave that out and progress to the next screen automatically in your script. As it is now, you finish reading and then *clunk* it stops and the next screen is silent.\n\nThe game itself is a very good start if a little short (unless I'm missing something?). I saw that you'd implemented systems for various things including money and xp etc iirc but I didn't see any of these put to any use in order to comment on them. In a sense though it almost feels like you're implementing [i:20x4fi0d]too much[/i:20x4fi0d], especially for a first game, and that sooner or later you'll find you've got too much going on to keep track of (also that may not be the case! I'm also working on my first game/s at the moment though and I know I'd struggle so maybe I'm projecting a bit here, I can identify with the wanting to try out lots of different things though). \n\nAnother thing that indicates lack of polish (although I am aware it's a demo so take with pinch of salt) is that I had a journal in my inventory but reading it revealed it was empty. Similarly investigating the cupboard in the bedroom reveals that it's empty. Yes buildings do sometimes have empty cupboards but it's also nice in a text adventure to have your explorations rewarded: maybe some of the items in your starting inventory could have been found there such as the knife? You did at least have descriptions for these items though (you'd be surprised how many new games don't) but on examining some of the scenery objects (in your room description) they did not (such as the ornaments and table in the North corridor.\n\n[quote:20x4fi0d]You are in the North corridor.\nThis corridor is a bit wider than the West corridor with some furniture and ornaments decorating its length.\n\nYou can see Guards.\nYou can go to the south, Elder Watcher Chambers or west.\n\n&gt; x furniture\nI can't see that.\n\n&gt; x ornaments\nI can't see that.[/quote:20x4fi0d]\n\nAll that aside I do feel it has tremendous potential though and unless you honestly feel it's better to go back to the drawing board I'd perhaps take another look at it but perhaps be a little more modest in your ambitions and be wary of [b:20x4fi0d]Scope Creep[/b:20x4fi0d]. Of course you may prove me wrong on that - I certainly hope you do! <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D -->\n\n<!-- m --><a class=\"postlink\" href=\"http://en.wikipedia.org/wiki/Scope_creep\">http://en.wikipedia.org/wiki/Scope_creep</a><!-- m -->\n\nI did seem to get stuck quite quickly with the game telling me I had to speak with someone (it didn't appear to be the same person in each instruction) before I could continue to explore. However, I couldn't work out how to pass the guards. I've probably given you enough to mull over with what I did play though.",
      "EditableFormat": "bbcode",
      "HTML": "Okay here goes. Firstly lets get the aesthetics out of the way.<br/><br/>The initial screen where it asks your name etc looks bland. The next one, the intro with the music, looks better - the third one - which is used for the game itself - I'm not too sure about. Or maybe that's because I've been presented with three different colour schemes in quick succession it's left me confused? I'd try and settle on a colour scheme that sort of makes the three intro pages uniform: chopping and changing colours and backgrounds seems a bit unpolished. Of the three the red text on black background is best (actually I'm not 100% on any of them really) but not by any means perfect. It visually looks better than the other two but red text on a black background can be a bit fatiguing on the eyes, I find. I'd probably experiment a little more on presentation and try and keep all the opening scenes to one theme. Of course changing background and foreground colours can be great if done well. I'd probably leave them for specific events though rather than screen by screen. The music also ends quite abruptly when you navigate to the the third page from the second. I'd be inclined to time how long it'd take someone to reasonably read the page and edit the music to fit. Then include a timer that allows the music to finish before presenting the 'press any key to continue' or you could even leave that out and progress to the next screen automatically in your script. As it is now, you finish reading and then *clunk* it stops and the next screen is silent.<br/><br/>The game itself is a very good start if a little short (unless I'm missing something?). I saw that you'd implemented systems for various things including money and xp etc iirc but I didn't see any of these put to any use in order to comment on them. In a sense though it almost feels like you're implementing <span style=\"font-style:italic;\">too much</span>, especially for a first game, and that sooner or later you'll find you've got too much going on to keep track of (also that may not be the case! I'm also working on my first game/s at the moment though and I know I'd struggle so maybe I'm projecting a bit here, I can identify with the wanting to try out lots of different things though). <br/><br/>Another thing that indicates lack of polish (although I am aware it's a demo so take with pinch of salt) is that I had a journal in my inventory but reading it revealed it was empty. Similarly investigating the cupboard in the bedroom reveals that it's empty. Yes buildings do sometimes have empty cupboards but it's also nice in a text adventure to have your explorations rewarded: maybe some of the items in your starting inventory could have been found there such as the knife? You did at least have descriptions for these items though (you'd be surprised how many new games don't) but on examining some of the scenery objects (in your room description) they did not (such as the ornaments and table in the North corridor.<br/><br/><blockquote><p>You are in the North corridor.<br/>This corridor is a bit wider than the West corridor with some furniture and ornaments decorating its length.<br/><br/>You can see Guards.<br/>You can go to the south, Elder Watcher Chambers or west.<br/><br/>&gt; x furniture<br/>I can't see that.<br/><br/>&gt; x ornaments<br/>I can't see that.</p></blockquote><br/><br/>All that aside I do feel it has tremendous potential though and unless you honestly feel it's better to go back to the drawing board I'd perhaps take another look at it but perhaps be a little more modest in your ambitions and be wary of <span style=\"font-weight:bold;\">Scope Creep</span>. Of course you may prove me wrong on that - I certainly hope you do! <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D --><br/><br/><!-- m --><a class=\"postlink\" href=\"http://en.wikipedia.org/wiki/Scope_creep\">http://en.wikipedia.org/wiki/Scope_creep</a><!-- m --><br/><br/>I did seem to get stuck quite quickly with the game telling me I had to speak with someone (it didn't appear to be the same person in each instruction) before I could continue to explore. However, I couldn't work out how to pass the guards. I've probably given you enough to mull over with what I did play though.",
      "PostDate": "2014-10-15T18:25:28+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30685",
      "UserId": 0,
      "Username": "Avantar",
      "UserAvatar": "7009_1418309433.jpg",
      "UserGravatar": "86de2b95c147252a1c38b8d3996da855",
      "EditableText": "Thank you for your objective input. Much appreciated.\n\nI guess you failed to notice I have a walk through in this topic and a manual. \nThere is indeed starting items, but I guess you got stuck way before the game actually starts.\nYou have to present the letter to the guards. (It says so in the letter) That is where you will receive your guest, money, choose your weapons and skills\nSearching your bedroom would give you your backpack. Instruction will be given and doors unlocked to go and see Trembemere that will accompany you on your mission. Anyway.\n\nI guess you haven't had your first practice fight, encounter, archery practise...\n\nIt is a good point about the intro. Something that can definitely improve I agree. The colours - You might be right. Blue was suppose to be third person and events. Red was suppose to be action - or it was the idea.\n\nThank you for the trouble.",
      "EditableFormat": "bbcode",
      "HTML": "Thank you for your objective input. Much appreciated.<br/><br/>I guess you failed to notice I have a walk through in this topic and a manual. <br/>There is indeed starting items, but I guess you got stuck way before the game actually starts.<br/>You have to present the letter to the guards. (It says so in the letter) That is where you will receive your guest, money, choose your weapons and skills<br/>Searching your bedroom would give you your backpack. Instruction will be given and doors unlocked to go and see Trembemere that will accompany you on your mission. Anyway.<br/><br/>I guess you haven't had your first practice fight, encounter, archery practise...<br/><br/>It is a good point about the intro. Something that can definitely improve I agree. The colours - You might be right. Blue was suppose to be third person and events. Red was suppose to be action - or it was the idea.<br/><br/>Thank you for the trouble.",
      "PostDate": "2014-10-15T18:45:09+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30687",
      "UserId": 0,
      "Username": "Silver",
      "UserAvatar": null,
      "UserGravatar": "13024be5ccbb463906b024d5bd3cb5e8",
      "EditableText": "Thanks for the pointers. I suppose I wasn't trying too hard to progress things as I was also busy making notes but I'll certainly give it another go with the hints you've given me.\n\n(I didn't download the manual or read the walkthrough - bear in mind that those who play online won't either: perhaps you could upload it somewhere and include a link or command in the game to retrieve the manual? I'd certainly consider ways of incorporating it into the game.)",
      "EditableFormat": "bbcode",
      "HTML": "Thanks for the pointers. I suppose I wasn't trying too hard to progress things as I was also busy making notes but I'll certainly give it another go with the hints you've given me.<br/><br/>(I didn't download the manual or read the walkthrough - bear in mind that those who play online won't either: perhaps you could upload it somewhere and include a link or command in the game to retrieve the manual? I'd certainly consider ways of incorporating it into the game.)",
      "PostDate": "2014-10-15T19:05:02+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30693",
      "UserId": 0,
      "Username": "Avantar",
      "UserAvatar": "7009_1418309433.jpg",
      "UserGravatar": "86de2b95c147252a1c38b8d3996da855",
      "EditableText": "No Worries... <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D --> \n\nI understand that people won't go and actively look for the manual. I have included the link in the comments of the online game - sadly not realy visible and I created a help file. So if you type 'help' it will show you stuff.\n\nI will much appreciate comment on the combat system (it is not perfect) but I would like o use it somewhere else and it is my own makeshift system with the help of Jaynabonne and HK.\n\n**Edit**\n\nForgot to mention: As soon as you get your first task, your journal will be updated and tasks will also be marked completed when done. You can also add notes to your journal.",
      "EditableFormat": "bbcode",
      "HTML": "No Worries... <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D --> <br/><br/>I understand that people won't go and actively look for the manual. I have included the link in the comments of the online game - sadly not realy visible and I created a help file. So if you type 'help' it will show you stuff.<br/><br/>I will much appreciate comment on the combat system (it is not perfect) but I would like o use it somewhere else and it is my own makeshift system with the help of Jaynabonne and HK.<br/><br/>**Edit**<br/><br/>Forgot to mention: As soon as you get your first task, your journal will be updated and tasks will also be marked completed when done. You can also add notes to your journal.",
      "PostDate": "2014-10-15T19:52:44+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30700",
      "UserId": 0,
      "Username": "Silver",
      "UserAvatar": null,
      "UserGravatar": "13024be5ccbb463906b024d5bd3cb5e8",
      "EditableText": "Looking forward to seeing all this working. Alas it'll be tomorrow now as I'm slowly chipping away at my own game (I've been working on it for two months - with typical distractions - and I'm still in the first room lol). It would be a shame for you to completely abandon it with that kind of work already having gone in it. It sounds like it has great depth on a programming level.",
      "EditableFormat": "bbcode",
      "HTML": "Looking forward to seeing all this working. Alas it'll be tomorrow now as I'm slowly chipping away at my own game (I've been working on it for two months - with typical distractions - and I'm still in the first room lol). It would be a shame for you to completely abandon it with that kind of work already having gone in it. It sounds like it has great depth on a programming level.",
      "PostDate": "2014-10-15T20:57:48+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30703",
      "UserId": 0,
      "Username": "Avantar",
      "UserAvatar": "7009_1418309433.jpg",
      "UserGravatar": "86de2b95c147252a1c38b8d3996da855",
      "EditableText": "There is no haste.\nI am looking forward to view your work too. Good luck with that.\n\nI might consider working on it still as a very long project - The version that is online is quite outdated and I have fixed quite a few things and added a few since - so I guess you'll find a few bugs. I have created the intro music myself and you might see the map I have made - not awesome, but I am quite proud of it.\nThe story will be quite a 'long' one and I am on the verge to put all the possible skills to the test and have made the tracking skill an active skill you can use.\n\nFor now, I am putting together all my knowledge gained from the making of Gothar's Hope into a new game that I can actually finish in reasonable time. It should be again be something unique that I haven't seen as a Quest game and for now will be a 1 to 2 player game that can easily be modified for more players. 4 would be my max. for the future.",
      "EditableFormat": "bbcode",
      "HTML": "There is no haste.<br/>I am looking forward to view your work too. Good luck with that.<br/><br/>I might consider working on it still as a very long project - The version that is online is quite outdated and I have fixed quite a few things and added a few since - so I guess you'll find a few bugs. I have created the intro music myself and you might see the map I have made - not awesome, but I am quite proud of it.<br/>The story will be quite a 'long' one and I am on the verge to put all the possible skills to the test and have made the tracking skill an active skill you can use.<br/><br/>For now, I am putting together all my knowledge gained from the making of Gothar's Hope into a new game that I can actually finish in reasonable time. It should be again be something unique that I haven't seen as a Quest game and for now will be a 1 to 2 player game that can easily be modified for more players. 4 would be my max. for the future.",
      "PostDate": "2014-10-15T22:25:12+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30706",
      "UserId": 0,
      "Username": "Silver",
      "UserAvatar": null,
      "UserGravatar": "13024be5ccbb463906b024d5bd3cb5e8",
      "EditableText": "Well there's a really good plus point: I almost mentioned about copyright as I assumed you'd snatched the intro music from elsewhere! My only criticism with the intro music is how it abruptly cuts out. That's a problem with the limited ways in which you can implement audio files with Quest though really, although it can be worked around. I'm currently discovering these things myself so not an expert on the matter though.",
      "EditableFormat": "bbcode",
      "HTML": "Well there's a really good plus point: I almost mentioned about copyright as I assumed you'd snatched the intro music from elsewhere! My only criticism with the intro music is how it abruptly cuts out. That's a problem with the limited ways in which you can implement audio files with Quest though really, although it can be worked around. I'm currently discovering these things myself so not an expert on the matter though.",
      "PostDate": "2014-10-15T22:52:09+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30710",
      "UserId": 0,
      "Username": "HegemonKhan",
      "UserAvatar": null,
      "UserGravatar": "a96cf34d8d97c57de38f54ee22b1759b",
      "EditableText": "no work goes to waste, copy and paste, hehe <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D -->\n\nyou developed a good section of part of a game, well you can copy that into your new game, and not have to re-craft it all over again!\n\nthough... you also got to be very organized too if you got tons of sources of game parts as files all over the place... HK looks away and whistles, innocently... with his own work on game making",
      "EditableFormat": "bbcode",
      "HTML": "no work goes to waste, copy and paste, hehe <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D --><br/><br/>you developed a good section of part of a game, well you can copy that into your new game, and not have to re-craft it all over again!<br/><br/>though... you also got to be very organized too if you got tons of sources of game parts as files all over the place... HK looks away and whistles, innocently... with his own work on game making",
      "PostDate": "2014-10-16T00:03:36+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30714",
      "UserId": 0,
      "Username": "Avantar",
      "UserAvatar": "7009_1418309433.jpg",
      "UserGravatar": "86de2b95c147252a1c38b8d3996da855",
      "EditableText": "@Silver - No doubt the intro can be better. I had the intro initially on a timer - but for some reason the timer did not work online.\n\n@HK - Don't I know it - By the third time I had to look for code, I pretty much got organized. Hence, the second project progressing much quicker! <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D -->",
      "EditableFormat": "bbcode",
      "HTML": "@Silver - No doubt the intro can be better. I had the intro initially on a timer - but for some reason the timer did not work online.<br/><br/>@HK - Don't I know it - By the third time I had to look for code, I pretty much got organized. Hence, the second project progressing much quicker! <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D -->",
      "PostDate": "2014-10-16T07:10:24+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30718",
      "UserId": 0,
      "Username": "Silver",
      "UserAvatar": null,
      "UserGravatar": "13024be5ccbb463906b024d5bd3cb5e8",
      "EditableText": "I think there was some problems with timers that have since been fixed in Quest 5.5.",
      "EditableFormat": "bbcode",
      "HTML": "I think there was some problems with timers that have since been fixed in Quest 5.5.",
      "PostDate": "2014-10-16T08:24:31+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30722",
      "UserId": 0,
      "Username": "Avantar",
      "UserAvatar": "7009_1418309433.jpg",
      "UserGravatar": "86de2b95c147252a1c38b8d3996da855",
      "EditableText": "Thanks Silver,\n\nWill check it out. I am still on 5.4 - maybe it is time....",
      "EditableFormat": "bbcode",
      "HTML": "Thanks Silver,<br/><br/>Will check it out. I am still on 5.4 - maybe it is time....",
      "PostDate": "2014-10-16T12:04:07+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30724",
      "UserId": 0,
      "Username": "Silver",
      "UserAvatar": null,
      "UserGravatar": "13024be5ccbb463906b024d5bd3cb5e8",
      "EditableText": "5.5.1 even. The latest version anyway. <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D -->\n\n<!-- m --><a class=\"postlink\" href=\"http://blog.textadventures.co.uk/2014/08/03/quest-5-5-1/\">http://blog.textadventures.co.uk/2014/0 ... est-5-5-1/</a><!-- m -->",
      "EditableFormat": "bbcode",
      "HTML": "5.5.1 even. The latest version anyway. <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D --><br/><br/><!-- m --><a class=\"postlink\" href=\"http://blog.textadventures.co.uk/2014/08/03/quest-5-5-1/\">http://blog.textadventures.co.uk/2014/0 ... est-5-5-1/</a><!-- m -->",
      "PostDate": "2014-10-16T12:07:43+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30787",
      "UserId": 0,
      "Username": "TextStories",
      "UserAvatar": null,
      "UserGravatar": "ec4fb09a0b797424dd59ffabd1a1b788",
      "EditableText": "I am not sure if this makes a difference, as in if you keep both your online and offline game pretty much the same and updated with any changes, although I played a bit of both.  Regardless and I hate to sound like a spelling or grammar Nazi, since I am by no means perfect... but you have a [b:3swat4ts][i:3swat4ts]lot[/i:3swat4ts][/b:3swat4ts] of mistakes from beginning to middle [end?].  I did not play the game all the way through, I only just got my butt handed to me by the trainer-\n\n-In the opening intro alone you have “theiy”\n\n-hammer's head and grip and... that is too many “ands”.  (Is that even a word...)  You could have changed it up a bit.  Don't worry, I suffer from that as well, that is why I proof read everything a half dozen times and even then miss something...\n\n-“warrior self” I think you meant “warrior [him]self”.\n\n-The spelling of Gotharian is a mistake.  (Not the -ian part, but the Goth, instead of Ghoth, since I see it spelled both ways...)\n\n-only family you ever known..  &lt;--- has two dots, not just one for a period and not three as a trail away sentence...\n\n-I find you do not put “'” in it's.  It looks like “its”, but maybe that was intentional depending on the context, I would really have to look at it again.\n\n-excistance should be existence.\n\n-allthough should be although.\n\n-“hight” should be “height”.\n\n-I do not know the character well enough to really judge him.  I mean I can understand he does not hear armor clanging or a sword/scabbard rubbing a wall, but he is speaking as if he can tell between height and weight from stride, etc.  Just a little too... Sherlock Holmian...\n\n- “wallnut” should be “walnut” I believe.\n\n- “david's cross” should be “David's Cross”.\n\n- “desturbing” should be “disturbing”.\n\n-You magically come out of your bed chambers to the North Corridor... I guess it could work, but since you were really only traveling three rooms I would assume the player could just walk it.\n\n-And these rooms in between are sparse, to the point of having nothing, not even a rug on the floor, paintings on the wall or chandeliers on the ceiling... someone else already mentioned that. \n\n-what is “equipr”?  Equip right-hand?\n\n-For attack bonuses... is that a “o” or a “0”  Looks like a rather small “o” to me.\n\n-“this past 17 years”, I think should be “these past 17 years”.\n\n-“quite manner” should be “quiet manner”.\n\n-Elder Kendrid “scratches” or “searches” his top drawer for coin or leather pouch?\n\n-”with some coin in” (it?).\n\n-What is a “leather-rain guard”?\n\n-A rope that is only 5 meters or 15 feet...  What are you going to do with that?  Tie someone up with maybe, but you certainly are not going to be able to use it to climb or lower yourself down with that tiny bit.\n\n-I also did not like you can only take five items from the chest.  You should have a limited inventory I agree, either through space/volume and or weight, but not by a chest rule.  I took all the little things first, not knowing I could only take five and was honestly going to take only one main weapon and the bow anyway, but I was already at my five and putting something back into the chest was not an option.  (Stupid 5 meter rope!)  Did it state I could only take five items from the start?  I must have missed it.\n\n-And in saying that, the map is taking way too much room, I am having problems with trying to scroll up and down.  I like a map function, but I prefer a smaller one.\n\n-“non other” or “none other”?\n\n-You can not identify quiver and arrows.  I was not so much worried about the quiver itself, but the arrows contained in them, unless I was doing something wrong.\n\nAnyway, that is what I found in the game without even looking for them.  I understand this is a demo and some of what I mentioned may be certain grammar or pronunciation preferences, but a lot were just mistakes.\n\nHowever, the game itself seems rather nice.  I do not see anything broken, but then again I did not really have the chance to test out all skills and functions.  I like the different weapons with not only complete descriptions, but also values. I was stuck with the dagger my first go around, but I will get the arming sword next time.  Too bad I could not get my Great Sword or my preference, a Bastard/Hand and a Half Sword... I prefer the name Bastard better though.  I guess the online version did not have music or sound, but they were not needed.  I also like the skill choosing and how this is all shaping up to be a good D&amp;D or some other type of RPG.  Provided there is depth to all the abilities/functions and you can clear up the major grammar/spelling mistakes, you could very well have a winner on your hands!  I look forward to more!",
      "EditableFormat": "bbcode",
      "HTML": "I am not sure if this makes a difference, as in if you keep both your online and offline game pretty much the same and updated with any changes, although I played a bit of both.  Regardless and I hate to sound like a spelling or grammar Nazi, since I am by no means perfect... but you have a <span style=\"font-weight:bold;\"><span style=\"font-style:italic;\">lot</span></span> of mistakes from beginning to middle [end?].  I did not play the game all the way through, I only just got my butt handed to me by the trainer-<br/><br/>-In the opening intro alone you have “theiy”<br/><br/>-hammer's head and grip and... that is too many “ands”.  (Is that even a word...)  You could have changed it up a bit.  Don't worry, I suffer from that as well, that is why I proof read everything a half dozen times and even then miss something...<br/><br/>-“warrior self” I think you meant “warrior [him]self”.<br/><br/>-The spelling of Gotharian is a mistake.  (Not the -ian part, but the Goth, instead of Ghoth, since I see it spelled both ways...)<br/><br/>-only family you ever known..  &lt;--- has two dots, not just one for a period and not three as a trail away sentence...<br/><br/>-I find you do not put “'” in it's.  It looks like “its”, but maybe that was intentional depending on the context, I would really have to look at it again.<br/><br/>-excistance should be existence.<br/><br/>-allthough should be although.<br/><br/>-“hight” should be “height”.<br/><br/>-I do not know the character well enough to really judge him.  I mean I can understand he does not hear armor clanging or a sword/scabbard rubbing a wall, but he is speaking as if he can tell between height and weight from stride, etc.  Just a little too... Sherlock Holmian...<br/><br/>- “wallnut” should be “walnut” I believe.<br/><br/>- “david's cross” should be “David's Cross”.<br/><br/>- “desturbing” should be “disturbing”.<br/><br/>-You magically come out of your bed chambers to the North Corridor... I guess it could work, but since you were really only traveling three rooms I would assume the player could just walk it.<br/><br/>-And these rooms in between are sparse, to the point of having nothing, not even a rug on the floor, paintings on the wall or chandeliers on the ceiling... someone else already mentioned that. <br/><br/>-what is “equipr”?  Equip right-hand?<br/><br/>-For attack bonuses... is that a “o” or a “0”  Looks like a rather small “o” to me.<br/><br/>-“this past 17 years”, I think should be “these past 17 years”.<br/><br/>-“quite manner” should be “quiet manner”.<br/><br/>-Elder Kendrid “scratches” or “searches” his top drawer for coin or leather pouch?<br/><br/>-”with some coin in” (it?).<br/><br/>-What is a “leather-rain guard”?<br/><br/>-A rope that is only 5 meters or 15 feet...  What are you going to do with that?  Tie someone up with maybe, but you certainly are not going to be able to use it to climb or lower yourself down with that tiny bit.<br/><br/>-I also did not like you can only take five items from the chest.  You should have a limited inventory I agree, either through space/volume and or weight, but not by a chest rule.  I took all the little things first, not knowing I could only take five and was honestly going to take only one main weapon and the bow anyway, but I was already at my five and putting something back into the chest was not an option.  (Stupid 5 meter rope!)  Did it state I could only take five items from the start?  I must have missed it.<br/><br/>-And in saying that, the map is taking way too much room, I am having problems with trying to scroll up and down.  I like a map function, but I prefer a smaller one.<br/><br/>-“non other” or “none other”?<br/><br/>-You can not identify quiver and arrows.  I was not so much worried about the quiver itself, but the arrows contained in them, unless I was doing something wrong.<br/><br/>Anyway, that is what I found in the game without even looking for them.  I understand this is a demo and some of what I mentioned may be certain grammar or pronunciation preferences, but a lot were just mistakes.<br/><br/>However, the game itself seems rather nice.  I do not see anything broken, but then again I did not really have the chance to test out all skills and functions.  I like the different weapons with not only complete descriptions, but also values. I was stuck with the dagger my first go around, but I will get the arming sword next time.  Too bad I could not get my Great Sword or my preference, a Bastard/Hand and a Half Sword... I prefer the name Bastard better though.  I guess the online version did not have music or sound, but they were not needed.  I also like the skill choosing and how this is all shaping up to be a good D&amp;D or some other type of RPG.  Provided there is depth to all the abilities/functions and you can clear up the major grammar/spelling mistakes, you could very well have a winner on your hands!  I look forward to more!",
      "PostDate": "2014-10-20T06:59:58+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30789",
      "UserId": 0,
      "Username": "Avantar",
      "UserAvatar": "7009_1418309433.jpg",
      "UserGravatar": "86de2b95c147252a1c38b8d3996da855",
      "EditableText": "Thank you so much!\n\nI thought grammar might be a problem - it is not my first language. So I am grateful for the help.\nMoving through the 3 rooms might be taken out - I guess it was a way for me to put you right in front of the door (since you should know where his chambers is - you have lived there for a long time!) without the player actively looking for it and get frustrated. - Easy enough to take it out I guess.\n\nIt does say that Elder Kendrid is willing to part with 5 items from the chest, just after he hands you the pouch of coins.:\n&quot;Elder Kendrid: Our funding is not what it used to be, but I have taken the liberty of gathering some equipment that might prove usefull. They are still in good condition. You will find it in the chest in the far corner.\nI am willing to part with any 5 items from the chest&quot;\n\nYou are also limited to volume and item count on your person.(You can therefore acquire/get a backpack of witch the first one is in your bedroom - yes it is there) There should be more descriptions of the actual room (not all of them yet) if you type in: 'Look at &quot;the room's name&quot;' like: look at bedroom \n\nThere are sounds (fighting/drawing and sheathing weapons, ect.) in my actual offline version. I took most of it out for the online one; since I had a lot of trouble with it.\n\nI know about the quiver as well as a lot of other bugs - this has been fixed in the offline version I have now, but it is just not working online for some reason.\n\nYes, you will use your skills and one of them will be an active skill.\n\n**Spoiler**\nThe first skill to be tested will be the Spotting Skill when leaving with Trembemere the next morning.\n\nYou can also look at Trembemere before you start talking to him. <!-- s:-) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":-)\" title=\"Smile\" /><!-- s:-) -->\nAt the moment he is a bit of a cheat (for testing purposes) - He adapts to your combat skill at the moment and the best way to beat him would be to sheath your weapons before entering the room and equip them during combat. (Might just give you the win)\n\nEquipr = Equip in right hand\nEquipl = Equip in left hand\nEquip (for two-handed weapons) = both hands\n\nI do have a manual in this thread that can be downloaded.(I had a look at it and it needs a bit of updating)\n\nThank you again - I appreciate it immensely for you taking the time.\n\n**Edit**\nI missed some questions:\n\nA rain guard - you can Google sword rain guard and view some pictures. It is not present on all swords, but it will cover a small part of the sword just after the cross-guard (Actually attached to the cross-guard) It is believed to keep the water out of the scabbard when it rains. Problem is - some of them are made of metal.\n\nI suppose I can make the rope longer. (5 meters might be a bit short)\n\n&quot;-For attack bonuses... is that a “o” or a “0” Looks like a rather small “o” to me.&quot;\nI will have a look, but the &quot;0&quot; is taken from the attribute of the weapon that is an integer. I have a function that is called to identify the weapons in order not to re-write it over and over. \nAlso why the quiver's identifying is not working; since it is not inheriting the weapon object I have created (For the current online version anyway)",
      "EditableFormat": "bbcode",
      "HTML": "Thank you so much!<br/><br/>I thought grammar might be a problem - it is not my first language. So I am grateful for the help.<br/>Moving through the 3 rooms might be taken out - I guess it was a way for me to put you right in front of the door (since you should know where his chambers is - you have lived there for a long time!) without the player actively looking for it and get frustrated. - Easy enough to take it out I guess.<br/><br/>It does say that Elder Kendrid is willing to part with 5 items from the chest, just after he hands you the pouch of coins.:<br/>&quot;Elder Kendrid: Our funding is not what it used to be, but I have taken the liberty of gathering some equipment that might prove usefull. They are still in good condition. You will find it in the chest in the far corner.<br/>I am willing to part with any 5 items from the chest&quot;<br/><br/>You are also limited to volume and item count on your person.(You can therefore acquire/get a backpack of witch the first one is in your bedroom - yes it is there) There should be more descriptions of the actual room (not all of them yet) if you type in: 'Look at &quot;the room's name&quot;' like: look at bedroom <br/><br/>There are sounds (fighting/drawing and sheathing weapons, ect.) in my actual offline version. I took most of it out for the online one; since I had a lot of trouble with it.<br/><br/>I know about the quiver as well as a lot of other bugs - this has been fixed in the offline version I have now, but it is just not working online for some reason.<br/><br/>Yes, you will use your skills and one of them will be an active skill.<br/><br/>**Spoiler**<br/>The first skill to be tested will be the Spotting Skill when leaving with Trembemere the next morning.<br/><br/>You can also look at Trembemere before you start talking to him. <!-- s:-) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":-)\" title=\"Smile\" /><!-- s:-) --><br/>At the moment he is a bit of a cheat (for testing purposes) - He adapts to your combat skill at the moment and the best way to beat him would be to sheath your weapons before entering the room and equip them during combat. (Might just give you the win)<br/><br/>Equipr = Equip in right hand<br/>Equipl = Equip in left hand<br/>Equip (for two-handed weapons) = both hands<br/><br/>I do have a manual in this thread that can be downloaded.(I had a look at it and it needs a bit of updating)<br/><br/>Thank you again - I appreciate it immensely for you taking the time.<br/><br/>**Edit**<br/>I missed some questions:<br/><br/>A rain guard - you can Google sword rain guard and view some pictures. It is not present on all swords, but it will cover a small part of the sword just after the cross-guard (Actually attached to the cross-guard) It is believed to keep the water out of the scabbard when it rains. Problem is - some of them are made of metal.<br/><br/>I suppose I can make the rope longer. (5 meters might be a bit short)<br/><br/>&quot;-For attack bonuses... is that a “o” or a “0” Looks like a rather small “o” to me.&quot;<br/>I will have a look, but the &quot;0&quot; is taken from the attribute of the weapon that is an integer. I have a function that is called to identify the weapons in order not to re-write it over and over. <br/>Also why the quiver's identifying is not working; since it is not inheriting the weapon object I have created (For the current online version anyway)",
      "PostDate": "2014-10-20T08:04:58+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30794",
      "UserId": 0,
      "Username": "TextStories",
      "UserAvatar": null,
      "UserGravatar": "ec4fb09a0b797424dd59ffabd1a1b788",
      "EditableText": "I did not want to point out if English was your first language or not, due to I did not want to make the situation any worse or make you feel awkward.  Some people can get rather upset about grammar and spelling corrections.  And be it far from me to think I am perfect, quite the contrary actually.  <!-- s:wink: --><img src=\"{SMILIES_PATH}/icon_wink.gif\" alt=\":wink:\" title=\"Wink\" /><!-- s:wink: -->  However, I do not do it in daily life or for regular forum posts, only in published works and I would rather it come from a good intentioned person, than just a jerk pointing out flaws.\n\nIn any case, if English is not your first language and those were all I have came across so far, you are doing quite well.  However, a spell checker would solve most of those spelling mistakes.  It wont catch correctly spelled words that are placed by mistake; such as “sea” and “see”, “through” and “threw”, “two”, “to and “too”, etc.  And to be honest, if it was not for spell check I would have quite a few misspellings and English is my first language.\n\nAnd as I said I must have missed the part of only being able to take five items.  I found text scrolling faster than I could read it.  I tried scrolling up, but found I could not always and I have a habit of forgetting to use Page Up and Page Down.\n\nMoving three rooms, especially after the reason you gave, does make sense.  But I thought perhaps I had done something wrong the first time or it was broken, so I had to restart the game again.  However, then I ask myself... why not have him jump to the trainer as well?  Then the game becomes less of an adventure and just a hand hold or a fancy Choose Your Own Adventure hybrid.\n\nAnd I am speaking more for objects in said rooms.  I would assume even a hallway would have a rug or cobbled stone floor.  The walls a smooth marble or tapestries hanging from them.  And the ceiling would have high arches or something else interesting, opposed to the generic descriptions.  But as I said, I can see you are putting a lot of effort into your game that gives it a much richer experience than many others for what you are doing, which is the combat and abilities.  Even my first game wont have a combat system, maybe a fledgling one if I decide to.  So I compensate by making it feel, or so I hope, to be a living breathing world.  Anyway, I look forward to more of your game, although I will be playing the online version for now.\n\nAlso I will have to look up the rain guard.  I would assume if the sword fit snuggly, rain could not get into the scabbord or the bottom of the scabbord itself would have a small drainage hole.  I had just always thought they would be fashioned so it would not just &quot;hold&quot; a liquid...  Then again I am not really sure how often it rained on the battle field to really be an issue.  If you are not fighting than the sword can be slung in a fashion to keep the rain out and if in a battle, your sword is out and you are swinging like a mad person and it really would not matter anyway.   <!-- s:lol: --><img src=\"{SMILIES_PATH}/icon_lol.gif\" alt=\":lol:\" title=\"Laughing\" /><!-- s:lol: -->",
      "EditableFormat": "bbcode",
      "HTML": "I did not want to point out if English was your first language or not, due to I did not want to make the situation any worse or make you feel awkward.  Some people can get rather upset about grammar and spelling corrections.  And be it far from me to think I am perfect, quite the contrary actually.  <!-- s:wink: --><img src=\"{SMILIES_PATH}/icon_wink.gif\" alt=\":wink:\" title=\"Wink\" /><!-- s:wink: -->  However, I do not do it in daily life or for regular forum posts, only in published works and I would rather it come from a good intentioned person, than just a jerk pointing out flaws.<br/><br/>In any case, if English is not your first language and those were all I have came across so far, you are doing quite well.  However, a spell checker would solve most of those spelling mistakes.  It wont catch correctly spelled words that are placed by mistake; such as “sea” and “see”, “through” and “threw”, “two”, “to and “too”, etc.  And to be honest, if it was not for spell check I would have quite a few misspellings and English is my first language.<br/><br/>And as I said I must have missed the part of only being able to take five items.  I found text scrolling faster than I could read it.  I tried scrolling up, but found I could not always and I have a habit of forgetting to use Page Up and Page Down.<br/><br/>Moving three rooms, especially after the reason you gave, does make sense.  But I thought perhaps I had done something wrong the first time or it was broken, so I had to restart the game again.  However, then I ask myself... why not have him jump to the trainer as well?  Then the game becomes less of an adventure and just a hand hold or a fancy Choose Your Own Adventure hybrid.<br/><br/>And I am speaking more for objects in said rooms.  I would assume even a hallway would have a rug or cobbled stone floor.  The walls a smooth marble or tapestries hanging from them.  And the ceiling would have high arches or something else interesting, opposed to the generic descriptions.  But as I said, I can see you are putting a lot of effort into your game that gives it a much richer experience than many others for what you are doing, which is the combat and abilities.  Even my first game wont have a combat system, maybe a fledgling one if I decide to.  So I compensate by making it feel, or so I hope, to be a living breathing world.  Anyway, I look forward to more of your game, although I will be playing the online version for now.<br/><br/>Also I will have to look up the rain guard.  I would assume if the sword fit snuggly, rain could not get into the scabbord or the bottom of the scabbord itself would have a small drainage hole.  I had just always thought they would be fashioned so it would not just &quot;hold&quot; a liquid...  Then again I am not really sure how often it rained on the battle field to really be an issue.  If you are not fighting than the sword can be slung in a fashion to keep the rain out and if in a battle, your sword is out and you are swinging like a mad person and it really would not matter anyway.   <!-- s:lol: --><img src=\"{SMILIES_PATH}/icon_lol.gif\" alt=\":lol:\" title=\"Laughing\" /><!-- s:lol: -->",
      "PostDate": "2014-10-20T09:29:08+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30796",
      "UserId": 0,
      "Username": "Avantar",
      "UserAvatar": "7009_1418309433.jpg",
      "UserGravatar": "86de2b95c147252a1c38b8d3996da855",
      "EditableText": "I do not mind anybody pointing to mistakes. That means that it can only be improved upon.\nSometimes you get so caught-up in writing the code that you forget about important stuff like spell check. To think - I have already corrected so many! lol \n\nSo here I am asking your opinion:\nYou see, I do have descriptions of rooms and then I have descriptions...\nHow it is now, when walking into a room the description is pretty general like this:\n&quot;You are in the West corridor.\nFurther to the North, you can see the entrance to the ensamble room. On both sides of the hallway there are multiple bedrooms, but they are all locked. To the South lies the entrance to the South corridor.&quot;\n\nbut if you actively look at the room and taking in more detail, it looks like this:\nlook at west corridor\nThe floor is made up of polished stone. It ultimately connects the North - and South corridor together. Beautiful pointed Gothic arches mark the major exits and are complimented with stone vaulting that reach high up. The arches are made up of light brown stone voussoirs with the keystone being white.\n\nSo both description are for the West Corridor. - You think I should change it?\n\nI wanted you to actively look at a given room - like studying it or just moving along through it without noticing the actual detail.\n\n**Edit**\nBtw: You are not the only one that has an issue with the 5 item limit from the chest. I want to give you a choice of what you would like to start with and think about it a bit. Giving everything at the start is not the idea. Else I will have to have them buy the equipment and only give them x amount of money or start you off with fixed equipment. The reason you cannot put an item back in the chest, is because you would be able to put anything in there (like your dagger) and take something else in its place. \nThe formula calculates the items left in the chest to determine the 5 items you took. (Taking an item reduces the amount of items that can be in the chest and therefore you can not put anything back - took me a bit of time to get this right and on purpose)",
      "EditableFormat": "bbcode",
      "HTML": "I do not mind anybody pointing to mistakes. That means that it can only be improved upon.<br/>Sometimes you get so caught-up in writing the code that you forget about important stuff like spell check. To think - I have already corrected so many! lol <br/><br/>So here I am asking your opinion:<br/>You see, I do have descriptions of rooms and then I have descriptions...<br/>How it is now, when walking into a room the description is pretty general like this:<br/>&quot;You are in the West corridor.<br/>Further to the North, you can see the entrance to the ensamble room. On both sides of the hallway there are multiple bedrooms, but they are all locked. To the South lies the entrance to the South corridor.&quot;<br/><br/>but if you actively look at the room and taking in more detail, it looks like this:<br/>look at west corridor<br/>The floor is made up of polished stone. It ultimately connects the North - and South corridor together. Beautiful pointed Gothic arches mark the major exits and are complimented with stone vaulting that reach high up. The arches are made up of light brown stone voussoirs with the keystone being white.<br/><br/>So both description are for the West Corridor. - You think I should change it?<br/><br/>I wanted you to actively look at a given room - like studying it or just moving along through it without noticing the actual detail.<br/><br/>**Edit**<br/>Btw: You are not the only one that has an issue with the 5 item limit from the chest. I want to give you a choice of what you would like to start with and think about it a bit. Giving everything at the start is not the idea. Else I will have to have them buy the equipment and only give them x amount of money or start you off with fixed equipment. The reason you cannot put an item back in the chest, is because you would be able to put anything in there (like your dagger) and take something else in its place. <br/>The formula calculates the items left in the chest to determine the 5 items you took. (Taking an item reduces the amount of items that can be in the chest and therefore you can not put anything back - took me a bit of time to get this right and on purpose)",
      "PostDate": "2014-10-20T10:07:07+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30798",
      "UserId": 0,
      "Username": "Pertex",
      "UserAvatar": "5940_1369854251.gif",
      "UserGravatar": "4cc1e52f99452e841ecf4cbee9eadde9",
      "EditableText": "[quote=&quot;Avantar&quot;:hjazkl2s]\nSo both description are for the West Corridor. - You think I should change it?\n[/quote:hjazkl2s]\nNo, if you like to torture your players <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D --> \nYou force the player to input an useless command more than needed.",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><cite>Avantar wrote:</cite><br/>So both description are for the West Corridor. - You think I should change it?<br/></blockquote><br/>No, if you like to torture your players <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D --> <br/>You force the player to input an useless command more than needed.",
      "PostDate": "2014-10-20T11:40:03+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30799",
      "UserId": 0,
      "Username": "Avantar",
      "UserAvatar": "7009_1418309433.jpg",
      "UserGravatar": "86de2b95c147252a1c38b8d3996da855",
      "EditableText": "That is all great and understandable - It will ease my workload considerably not having that feature.\n\nMy question:\nWhat if someone types 'x bedroom' ?\nTo me it is a perfect natural thing I would like to do in a room. Is this just me?\n\nLeaving it out and someone decides to examine a room, it will give: &quot;I can't see that' - I am not convinced that it is acceptable. You are in the room and yet you cannot see the room?\n\nIn this module you can examine rooms - but what more do you put from look to examine?",
      "EditableFormat": "bbcode",
      "HTML": "That is all great and understandable - It will ease my workload considerably not having that feature.<br/><br/>My question:<br/>What if someone types 'x bedroom' ?<br/>To me it is a perfect natural thing I would like to do in a room. Is this just me?<br/><br/>Leaving it out and someone decides to examine a room, it will give: &quot;I can't see that' - I am not convinced that it is acceptable. You are in the room and yet you cannot see the room?<br/><br/>In this module you can examine rooms - but what more do you put from look to examine?",
      "PostDate": "2014-10-20T12:31:45+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30800",
      "UserId": 0,
      "Username": "Pertex",
      "UserAvatar": "5940_1369854251.gif",
      "UserGravatar": "4cc1e52f99452e841ecf4cbee9eadde9",
      "EditableText": "When examining a room I would just display the room description:\n\n[code:3br29iv6]\nYou are in a room&#46;\nYou can go south&#46;\nThis is a wonderful room\n\n&gt; look\nYou are in a room&#46;\nYou can go south&#46;\nThis is a wonderful room&#46;\n\n&gt; x room\nThis is a wonderful room&#46;[/code:3br29iv6]",
      "EditableFormat": "bbcode",
      "HTML": "When examining a room I would just display the room description:<br/><br/><pre><code><br/>You are in a room&#46;<br/>You can go south&#46;<br/>This is a wonderful room<br/><br/>&gt; look<br/>You are in a room&#46;<br/>You can go south&#46;<br/>This is a wonderful room&#46;<br/><br/>&gt; x room<br/>This is a wonderful room&#46;</code></pre>",
      "PostDate": "2014-10-20T13:19:22+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30801",
      "UserId": 0,
      "Username": "Avantar",
      "UserAvatar": "7009_1418309433.jpg",
      "UserGravatar": "86de2b95c147252a1c38b8d3996da855",
      "EditableText": "Thank you for the suggestion, Pertex.",
      "EditableFormat": "bbcode",
      "HTML": "Thank you for the suggestion, Pertex.",
      "PostDate": "2014-10-20T13:28:37+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30812",
      "UserId": 0,
      "Username": "HegemonKhan",
      "UserAvatar": null,
      "UserGravatar": "a96cf34d8d97c57de38f54ee22b1759b",
      "EditableText": "[quote=&quot;Avantar&quot;:3t5kwgfq]**Edit**\nBtw: You are not the only one that has an issue with the 5 item limit from the chest. I want to give you a choice of what you would like to start with and think about it a bit. Giving everything at the start is not the idea. Else I will have to have them buy the equipment and only give them x amount of money or start you off with fixed equipment. The reason you cannot put an item back in the chest, is because you would be able to put anything in there (like your dagger) and take something else in its place. \nThe formula calculates the items left in the chest to determine the 5 items you took. (Taking an item reduces the amount of items that can be in the chest and therefore you can not put anything back - took me a bit of time to get this right and on purpose)[/quote:3t5kwgfq]\n\nYou can code in checks for which items are allowed to be put back into the chest (you still need your 5 item quantity and~or X weight Attribute and check), a few ways to do it:\n\n(do you know how to use Commands and~or Functions, with parameters? Object Types? Lists?)\n\n1. if (XXX.name_or_alias = &quot;name_of_your_chest_item_1&quot; or XXX.name_or_alias = &quot;name_of_your_chest_item_2&quot; or XXX.name_or_alias = &quot;name_of_your_chest_item_3&quot;) {\nmsg (&quot;This item can't be placed into the chest, only the original items within the chest, can be placed back into the chest.&quot;)\n} else if (not  XXX.name_or_alias = &quot;name_of_your_chest_item_1&quot; or not XXX.name_or_alias = &quot;name_of_your_chest_item_2&quot; or not XXX.name_or_alias = &quot;name_of_your_chest_item_3&quot;) {\nXXX.parent = chest_object\nmsg (&quot;You place the item back into the chest.&quot;)\n}\n\n// if you're using the ALIAS Attribute, then you need quotes upon your Value, but if you're using the NAME Attribute, then you need to have *NO* quotes on the Value.\n\n--------------\n\n// or, you could create your own custom String Attribute, checking for that, instead of the default ALIAS or NAME Strings, or instead of Object Types (see below).\n\n// or, you could create your own custom Boolean~Flag Attribute, checking for that, instead of the default ALIAS or NAME Strings, or instead of Object Types (see below).\n\n//or, you could even have a 'chest_item_stringlist' checking if your item matches up with an item in this string list\n\n------------\n\n2. putting~giving an Object Type on your items, then checking for if the item has that Object Type:\n\nif (HasAttribute (Object_name, Inherited_Object_Type_Attribute_name) = false) {\nmsg (&quot;This item can't be placed into the chest, only the original items within the chest, can be placed back into the chest.&quot;)\n} else if (HasAttribute (Object_name, Inherited_Object_Type_Attribute_name) = true) {\nXXX.parent = chest_object\nmsg (&quot;You place the item back into the chest.&quot;)\n}",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><cite>Avantar wrote:</cite>**Edit**<br/>Btw: You are not the only one that has an issue with the 5 item limit from the chest. I want to give you a choice of what you would like to start with and think about it a bit. Giving everything at the start is not the idea. Else I will have to have them buy the equipment and only give them x amount of money or start you off with fixed equipment. The reason you cannot put an item back in the chest, is because you would be able to put anything in there (like your dagger) and take something else in its place. <br/>The formula calculates the items left in the chest to determine the 5 items you took. (Taking an item reduces the amount of items that can be in the chest and therefore you can not put anything back - took me a bit of time to get this right and on purpose)</blockquote><br/><br/>You can code in checks for which items are allowed to be put back into the chest (you still need your 5 item quantity and~or X weight Attribute and check), a few ways to do it:<br/><br/>(do you know how to use Commands and~or Functions, with parameters? Object Types? Lists?)<br/><br/>1. if (XXX.name_or_alias = &quot;name_of_your_chest_item_1&quot; or XXX.name_or_alias = &quot;name_of_your_chest_item_2&quot; or XXX.name_or_alias = &quot;name_of_your_chest_item_3&quot;) {<br/>msg (&quot;This item can't be placed into the chest, only the original items within the chest, can be placed back into the chest.&quot;)<br/>} else if (not  XXX.name_or_alias = &quot;name_of_your_chest_item_1&quot; or not XXX.name_or_alias = &quot;name_of_your_chest_item_2&quot; or not XXX.name_or_alias = &quot;name_of_your_chest_item_3&quot;) {<br/>XXX.parent = chest_object<br/>msg (&quot;You place the item back into the chest.&quot;)<br/>}<br/><br/>// if you're using the ALIAS Attribute, then you need quotes upon your Value, but if you're using the NAME Attribute, then you need to have *NO* quotes on the Value.<br/><br/>--------------<br/><br/>// or, you could create your own custom String Attribute, checking for that, instead of the default ALIAS or NAME Strings, or instead of Object Types (see below).<br/><br/>// or, you could create your own custom Boolean~Flag Attribute, checking for that, instead of the default ALIAS or NAME Strings, or instead of Object Types (see below).<br/><br/>//or, you could even have a 'chest_item_stringlist' checking if your item matches up with an item in this string list<br/><br/>------------<br/><br/>2. putting~giving an Object Type on your items, then checking for if the item has that Object Type:<br/><br/>if (HasAttribute (Object_name, Inherited_Object_Type_Attribute_name) = false) {<br/>msg (&quot;This item can't be placed into the chest, only the original items within the chest, can be placed back into the chest.&quot;)<br/>} else if (HasAttribute (Object_name, Inherited_Object_Type_Attribute_name) = true) {<br/>XXX.parent = chest_object<br/>msg (&quot;You place the item back into the chest.&quot;)<br/>",
      "PostDate": "2014-10-21T02:58:24+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30813",
      "UserId": 0,
      "Username": "TextStories",
      "UserAvatar": null,
      "UserGravatar": "ec4fb09a0b797424dd59ffabd1a1b788",
      "EditableText": "[quote=&quot;Avantar&quot;:2nev30ur]So here I am asking your opinion:\nYou see, I do have descriptions of rooms and then I have descriptions...\nHow it is now, when walking into a room the description is pretty general like this:\n&quot;You are in the West corridor.\nFurther to the North, you can see the entrance to the ensamble room. On both sides of the hallway there are multiple bedrooms, but they are all locked. To the South lies the entrance to the South corridor.&quot;\n\nbut if you actively look at the room and taking in more detail, it looks like this:\nlook at west corridor\nThe floor is made up of polished stone. It ultimately connects the North - and South corridor together. Beautiful pointed Gothic arches mark the major exits and are complimented with stone vaulting that reach high up. The arches are made up of light brown stone voussoirs with the keystone being white.\n\nSo both description are for the West Corridor. - You think I should change it?\n\nI wanted you to actively look at a given room - like studying it or just moving along through it without noticing the actual detail.[/quote:2nev30ur]\n\nWell here is the tricky part, I use a lot of descriptions in my game.  But I have a reason for that as I already stated, not just because I am trying to over compensate, but for others as well...\n\nRegardless, if you want your game to feel rich and alive with the player to actually be in your world, you need to have a decent basic description and then also a more detailed description for when they want to examine a room and then key objects in said room.  There are multiple ways to go about this and multiple people will tell you any multitude of different things.\n\nHowever with this being a Text Adventure and there is nothing but “text”, you should, in my humble opinion, give text/descriptions where it is warranted and when the player might like to see it.  Other wise it will feel like you did not put much effort into the game, at least not where room descriptions are concerned.  I by far am no expert in TA and a rather new comer to the scene and for all intensive purposes I hate to read...,  (Don't ask me why I am here...) but when I am in it for a penny, I am in for a pound and I want to be able to “breath” your world.\n\nI believe it was Jay (Sorry if it was from someone else or if I am misquoting...) from another thread that mentioned that graphical games do not have these sort of problems with basic objects such as a tree, a wall or a blade of grass.  It is represented in pixels and that is the end of it.  We know what it is, we accept it and move on.  (Obviously there may be a switch on the wall or a hidden trap on the ground, but that is a whole other matter.)  But here in TA some people, if not most, will want to examine everything, even if in reality it means nothing, simply because they can.  Or because they are so used to the old formula in my opinion, that every game must be a puzzler and every room in that game must have a puzzle to discover or an item to solve one from another room.\n\nBut in reality, most rooms unless you are outdoors, in a cave or some where else that everything is the exact same, need to have their own items and descriptions.  Look at old castles for an example.  Most, at least the ones I have seen on TV or read about, have these marvelous rooms, each one like a world onto it's own.  Rarely did one room match another, unless they were a set of rooms, but you get my point.  The master bedroom would have certain lavish furniture apart from the rest of the bedrooms and obviously the castle.  the great dinning room would be much more ordained than the one the servants used, with the former having plush carpet, a wonderful chandelier above, fine china and silver, while the latter would have wooden bowls and utensils, with wobbly chairs perhaps.  The grand foyer would look completely different from the rest of the castle.  Even the bed of the master bedroom would look quite different from the bed of another slightly less important bedroom and the chain of differences would continue.  They would not all have the same exact paintings.  Not even a basic chair or sofa would most likely be the same from room to room.  It is all eye candy for the guests and to show off.  But again this all depends on the type of castle, the time period and what the owner of said castle had in terms of money or want.\n\nNow to answer your question, your first basic description is great.  It tells you exactly what the player “needs” to know.  However your second description is of more detail and great as well, but rarely do I ever “x room”.  I figured what ever the author wanted me to see in the first place was already there or at least that is how I am making my game...  which come to think of it perhaps I should change to save the player of unneeded text upfront...  Hmmm...  Seems when I am helping you, I am helping myself...\n\nBut anyway, I really like this a lot-\n\n“Beautiful pointed Gothic arches mark the major exits and are complimented with stone vaulting that reach high up. The arches are made up of light brown stone voussoirs with the keystone being white.”\n\nBut I think you could have saved the second half for a “x ceiling” or “x arches” description, since it goes into even more detail.\n\nSo it would look like this when you enter the room-\n\n&quot;You are in the West corridor.\nFurther to the North, you can see the entrance to the ensemble room. On both sides of the hallway there are multiple bedrooms, but they are all locked. To the South lies the entrance to the South corridor.&quot;\n\n---\n\nx room-\n\n“The floor is made up of polished stone. It ultimately connects the North - and South corridor together. Beautiful pointed Gothic arches mark the major exits and are complimented with stone vaulting that reach high up.”\n\n---\n\nx floor/x stone-\n\n“The stone is polished to a fine sheen, thanks to the many servants who daily clean these floors.\n\nx ceiling/x arches-\n\n“The arches are made up of light brown stone voussoirs with the keystone being white.”\n\n---\n\nYou have to draw the line some where, when descriptions no longer matter in a general room.  I think that would be it, unless you wanted to put emphasis on something as a puzzle item, like \n\nx white/x keystone-\n\n“But you notice a black stone out of place against the white...”\n\n\nThen it also depends on what kind of game do you want to make?  Maybe with it being more action oriented, you do not have time or really even need different descriptions for every room.  Even expensive store bought video games use stock tables, chairs, floors, etc.  But they usually change it up in each new area.  So say your game goes to another continent, even if you did not keep changing everything in every room, at least make the two continents drastically different for room descriptions.  Whether you go the extra mile and make each room feel unique is your decision, but totally different empires or lands would have different things.\n\nAnd I finally found when it tells you of only being able to take five items.  I had tried and retried about five times.  Why I kept missing it I am not sure.  The only thing I can think of is the different colored text and the dark blue made my eyes see that as important, while missing everything else as I was clicking continue.  I really have no idea. Still I like your game and the possibilities that can come about it.  Don't give up on it.  I am not sure how much these functions are actually functional, but once you have the basis down, all you have left to do is the story and adding the environment around it.",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><cite>Avantar wrote:</cite>So here I am asking your opinion:<br/>You see, I do have descriptions of rooms and then I have descriptions...<br/>How it is now, when walking into a room the description is pretty general like this:<br/>&quot;You are in the West corridor.<br/>Further to the North, you can see the entrance to the ensamble room. On both sides of the hallway there are multiple bedrooms, but they are all locked. To the South lies the entrance to the South corridor.&quot;<br/><br/>but if you actively look at the room and taking in more detail, it looks like this:<br/>look at west corridor<br/>The floor is made up of polished stone. It ultimately connects the North - and South corridor together. Beautiful pointed Gothic arches mark the major exits and are complimented with stone vaulting that reach high up. The arches are made up of light brown stone voussoirs with the keystone being white.<br/><br/>So both description are for the West Corridor. - You think I should change it?<br/><br/>I wanted you to actively look at a given room - like studying it or just moving along through it without noticing the actual detail.</blockquote><br/><br/>Well here is the tricky part, I use a lot of descriptions in my game.  But I have a reason for that as I already stated, not just because I am trying to over compensate, but for others as well...<br/><br/>Regardless, if you want your game to feel rich and alive with the player to actually be in your world, you need to have a decent basic description and then also a more detailed description for when they want to examine a room and then key objects in said room.  There are multiple ways to go about this and multiple people will tell you any multitude of different things.<br/><br/>However with this being a Text Adventure and there is nothing but “text”, you should, in my humble opinion, give text/descriptions where it is warranted and when the player might like to see it.  Other wise it will feel like you did not put much effort into the game, at least not where room descriptions are concerned.  I by far am no expert in TA and a rather new comer to the scene and for all intensive purposes I hate to read...,  (Don't ask me why I am here...) but when I am in it for a penny, I am in for a pound and I want to be able to “breath” your world.<br/><br/>I believe it was Jay (Sorry if it was from someone else or if I am misquoting...) from another thread that mentioned that graphical games do not have these sort of problems with basic objects such as a tree, a wall or a blade of grass.  It is represented in pixels and that is the end of it.  We know what it is, we accept it and move on.  (Obviously there may be a switch on the wall or a hidden trap on the ground, but that is a whole other matter.)  But here in TA some people, if not most, will want to examine everything, even if in reality it means nothing, simply because they can.  Or because they are so used to the old formula in my opinion, that every game must be a puzzler and every room in that game must have a puzzle to discover or an item to solve one from another room.<br/><br/>But in reality, most rooms unless you are outdoors, in a cave or some where else that everything is the exact same, need to have their own items and descriptions.  Look at old castles for an example.  Most, at least the ones I have seen on TV or read about, have these marvelous rooms, each one like a world onto it's own.  Rarely did one room match another, unless they were a set of rooms, but you get my point.  The master bedroom would have certain lavish furniture apart from the rest of the bedrooms and obviously the castle.  the great dinning room would be much more ordained than the one the servants used, with the former having plush carpet, a wonderful chandelier above, fine china and silver, while the latter would have wooden bowls and utensils, with wobbly chairs perhaps.  The grand foyer would look completely different from the rest of the castle.  Even the bed of the master bedroom would look quite different from the bed of another slightly less important bedroom and the chain of differences would continue.  They would not all have the same exact paintings.  Not even a basic chair or sofa would most likely be the same from room to room.  It is all eye candy for the guests and to show off.  But again this all depends on the type of castle, the time period and what the owner of said castle had in terms of money or want.<br/><br/>Now to answer your question, your first basic description is great.  It tells you exactly what the player “needs” to know.  However your second description is of more detail and great as well, but rarely do I ever “x room”.  I figured what ever the author wanted me to see in the first place was already there or at least that is how I am making my game...  which come to think of it perhaps I should change to save the player of unneeded text upfront...  Hmmm...  Seems when I am helping you, I am helping myself...<br/><br/>But anyway, I really like this a lot-<br/><br/>“Beautiful pointed Gothic arches mark the major exits and are complimented with stone vaulting that reach high up. The arches are made up of light brown stone voussoirs with the keystone being white.”<br/><br/>But I think you could have saved the second half for a “x ceiling” or “x arches” description, since it goes into even more detail.<br/><br/>So it would look like this when you enter the room-<br/><br/>&quot;You are in the West corridor.<br/>Further to the North, you can see the entrance to the ensemble room. On both sides of the hallway there are multiple bedrooms, but they are all locked. To the South lies the entrance to the South corridor.&quot;<br/><br/>---<br/><br/>x room-<br/><br/>“The floor is made up of polished stone. It ultimately connects the North - and South corridor together. Beautiful pointed Gothic arches mark the major exits and are complimented with stone vaulting that reach high up.”<br/><br/>---<br/><br/>x floor/x stone-<br/><br/>“The stone is polished to a fine sheen, thanks to the many servants who daily clean these floors.<br/><br/>x ceiling/x arches-<br/><br/>“The arches are made up of light brown stone voussoirs with the keystone being white.”<br/><br/>---<br/><br/>You have to draw the line some where, when descriptions no longer matter in a general room.  I think that would be it, unless you wanted to put emphasis on something as a puzzle item, like <br/><br/>x white/x keystone-<br/><br/>“But you notice a black stone out of place against the white...”<br/><br/><br/>Then it also depends on what kind of game do you want to make?  Maybe with it being more action oriented, you do not have time or really even need different descriptions for every room.  Even expensive store bought video games use stock tables, chairs, floors, etc.  But they usually change it up in each new area.  So say your game goes to another continent, even if you did not keep changing everything in every room, at least make the two continents drastically different for room descriptions.  Whether you go the extra mile and make each room feel unique is your decision, but totally different empires or lands would have different things.<br/><br/>And I finally found when it tells you of only being able to take five items.  I had tried and retried about five times.  Why I kept missing it I am not sure.  The only thing I can think of is the different colored text and the dark blue made my eyes see that as important, while missing everything else as I was clicking continue.  I really have no idea. Still I like your game and the possibilities that can come about it.  Don't give up on it.  I am not sure how much these functions are actually functional, but once you have the basis down, all you have left to do is the story and adding the environment around it.",
      "PostDate": "2014-10-21T07:51:57+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30815",
      "UserId": 0,
      "Username": "Silver",
      "UserAvatar": null,
      "UserGravatar": "13024be5ccbb463906b024d5bd3cb5e8",
      "EditableText": "you can have descriptions leading to descriptions. It all adds to the flavour.\n\n&gt;x wall\nThe cobbles have been crudely assembled, there is a crevice towards the bottom.\n\n&gt;x crevice\nyou push your hand in and feel around the damp hole and happen upon something warm and furry. you let out a scream as you feel sharp talons sinking into your finger.",
      "EditableFormat": "bbcode",
      "HTML": "you can have descriptions leading to descriptions. It all adds to the flavour.<br/><br/>&gt;x wall<br/>The cobbles have been crudely assembled, there is a crevice towards the bottom.<br/><br/>&gt;x crevice<br/>you push your hand in and feel around the damp hole and happen upon something warm and furry. you let out a scream as you feel sharp talons sinking into your finger.",
      "PostDate": "2014-10-21T09:57:33+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30816",
      "UserId": 0,
      "Username": "Avantar",
      "UserAvatar": "7009_1418309433.jpg",
      "UserGravatar": "86de2b95c147252a1c38b8d3996da855",
      "EditableText": "Thank you HK that will work great.\n\n@TextStories\n\nThen basically it is correct the way I have it except for adding x floor and x ceiling? (Pointing to West Corridor)\nGood pointers - especially the mention of generic items. It gave me some food for thought.\nIf I implement HK's script, the chest limit problem should be solved. Should have made that text blue perhaps. <!-- s:-) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":-)\" title=\"Smile\" /><!-- s:-) --> \n\n@Silver\nThank you for your input.\n\nScripting is all finished and done. Therefore all the aspects concerning the functions are included in the demo.\n\nWest Corridor is an example of x 'room name', Trembemere is an example of a friendly match.\nTalan pass will test you on your Skills and encounter possibility\nSearch functions for the Bedroom and Talan pass\nTalan Harbour  has the shop, archery target practice\nStormrider will have a mini gambling game, sleeping, merchant, choice that will change direction you will be heading, reflex testing, hiding, actual use of a bow.\n\nTherefore it is called a demo and it is not the full game as such. Descriptions can be added a bit later as I did as an example in this demo, but the questions I have with this module would be -\nHow do you find the combat system and what is broken in it?\nThe lantern you won't be able to test yet although the script is done for it.\nWhat do you think about the archery?\nWhat is the general feel about the storyline?\nHow did you find the mini game?\nAny issues with the shop or merchant?\nIs the journal working for you?\nHopefully it is noticed that your stats changes with different equipment/armor and more so if you do equip a weapon you are proficient in.\nFound any problems with the wrong stats added/subtracted? Keeping in mind that your stats does improve with +4 for just carrying a weapon, because you can fight with your fists at a disadvantage.\nAnyone tried fighting with their fists?\nIf you did move in that direction - how did the actual combat with the bow work for you? (Not the practice on archery targets)\nIs it a struggle to progress?\n\nPeople seem to think that because it is called a demo, it ends with 3 or 4 rooms and they do not move on or see the rest.\nThe above questions are the important need to know questions from my side that for some reason people did not get to see - why did they not get to see it? Is it too difficult? Does it not make sense? Is it too boring?\n\nIf people already struggle to progress and find it frustrating - is it worth continuing down that path?",
      "EditableFormat": "bbcode",
      "HTML": "Thank you HK that will work great.<br/><br/>@TextStories<br/><br/>Then basically it is correct the way I have it except for adding x floor and x ceiling? (Pointing to West Corridor)<br/>Good pointers - especially the mention of generic items. It gave me some food for thought.<br/>If I implement HK's script, the chest limit problem should be solved. Should have made that text blue perhaps. <!-- s:-) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":-)\" title=\"Smile\" /><!-- s:-) --> <br/><br/>@Silver<br/>Thank you for your input.<br/><br/>Scripting is all finished and done. Therefore all the aspects concerning the functions are included in the demo.<br/><br/>West Corridor is an example of x 'room name', Trembemere is an example of a friendly match.<br/>Talan pass will test you on your Skills and encounter possibility<br/>Search functions for the Bedroom and Talan pass<br/>Talan Harbour  has the shop, archery target practice<br/>Stormrider will have a mini gambling game, sleeping, merchant, choice that will change direction you will be heading, reflex testing, hiding, actual use of a bow.<br/><br/>Therefore it is called a demo and it is not the full game as such. Descriptions can be added a bit later as I did as an example in this demo, but the questions I have with this module would be -<br/>How do you find the combat system and what is broken in it?<br/>The lantern you won't be able to test yet although the script is done for it.<br/>What do you think about the archery?<br/>What is the general feel about the storyline?<br/>How did you find the mini game?<br/>Any issues with the shop or merchant?<br/>Is the journal working for you?<br/>Hopefully it is noticed that your stats changes with different equipment/armor and more so if you do equip a weapon you are proficient in.<br/>Found any problems with the wrong stats added/subtracted? Keeping in mind that your stats does improve with +4 for just carrying a weapon, because you can fight with your fists at a disadvantage.<br/>Anyone tried fighting with their fists?<br/>If you did move in that direction - how did the actual combat with the bow work for you? (Not the practice on archery targets)<br/>Is it a struggle to progress?<br/><br/>People seem to think that because it is called a demo, it ends with 3 or 4 rooms and they do not move on or see the rest.<br/>The above questions are the important need to know questions from my side that for some reason people did not get to see - why did they not get to see it? Is it too difficult? Does it not make sense? Is it too boring?<br/><br/>If people already struggle to progress and find it frustrating - is it worth continuing down that path?",
      "PostDate": "2014-10-21T11:11:35+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30818",
      "UserId": 0,
      "Username": "Silver",
      "UserAvatar": null,
      "UserGravatar": "13024be5ccbb463906b024d5bd3cb5e8",
      "EditableText": "If someone asks me to do an alpha test I'll prod it and poke it for obvious mistakes. What's the point in getting properly into it when it's just a demo in alpha? This is why I don't like demos really. You're investing time into something where you know there'll be no resolution.",
      "EditableFormat": "bbcode",
      "HTML": "If someone asks me to do an alpha test I'll prod it and poke it for obvious mistakes. What's the point in getting properly into it when it's just a demo in alpha? This is why I don't like demos really. You're investing time into something where you know there'll be no resolution.",
      "PostDate": "2014-10-21T12:19:53+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30819",
      "UserId": 0,
      "Username": "Avantar",
      "UserAvatar": "7009_1418309433.jpg",
      "UserGravatar": "86de2b95c147252a1c38b8d3996da855",
      "EditableText": "Good point.\n\nNothing wrong with that assumption.\nYet it is only a 5 minute play and let us forget then about testing anything - still it is not being played through and the burning question why? Apart from it saying demo. I have played many a module on here that was unfinished where I could give some pointers.\nSome of the top modules on here were a work in progress that got updated as they progressed.\n\nAll-in-all it matters not. I will publish a finished product hopefully soon.\n\nThank you for the honest input I have received.\n\n**Edit**\nA demo in Alpha - this has been more or less a year's work right there...",
      "EditableFormat": "bbcode",
      "HTML": "Good point.<br/><br/>Nothing wrong with that assumption.<br/>Yet it is only a 5 minute play and let us forget then about testing anything - still it is not being played through and the burning question why? Apart from it saying demo. I have played many a module on here that was unfinished where I could give some pointers.<br/>Some of the top modules on here were a work in progress that got updated as they progressed.<br/><br/>All-in-all it matters not. I will publish a finished product hopefully soon.<br/><br/>Thank you for the honest input I have received.<br/><br/>**Edit**<br/>A demo in Alpha - this has been more or less a year's work right there...",
      "PostDate": "2014-10-21T12:33:35+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30829",
      "UserId": 0,
      "Username": "TextStories",
      "UserAvatar": null,
      "UserGravatar": "ec4fb09a0b797424dd59ffabd1a1b788",
      "EditableText": "Personally you can test practically anything in my opinion, provided realistically there is a game &quot;to&quot; test or at least give us a warning this is a conversation or a combat demo only, etc. and you are not updating in teeny tiny little increments and then keep asking us to test your game.  What we say is broken should be fixed or 90% anyway, (Sometimes you can not figure something out as a whole and we understand that and usually someone with out even having to be asked will go out of their way to help fix it or show how to go about doing it or if all else fails, give suggestions to work around it.) before we have at the game again.\n\nAnd at least those who are commenting in here that I see mostly are regulars and they are helping not only others, but Quest in general and also most likely making their own games, not to include having a life and or real job of their own, so their time is most likely some what limited and precious to them.  I wish I could do more, but my laptop is flaking out on me, but online play oddly enough seems stable... but then I hate to read too... so you have to catch me when I have time and I am in the mood...  Sorry...  I always seem to have a headache... that's what she said anyway...   <!-- s:lol: --><img src=\"{SMILIES_PATH}/icon_lol.gif\" alt=\":lol:\" title=\"Laughing\" /><!-- s:lol: --> \n\nBut what I mean as broken is what's implemented, but clearly does not work.  That does not mean that every single thing we mentioned about the game in general you have to change.  Just because one person does not like your room descriptions, does not mean you have to bow down or even to a few.  However if the majority dislikes it, then you should probably do so.  Same with combat.  Just because someone does not like the system itself, does not mean it is broken or even bad, it is just not something they are accustomed to.  You should take each suggestion with a grain of salt and see what you can do to improve upon it.  As someone else said, make the game you want to play, but just be aware if you want others to enjoy it as well to listen to their feed back or try not to go against the grain so much.",
      "EditableFormat": "bbcode",
      "HTML": "Personally you can test practically anything in my opinion, provided realistically there is a game &quot;to&quot; test or at least give us a warning this is a conversation or a combat demo only, etc. and you are not updating in teeny tiny little increments and then keep asking us to test your game.  What we say is broken should be fixed or 90% anyway, (Sometimes you can not figure something out as a whole and we understand that and usually someone with out even having to be asked will go out of their way to help fix it or show how to go about doing it or if all else fails, give suggestions to work around it.) before we have at the game again.<br/><br/>And at least those who are commenting in here that I see mostly are regulars and they are helping not only others, but Quest in general and also most likely making their own games, not to include having a life and or real job of their own, so their time is most likely some what limited and precious to them.  I wish I could do more, but my laptop is flaking out on me, but online play oddly enough seems stable... but then I hate to read too... so you have to catch me when I have time and I am in the mood...  Sorry...  I always seem to have a headache... that's what she said anyway...   <!-- s:lol: --><img src=\"{SMILIES_PATH}/icon_lol.gif\" alt=\":lol:\" title=\"Laughing\" /><!-- s:lol: --> <br/><br/>But what I mean as broken is what's implemented, but clearly does not work.  That does not mean that every single thing we mentioned about the game in general you have to change.  Just because one person does not like your room descriptions, does not mean you have to bow down or even to a few.  However if the majority dislikes it, then you should probably do so.  Same with combat.  Just because someone does not like the system itself, does not mean it is broken or even bad, it is just not something they are accustomed to.  You should take each suggestion with a grain of salt and see what you can do to improve upon it.  As someone else said, make the game you want to play, but just be aware if you want others to enjoy it as well to listen to their feed back or try not to go against the grain so much.",
      "PostDate": "2014-10-22T08:23:59+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30832",
      "UserId": 0,
      "Username": "Avantar",
      "UserAvatar": "7009_1418309433.jpg",
      "UserGravatar": "86de2b95c147252a1c38b8d3996da855",
      "EditableText": "I gladly accept any critique and always make work of it...I would even welcome if it was said that it is the worst text adventure ever\nNot asking anyone to test it if they do want to and not pressuring anyone to do so either.\n\nFundamentally I just would have liked to know that if you did play it to say: (You need to actually have played the game)\nHey ,it sucked for these reasons or hey, I liked it for these...\n\nInitial thoughts was to finally bring out a game with a combat system, shopping, merchants and archery.\n\nDescriptions, spelling and grammar was on my fix list and much appreciated for that insight.\n\nBut saying that because something reads 'Demo' it will never realize (keeping in mind the story is written in book form of 500 pages [my own story], the scripting is all done, I have composed all the music files and tested the mechanics to boredom) I feel is an unfair comment and especially when you haven't even played the game. You should find that there is much more to the story and game with every intention of finishing it - should I find the means to get people to leave the monastery at least.   <!-- s:lol: --><img src=\"{SMILIES_PATH}/icon_lol.gif\" alt=\":lol:\" title=\"Laughing\" /><!-- s:lol: -->   (Hence my question around it.)\n\nThe only deciding factor in finishing it would be the audience and I feel I have giving Gothar a fair chance. (It was up for a long while)\nSilver offered to give it a review before I decide to can it. (He got stuck past the first door  <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D --> )\n\nSo for now Gothar's Hope is canned - no reason to waste time on something that won't be played. (It was really hard work scripting and testing all the functions and going forward there would have been a lot more to do.)\n\nOn the flip side - I am working on something else that is far less work and fresh. I am sure it will be done in a couple of months and hopefully less complicated <!-- s:wink: --><img src=\"{SMILIES_PATH}/icon_wink.gif\" alt=\":wink:\" title=\"Wink\" /><!-- s:wink: --> \n\nTo everyone: Silver, HK, TextStories and anyone else I have missed that gave suggestions - thank you kindly. I do appreciate your time and effort.",
      "EditableFormat": "bbcode",
      "HTML": "I gladly accept any critique and always make work of it...I would even welcome if it was said that it is the worst text adventure ever<br/>Not asking anyone to test it if they do want to and not pressuring anyone to do so either.<br/><br/>Fundamentally I just would have liked to know that if you did play it to say: (You need to actually have played the game)<br/>Hey ,it sucked for these reasons or hey, I liked it for these...<br/><br/>Initial thoughts was to finally bring out a game with a combat system, shopping, merchants and archery.<br/><br/>Descriptions, spelling and grammar was on my fix list and much appreciated for that insight.<br/><br/>But saying that because something reads 'Demo' it will never realize (keeping in mind the story is written in book form of 500 pages [my own story], the scripting is all done, I have composed all the music files and tested the mechanics to boredom) I feel is an unfair comment and especially when you haven't even played the game. You should find that there is much more to the story and game with every intention of finishing it - should I find the means to get people to leave the monastery at least.   <!-- s:lol: --><img src=\"{SMILIES_PATH}/icon_lol.gif\" alt=\":lol:\" title=\"Laughing\" /><!-- s:lol: -->   (Hence my question around it.)<br/><br/>The only deciding factor in finishing it would be the audience and I feel I have giving Gothar a fair chance. (It was up for a long while)<br/>Silver offered to give it a review before I decide to can it. (He got stuck past the first door  <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D --> )<br/><br/>So for now Gothar's Hope is canned - no reason to waste time on something that won't be played. (It was really hard work scripting and testing all the functions and going forward there would have been a lot more to do.)<br/><br/>On the flip side - I am working on something else that is far less work and fresh. I am sure it will be done in a couple of months and hopefully less complicated <!-- s:wink: --><img src=\"{SMILIES_PATH}/icon_wink.gif\" alt=\":wink:\" title=\"Wink\" /><!-- s:wink: --> <br/><br/>To everyone: Silver, HK, TextStories and anyone else I have missed that gave suggestions - thank you kindly. I do appreciate your time and effort.",
      "PostDate": "2014-10-22T13:42:05+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30842",
      "UserId": 0,
      "Username": "TextStories",
      "UserAvatar": null,
      "UserGravatar": "ec4fb09a0b797424dd59ffabd1a1b788",
      "EditableText": "I see you accept all criticisms very well.  When I test a game I always give criticism if needed and I always try to give some praise if I liked what was there, which I had done with yours.  What I was referring to with my last comment was not directed at you personally, (Although I kept using the word &quot;you&quot;...) but to other comments or those who may be in the same situation as you and are reading it.  We need to give encouragement to all authors big and small.  Your game itself, after playing it, I had very high hopes for and I am truly sad to see it go and am hoping at some point you will go back to it or at the very least include these same great features in a new game.  It is not every game... actually this is the first that I have seen in a TA, where there is an actual combat system, skills/functions and bartering, although in all honesty I had stopped playing right after being defeated by your trainer and you are automatically moved to the harbor or next town.  I think I saw a shop that you could actually buy your rope, but by that time it was late and I ended it.\n\n&quot;You&quot; as well as anyone else, have to realize that there are a lot of games, over a thousand five hundred at the present moment that people have to sort through.  On top of that there are only like five at the most forum goers who are consistently on.  The Pixie, Pertex, Silver, Jay and Kahn, (Sorry if I missed anyone.) not to mention Alex and I as of recent have tried to be a strong contributor.  I went back to your first few posts and I see where there was no comments for months or even a year.  Perhaps no one played your game or maybe they just did not feel like commenting.  Most people that come I am sure are either here to make their own game and thus do not bother with others or just play what ever they see first pop up.  I know it can be discouraging and I have had the same thing happen with me when I write or draw, hardly any comments, favs or likes, etc.  It sucks you spent all that time and effort and now feel you can not go on.\n\nAnyway, I truly hope this is not the last of Gothar's Hope.  I hope some day you will continue it or as I said before, at least add what features you had here to another game you are making.  Good luck.   <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D -->",
      "EditableFormat": "bbcode",
      "HTML": "I see you accept all criticisms very well.  When I test a game I always give criticism if needed and I always try to give some praise if I liked what was there, which I had done with yours.  What I was referring to with my last comment was not directed at you personally, (Although I kept using the word &quot;you&quot;...) but to other comments or those who may be in the same situation as you and are reading it.  We need to give encouragement to all authors big and small.  Your game itself, after playing it, I had very high hopes for and I am truly sad to see it go and am hoping at some point you will go back to it or at the very least include these same great features in a new game.  It is not every game... actually this is the first that I have seen in a TA, where there is an actual combat system, skills/functions and bartering, although in all honesty I had stopped playing right after being defeated by your trainer and you are automatically moved to the harbor or next town.  I think I saw a shop that you could actually buy your rope, but by that time it was late and I ended it.<br/><br/>&quot;You&quot; as well as anyone else, have to realize that there are a lot of games, over a thousand five hundred at the present moment that people have to sort through.  On top of that there are only like five at the most forum goers who are consistently on.  The Pixie, Pertex, Silver, Jay and Kahn, (Sorry if I missed anyone.) not to mention Alex and I as of recent have tried to be a strong contributor.  I went back to your first few posts and I see where there was no comments for months or even a year.  Perhaps no one played your game or maybe they just did not feel like commenting.  Most people that come I am sure are either here to make their own game and thus do not bother with others or just play what ever they see first pop up.  I know it can be discouraging and I have had the same thing happen with me when I write or draw, hardly any comments, favs or likes, etc.  It sucks you spent all that time and effort and now feel you can not go on.<br/><br/>Anyway, I truly hope this is not the last of Gothar's Hope.  I hope some day you will continue it or as I said before, at least add what features you had here to another game you are making.  Good luck.   <!-- s:D --><img src=\"{SMILIES_PATH}/icon_biggrin.gif\" alt=\":D\" title=\"Very Happy\" /><!-- s:D -->",
      "PostDate": "2014-10-22T21:13:22+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30844",
      "UserId": 0,
      "Username": "Avantar",
      "UserAvatar": "7009_1418309433.jpg",
      "UserGravatar": "86de2b95c147252a1c38b8d3996da855",
      "EditableText": "TextStories, your kind words means a lot to me.\n\n The Pixie, Pertex, Jaynabonne and HK helped me tremendously in  the past and did a lot of effort. I am so grateful and thankful for them. From knowing nothing to making my own libraries were all made possible by them and I feel like adding you to that list from a helpful and encouraging perspective.\n\n&quot;...trainer and you are automatically moved to the harbor or next town.&quot; - It is a pity the thief ambush encounter was skipped. <!-- s:( --><img src=\"{SMILIES_PATH}/icon_sad.gif\" alt=\":(\" title=\"Sad\" /><!-- s:( -->  (Just to clarify - this is no choice of your own - there is a 60% chance for you to encounter the thief ambush or just pass through Talan Pass without any event)\n\nI am indeed transferring what I have learned in Gothar to a new game, but there  is no room for adding all the features.\nIt will be a board game for 1 or 2 players at the moment. (Doing 4 players should be easy enough going forward)\nThe time factor to sift through stuff I can understand and appreciate. I do feel; however, that commenting on someone's work (good or bad) you should give it a play through at least.\n\nYour last post gives me hope for Gothar's Hope yet again. Your efforts has not gone unnoticed and I guess you were one of the few that at least tried some combat in Gothar's Hope.  Thanks for that.",
      "EditableFormat": "bbcode",
      "HTML": "TextStories, your kind words means a lot to me.<br/><br/> The Pixie, Pertex, Jaynabonne and HK helped me tremendously in  the past and did a lot of effort. I am so grateful and thankful for them. From knowing nothing to making my own libraries were all made possible by them and I feel like adding you to that list from a helpful and encouraging perspective.<br/><br/>&quot;...trainer and you are automatically moved to the harbor or next town.&quot; - It is a pity the thief ambush encounter was skipped. <!-- s:( --><img src=\"{SMILIES_PATH}/icon_sad.gif\" alt=\":(\" title=\"Sad\" /><!-- s:( -->  (Just to clarify - this is no choice of your own - there is a 60% chance for you to encounter the thief ambush or just pass through Talan Pass without any event)<br/><br/>I am indeed transferring what I have learned in Gothar to a new game, but there  is no room for adding all the features.<br/>It will be a board game for 1 or 2 players at the moment. (Doing 4 players should be easy enough going forward)<br/>The time factor to sift through stuff I can understand and appreciate. I do feel; however, that commenting on someone's work (good or bad) you should give it a play through at least.<br/><br/>Your last post gives me hope for Gothar's Hope yet again. Your efforts has not gone unnoticed and I guess you were one of the few that at least tried some combat in Gothar's Hope.  Thanks for that.",
      "PostDate": "2014-10-23T07:33:59+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30846",
      "UserId": 0,
      "Username": "TextStories",
      "UserAvatar": null,
      "UserGravatar": "ec4fb09a0b797424dd59ffabd1a1b788",
      "EditableText": "Well to be honest, I did play through your game, spending more time than you think...  Where do you think I got all those examples of mispellings?   <!-- s:wink: --><img src=\"{SMILIES_PATH}/icon_wink.gif\" alt=\":wink:\" title=\"Wink\" /><!-- s:wink: -->   Regardless, I may try it some more, but it will have to be the online verson.  And a shame I did miss that surprise encounter, but also a good thing.  That just means it is random and at least for that part, the game is not static and has surprises, even if you just told me about it.   <!-- s:lol: --><img src=\"{SMILIES_PATH}/icon_lol.gif\" alt=\":lol:\" title=\"Laughing\" /><!-- s:lol: --> \n\nHowever, you say this other game is going to be multiplayer?  Do you mean online or just you have to have all players gathered around on the same PC?  I would much prefer for the former, rather than the latter, although I am not sure how you could make it online.  There is a thread some where with ideas for online play, not sure how that will help you though.",
      "EditableFormat": "bbcode",
      "HTML": "Well to be honest, I did play through your game, spending more time than you think...  Where do you think I got all those examples of mispellings?   <!-- s:wink: --><img src=\"{SMILIES_PATH}/icon_wink.gif\" alt=\":wink:\" title=\"Wink\" /><!-- s:wink: -->   Regardless, I may try it some more, but it will have to be the online verson.  And a shame I did miss that surprise encounter, but also a good thing.  That just means it is random and at least for that part, the game is not static and has surprises, even if you just told me about it.   <!-- s:lol: --><img src=\"{SMILIES_PATH}/icon_lol.gif\" alt=\":lol:\" title=\"Laughing\" /><!-- s:lol: --> <br/><br/>However, you say this other game is going to be multiplayer?  Do you mean online or just you have to have all players gathered around on the same PC?  I would much prefer for the former, rather than the latter, although I am not sure how you could make it online.  There is a thread some where with ideas for online play, not sure how that will help you though.",
      "PostDate": "2014-10-23T08:23:56+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30847",
      "UserId": 0,
      "Username": "Avantar",
      "UserAvatar": "7009_1418309433.jpg",
      "UserGravatar": "86de2b95c147252a1c38b8d3996da855",
      "EditableText": "Online is way beyond me! <!-- s:lol: --><img src=\"{SMILIES_PATH}/icon_lol.gif\" alt=\":lol:\" title=\"Laughing\" /><!-- s:lol: -->  It took a looong time for the online library to finally be usable. **Edit** (Believe the library was created by Sora574 if I am correct. I should check it out sometime - it can not have been an easy task as all players activity basically needs to be 'cloned' to every other pc)\n\nThis will be a turn based game - I am not big on board games and struggle with examples - I guess like Monopoly. I guess you can TeamView to a friend and play. <!-- s:-) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":-)\" title=\"Smile\" /><!-- s:-) --> But sadly it will be on one PC.",
      "EditableFormat": "bbcode",
      "HTML": "Online is way beyond me! <!-- s:lol: --><img src=\"{SMILIES_PATH}/icon_lol.gif\" alt=\":lol:\" title=\"Laughing\" /><!-- s:lol: -->  It took a looong time for the online library to finally be usable. **Edit** (Believe the library was created by Sora574 if I am correct. I should check it out sometime - it can not have been an easy task as all players activity basically needs to be 'cloned' to every other pc)<br/><br/>This will be a turn based game - I am not big on board games and struggle with examples - I guess like Monopoly. I guess you can TeamView to a friend and play. <!-- s:-) --><img src=\"{SMILIES_PATH}/icon_smile.gif\" alt=\":-)\" title=\"Smile\" /><!-- s:-) --> But sadly it will be on one PC.",
      "PostDate": "2014-10-23T08:28:06+01:00",
      "LastEditDate": null
    },
    {
      "PostId": "30848",
      "UserId": 0,
      "Username": "Silver",
      "UserAvatar": null,
      "UserGravatar": "13024be5ccbb463906b024d5bd3cb5e8",
      "EditableText": "[quote=&quot;Avantar&quot;:1enxhusr]\nYour last post gives me hope for Gothar's Hope yet again.[/quote:1enxhusr]\n\nAvantar's Hope.",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><cite>Avantar wrote:</cite><br/>Your last post gives me hope for Gothar's Hope yet again.</blockquote><br/><br/>Avantar's Hope.",
      "PostDate": "2014-10-23T08:31:56+01:00",
      "LastEditDate": null
    }
  ]
}