{
  "Topic": {
    "TopicId": "5634",
    "ForumId": "5",
    "Title": "A Game About Depression, Anxiety and Suicide...",
    "LastUpdated": "2015-11-19T09:54:42+00:00",
    "ReplyCount": 3
  },
  "Posts": [
    {
      "PostId": "38743",
      "UserId": 0,
      "Username": "ViTwilight",
      "UserAvatar": null,
      "UserGravatar": "ced1941797af82cf3d402a221463390d",
      "EditableText": "[color=#BF0000:o3njk0he]Hello. So, for the majority of my life, I have suffered severely from depression and anxiety. I have also continuously struggled to portray what being depressed and anxious is like to those who love and care for me. That's why, for my very first game, I'd like to make an adventure that accurately expresses what it's like to live with these mental illnesses. \nThis game will feature one player. One room, that they are trapped in.\nIn the room, there will be a phone, a mirror a journal and a door.\nThe door leads outside, into the world, but the player can not go through it because it is far too dangerous.\nThe phone will ring, throughout the game. Sometimes, it will be a friendly, loving voice telling the player not to give up.\nOther times, it will be the negative, hateful voices that want nothing more than to keep the player in that room, trapped and ultimately, doomed to succumb to their suicidal thoughts.\nThe mirror will portray the player as a depressed anxiety ridden person sees themselves. \nThe end of the game will come when the player either A) overcomes their fears and inner demons, or B) commits suicide.\nMaybe, I can tie in some kind of puzzle? Like, during the day, the player will get the calls and when nightfall comes, their inner demons will materialize and the only way to fight them off is to use the loving words given to them by the friendly voices, implying that one way to help overcome your depression is to remember that there are people who care? I dont know, as the game and it's details are not completely worked out in my head.\nThe reason I'm writing and posting this is to ask the public: Does this sound like an interesting game? Would you play it? \nComments, suggestions, ideas are all welcome on this work in progress game. \nThank you.\nxoxo - ViTwilight[/color:o3njk0he]",
      "EditableFormat": "bbcode",
      "HTML": "<span style=\"color:#BF0000\">Hello. So, for the majority of my life, I have suffered severely from depression and anxiety. I have also continuously struggled to portray what being depressed and anxious is like to those who love and care for me. That's why, for my very first game, I'd like to make an adventure that accurately expresses what it's like to live with these mental illnesses. <br/>This game will feature one player. One room, that they are trapped in.<br/>In the room, there will be a phone, a mirror a journal and a door.<br/>The door leads outside, into the world, but the player can not go through it because it is far too dangerous.<br/>The phone will ring, throughout the game. Sometimes, it will be a friendly, loving voice telling the player not to give up.<br/>Other times, it will be the negative, hateful voices that want nothing more than to keep the player in that room, trapped and ultimately, doomed to succumb to their suicidal thoughts.<br/>The mirror will portray the player as a depressed anxiety ridden person sees themselves. <br/>The end of the game will come when the player either A) overcomes their fears and inner demons, or B) commits suicide.<br/>Maybe, I can tie in some kind of puzzle? Like, during the day, the player will get the calls and when nightfall comes, their inner demons will materialize and the only way to fight them off is to use the loving words given to them by the friendly voices, implying that one way to help overcome your depression is to remember that there are people who care? I dont know, as the game and it's details are not completely worked out in my head.<br/>The reason I'm writing and posting this is to ask the public: Does this sound like an interesting game? Would you play it? <br/>Comments, suggestions, ideas are all welcome on this work in progress game. <br/>Thank you.<br/>xoxo - ViTwilight</span>",
      "PostDate": "2015-11-18T09:43:48+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "38762",
      "UserId": 0,
      "Username": "jdpjdpjdp",
      "UserAvatar": null,
      "UserGravatar": "540c24bb58e5434b39c7bd72916f5510",
      "EditableText": "It depends on the execution, but it's certainly fertile creative ground if you have a clear idea in mind. As someone with similar struggles, I'd play it to see how you choose to carry the idea out.\n\nDon't feel like it has to have a puzzle element, though. If that fits your overall idea, fine, but don't force it in there. It's perfectly fine to just tell an interactive story, or create an experience, and not necessarily make it a &quot;game&quot; per se... and with a more serious tone, as this is bound to have, something with a more driven narrative and a more immersive experience can be even more effective.",
      "EditableFormat": "bbcode",
      "HTML": "It depends on the execution, but it's certainly fertile creative ground if you have a clear idea in mind. As someone with similar struggles, I'd play it to see how you choose to carry the idea out.<br/><br/>Don't feel like it has to have a puzzle element, though. If that fits your overall idea, fine, but don't force it in there. It's perfectly fine to just tell an interactive story, or create an experience, and not necessarily make it a &quot;game&quot; per se... and with a more serious tone, as this is bound to have, something with a more driven narrative and a more immersive experience can be even more effective.",
      "PostDate": "2015-11-19T04:49:04+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "38763",
      "UserId": 0,
      "Username": "Caelifer",
      "UserAvatar": "7976_1447907231.jpg",
      "UserGravatar": "58f1494a198679247c8ab614a434dedc",
      "EditableText": "Yes, that does seem like a good game to promote awareness and help people realize how depression really is like from a first person perspective.\n\nI have a friend who currently has mild depression and it's already taking a toll. I can't even imagine what a full-blown depression would be.\n\nThere's actually a game about depression that I played before. It's quite good and maybe you could get some more ideas on how you could go along with your game. Here it is:\n\nDepression Quest ([url:1nfkb18j]https&#58;//textadventures&#46;co&#46;uk/games/view/_ioz6gxhjuobkgbw6ujnxa/depression-quest[/url:1nfkb18j])",
      "EditableFormat": "bbcode",
      "HTML": "Yes, that does seem like a good game to promote awareness and help people realize how depression really is like from a first person perspective.<br/><br/>I have a friend who currently has mild depression and it's already taking a toll. I can't even imagine what a full-blown depression would be.<br/><br/>There's actually a game about depression that I played before. It's quite good and maybe you could get some more ideas on how you could go along with your game. Here it is:<br/><br/>Depression Quest (<a href=\"https&#58;//textadventures&#46;co&#46;uk/games/view/_ioz6gxhjuobkgbw6ujnxa/depression-quest\" rel=\"nofollow\">https&#58;//textadventures&#46;co&#46;uk/games/view/_ioz6gxhjuobkgbw6ujnxa/depression-quest</a>",
      "PostDate": "2015-11-19T05:41:20+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "38766",
      "UserId": 0,
      "Username": "ViTwilight",
      "UserAvatar": null,
      "UserGravatar": "ced1941797af82cf3d402a221463390d",
      "EditableText": "Thank you both for your input on this idea. I've uploaded a tester version of the game, just to make sure the slight progress i've made was actually running  in a cohesive manner lol it's a mess, but if either of you would like to see the shreds of the idea im going for, please do. I'm also considering making it a gamebook, as opposed to a text adventure(i did not previously know about the gamebook function...). so, i'm going to transfer all of the info from the text adventure file into a game book and see if it will all fit a bit better. \nIn the tester version i uploaded, theres a bunch of random photos i got off google search, just to figure out the process of adding in images and one photo(prompted when looking into the mirror) is original draft art done by myself, so you'll get  a better feel for what art style will be seen throughout the game. Thank you, again.\n-Vitwilight.",
      "EditableFormat": "bbcode",
      "HTML": "Thank you both for your input on this idea. I've uploaded a tester version of the game, just to make sure the slight progress i've made was actually running  in a cohesive manner lol it's a mess, but if either of you would like to see the shreds of the idea im going for, please do. I'm also considering making it a gamebook, as opposed to a text adventure(i did not previously know about the gamebook function...). so, i'm going to transfer all of the info from the text adventure file into a game book and see if it will all fit a bit better. <br/>In the tester version i uploaded, theres a bunch of random photos i got off google search, just to figure out the process of adding in images and one photo(prompted when looking into the mirror) is original draft art done by myself, so you'll get  a better feel for what art style will be seen throughout the game. Thank you, again.<br/>-Vitwilight.",
      "PostDate": "2015-11-19T09:54:42+00:00",
      "LastEditDate": null
    }
  ]
}
