{
  "Topic": {
    "TopicId": "1591",
    "ForumId": "5",
    "Title": "Something 'Bout A Hex",
    "LastUpdated": "2007-02-22T20:41:24+00:00",
    "ReplyCount": 22
  },
  "Posts": [
    {
      "PostId": "12525",
      "UserId": 0,
      "Username": "Alex",
      "UserAvatar": null,
      "UserGravatar": "188b72c5e13327f4fde3989dca7d7d53",
      "EditableText": "[b:fgm9n60n]Something 'Bout A Hex[/b:fgm9n60n] by Doug, at Paul Flum Games\n<!-- m --><a class=\"postlink\" href=\"http://www.axeuk.com/quest/games/hex.zip\">http://www.axeuk.com/quest/games/hex.zip</a><!-- m --> \n\n&quot;What if &quot;A&quot; doesn't necessarily go to &quot;B&quot;? Or even better, you discover &quot;B&quot;, then when &quot;A&quot; comes along you think, &quot;Now I get it!&quot;. I hope you enjoy this story, as you move back and forth through time to discover something about a hex.&quot; \n\nPlease post any reviews, comments, requests for help etc. to this thread.",
      "EditableFormat": "bbcode",
      "HTML": "<span style=\"font-weight:bold;\">Something 'Bout A Hex</span> by Doug, at Paul Flum Games<br/><!-- m --><a class=\"postlink\" href=\"http://www.axeuk.com/quest/games/hex.zip\">http://www.axeuk.com/quest/games/hex.zip</a><!-- m --> <br/><br/>&quot;What if &quot;A&quot; doesn't necessarily go to &quot;B&quot;? Or even better, you discover &quot;B&quot;, then when &quot;A&quot; comes along you think, &quot;Now I get it!&quot;. I hope you enjoy this story, as you move back and forth through time to discover something about a hex.&quot; <br/><br/>Please post any reviews, comments, requests for help etc. to this thread.",
      "PostDate": "2007-02-01T10:57:03+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12534",
      "UserId": 0,
      "Username": "shrimptrawler",
      "UserAvatar": null,
      "UserGravatar": "055dc4bdc5ccc87858f75066199eb164",
      "EditableText": "I hope everyone enjoys the game. It is my first game, and I'm very pleased with how it turned out. I really liked working with QDK 4.0 and look forward to writing more games in the future.\n\nIf you have any questions about the game or if you are looking for any hints, please comment and I will try to get back to you as soon as I can.\n\nThank You Alex, for your tech support, and to all of the Quest Community, enjoy the game!",
      "EditableFormat": "bbcode",
      "HTML": "I hope everyone enjoys the game. It is my first game, and I'm very pleased with how it turned out. I really liked working with QDK 4.0 and look forward to writing more games in the future.<br/><br/>If you have any questions about the game or if you are looking for any hints, please comment and I will try to get back to you as soon as I can.<br/><br/>Thank You Alex, for your tech support, and to all of the Quest Community, enjoy the game!",
      "PostDate": "2007-02-01T17:11:05+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12536",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "Has anyone else had problems getting the game to run? It crashed for me whenever I tried to play it.",
      "EditableFormat": "bbcode",
      "HTML": "Has anyone else had problems getting the game to run? It crashed for me whenever I tried to play it.",
      "PostDate": "2007-02-01T17:19:13+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12537",
      "UserId": 0,
      "Username": "shrimptrawler",
      "UserAvatar": null,
      "UserGravatar": "055dc4bdc5ccc87858f75066199eb164",
      "EditableText": "I started writing the game in QDK 3.53, then switched over to QDK 4.0 when it became available. One of the elements i removed from the 3.53 version was the &quot;EXAMINE&quot; verb.\n\nThe game will not work in Quest 3.53, you have to play it in Quest 4.0",
      "EditableFormat": "bbcode",
      "HTML": "I started writing the game in QDK 3.53, then switched over to QDK 4.0 when it became available. One of the elements i removed from the 3.53 version was the &quot;EXAMINE&quot; verb.<br/><br/>The game will not work in Quest 3.53, you have to play it in Quest 4.0",
      "PostDate": "2007-02-01T17:27:06+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12587",
      "UserId": 0,
      "Username": "steve the gaming guy",
      "UserAvatar": null,
      "UserGravatar": "6577a0affcb6ea711c75baf052ffd08a",
      "EditableText": "...that's what I discovered.  I have to take some back steps on the game that was 99.9% done and version 4.0 screwed it up.  lol",
      "EditableFormat": "bbcode",
      "HTML": "...that's what I discovered.  I have to take some back steps on the game that was 99.9% done and version 4.0 screwed it up.  lol",
      "PostDate": "2007-02-06T00:28:52+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12589",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "Has anyone played any of the recent games and got opinions on them? I've written reviews of them but they're not very positive reviews.",
      "EditableFormat": "bbcode",
      "HTML": "Has anyone played any of the recent games and got opinions on them? I've written reviews of them but they're not very positive reviews.",
      "PostDate": "2007-02-07T12:53:56+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12591",
      "UserId": 0,
      "Username": "Dr.Froth",
      "UserAvatar": null,
      "UserGravatar": "e87f2aa904ea379f7988d099701d6f04",
      "EditableText": "I have played them and I am afraid that I have not found them to be very complete.  I am disturbed by the lazy trend of the newer games to try and bypass typing in commands.  This makes the game world very hard to get into (if you are going to do something like this, make a point and click game with pictures...there are plenty of good programs to help you do this.)  The production screams &quot;I did the whole thing this weekend.&quot;  I am glad that people are using Quest to make games, but you really need to finish them before you put them out.  Here is handy guide for all you new folk to make sure your game will not be roasted upon its release:\n\n1.) Story, Story, Story.... this is interactive fiction right?  Give us a reason to play your game.  Strong charactors, conflict... anything that might trigger some kind of emotinal response in the player.\n\n2.) Interaction.... Make sure that the player can easily interact with the world.  In Quest you have to check two areas to really do it right.  Make sure that your scripts support both the typing in of commands as well as the drag and drop.  ONLY DOING ONE OF THESE THINGS SCREAMS LAZINESS.  Do not piss us off by making your game hard to play because we are the only ones the care enough to try it.\n\n3.)Describe....  Do not give a description that says:\n&quot;You are in a hallway. You can go north&quot;\nThat really sucks.  I would rather have skin grafts on my genitals than play a game where all the rooms had descriptions like that.  (on a side note, you can have a description like that on later visits to the same location as long as if the player types &quot;look&quot; he can get the longer one.)\n\n4.) If you describe &quot;it&quot; in the room, make sure you describe&quot;it&quot;...\nIf you mention a vase in the room description than that vase better be accesable by the player.  You can make it invisable and then fill out a bunch of commands to describe it (look,take, break).  Sure the vase is not important to your game and you are right to say that most people will not care enough to try to look at the vase.  But somebody might, and when they do they are going to curse your birth if they type &quot;look at vase&quot; and get &quot;what vase&quot; as a response.\n\n5.)Do not get in a hurry... Finish the game before you upload it.  Get it tested.  If it takes you a year...so be it.  If you spent less than a month on your game and it is more than two rooms you are probably screwing up somewhere....\n\nRemember!!!  DavidW is going to play your game and then he is going to write a long review telling us how bad it sucks and he is going to be ABSOLUTLY RIGHT... unless you make a good game.  (In which case davidw would more than likely give you a good review and then I gurentee that all of us would play THAT GAME).\n\nGood Luck and Have Fun,\nDr.Froth",
      "EditableFormat": "bbcode",
      "HTML": "I have played them and I am afraid that I have not found them to be very complete.  I am disturbed by the lazy trend of the newer games to try and bypass typing in commands.  This makes the game world very hard to get into (if you are going to do something like this, make a point and click game with pictures...there are plenty of good programs to help you do this.)  The production screams &quot;I did the whole thing this weekend.&quot;  I am glad that people are using Quest to make games, but you really need to finish them before you put them out.  Here is handy guide for all you new folk to make sure your game will not be roasted upon its release:<br/><br/>1.) Story, Story, Story.... this is interactive fiction right?  Give us a reason to play your game.  Strong charactors, conflict... anything that might trigger some kind of emotinal response in the player.<br/><br/>2.) Interaction.... Make sure that the player can easily interact with the world.  In Quest you have to check two areas to really do it right.  Make sure that your scripts support both the typing in of commands as well as the drag and drop.  ONLY DOING ONE OF THESE THINGS SCREAMS LAZINESS.  Do not piss us off by making your game hard to play because we are the only ones the care enough to try it.<br/><br/>3.)Describe....  Do not give a description that says:<br/>&quot;You are in a hallway. You can go north&quot;<br/>That really sucks.  I would rather have skin grafts on my genitals than play a game where all the rooms had descriptions like that.  (on a side note, you can have a description like that on later visits to the same location as long as if the player types &quot;look&quot; he can get the longer one.)<br/><br/>4.) If you describe &quot;it&quot; in the room, make sure you describe&quot;it&quot;...<br/>If you mention a vase in the room description than that vase better be accesable by the player.  You can make it invisable and then fill out a bunch of commands to describe it (look,take, break).  Sure the vase is not important to your game and you are right to say that most people will not care enough to try to look at the vase.  But somebody might, and when they do they are going to curse your birth if they type &quot;look at vase&quot; and get &quot;what vase&quot; as a response.<br/><br/>5.)Do not get in a hurry... Finish the game before you upload it.  Get it tested.  If it takes you a year...so be it.  If you spent less than a month on your game and it is more than two rooms you are probably screwing up somewhere....<br/><br/>Remember!!!  DavidW is going to play your game and then he is going to write a long review telling us how bad it sucks and he is going to be ABSOLUTLY RIGHT... unless you make a good game.  (In which case davidw would more than likely give you a good review and then I gurentee that all of us would play THAT GAME).<br/><br/>Good Luck and Have Fun,<br/>Dr.Froth",
      "PostDate": "2007-02-07T17:56:06+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12592",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "Every time there's a new batch of Quest games out, I decide to play them hoping that this time, maybe just maybe, someone has actually gone and made a genuine effort to write a decent game.\n\nAnd guess what? I always come away disappointed.\n\nWith perhaps two or three exceptions, every Quest game I've played has had the same failings: poor spelling, poor grammar, terrible quality of writing, huge amount of bugs, objects mentioned in room descriptions never being covered, rushed feel, no testing, etc, etc.\n\nSerious question: is there anyone currently using Quest who has a clue how to write a text adventure?\n\nIf so, please please write one. Show us what you're capable of. But fortheloveofGod stop uploading half-finished pieces of tripe and expecting people to say nice things about them. Not going to happen. So not going to happen.\n\nIn the meantime, every bad game is another nail in the coffin lid that is Quest's reputation. I half suspect that if the unthinkable happened and a great Quest game was written, no one would ever know because the amount of people willing to play it would be in single figures.",
      "EditableFormat": "bbcode",
      "HTML": "Every time there's a new batch of Quest games out, I decide to play them hoping that this time, maybe just maybe, someone has actually gone and made a genuine effort to write a decent game.<br/><br/>And guess what? I always come away disappointed.<br/><br/>With perhaps two or three exceptions, every Quest game I've played has had the same failings: poor spelling, poor grammar, terrible quality of writing, huge amount of bugs, objects mentioned in room descriptions never being covered, rushed feel, no testing, etc, etc.<br/><br/>Serious question: is there anyone currently using Quest who has a clue how to write a text adventure?<br/><br/>If so, please please write one. Show us what you're capable of. But fortheloveofGod stop uploading half-finished pieces of tripe and expecting people to say nice things about them. Not going to happen. So not going to happen.<br/><br/>In the meantime, every bad game is another nail in the coffin lid that is Quest's reputation. I half suspect that if the unthinkable happened and a great Quest game was written, no one would ever know because the amount of people willing to play it would be in single figures.",
      "PostDate": "2007-02-07T19:05:53+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12593",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "For what it's worth, here are my reviews. Sorry they're not very complimentary, but I'd be hard pressed to find a thing about any of the games that was actually worth complimenting.  <!-- s:cry: --><img src=\"{SMILIES_PATH}/icon_cry.gif\" alt=\":cry:\" title=\"Crying or Very Sad\" /><!-- s:cry: --> \n\n\nQuest 4 recently came out so when I saw a number of new games had been uploaded to the main site, I decided to try them out and see what the new version had to offer. Unfortunately, two of the games are written with the previous version of Quest so whatever jazzy new features version 4 brings with it won’t matter much to them. Oh well, I’d downloaded them so figured I might as well give them a bash and see what was what…\n\nThe first one I tried was Escape From The House which gave the indication from the very start of being just as bad as every other Quest game that I’d played. The introduction was:\n\nYou need to find a way out of this house\n\nHardly inspires you to play any further, does it? From there it went from bad to worse. The first location description is littered with spelling mistakes, grammatical errors and weird capitalisation. At the end of it, I'm advised\n\nThere exit Norh take you to the Small Hall\n\nAnd this is at the very start of the game where people are most likely to quit if they don’t see anything very favourable! Now I can understand being new to the scene and not really knowing what things are standard as far as text adventures are concerned, but even the newest newbie of them all should realise that terrible spelling at the very start of their game doesn’t give a good first impression.\n\nPlaying a little further, I noticed Escape From The House suffered from the usual array of faults which seem to blight almost every Quest game I've ever played. There's a desk with a drawer in it, but the OPEN command isn't recognised; another location has a lavish table that can’t be referred to as TABLE or LAVISH TABLE but only as DINING TABLE; many items mentioned in room descriptions can’t be examined and those that can have short, uninspiring descriptions often littered with spelling mistakes; there are items that should be readable but the READ command isn't understood… (1 out of 10)\n\nI went on to another game by the same author – Where’s Annabel? ¬– not really expecting much and, yes, not really getting much either.\n\nThis one had an introduction at least, though the author’s spelling and grammar haven't improved much since Escape From The House. Nor has his ability to know where capitals are and are not needed. And he’s still a long, long way from writing something even vaguely playable…\n\nQuest has the strange habit of displaying the items (both ones you can pick up and immovable ones) in bold type before the main body of the text in the room description, which is a bad idea to say the least and compounded here by the author then going on to repeat most of what you have already been told. So the first room description reads:\n\nYou are in the main Garden.\nThere is a closed Well, some Yellow Flowers, some White Flowers, some Red Flowers and some Blue Flowers here.\nYou can go west.\nYou are standing in a small garden.  There is a large well here and it is overgrown with colourful flowers\n\nAs I've already been told there's a well and some flowers here, is it really necessary to incorporate them into the room description as well?\n\nWhat age the game is in set I couldn’t say. At one time you are given gold coins, which led me to assume it was way back in the Dark Ages, but at the same time you're given a photograph so it’s clearly not a medieval game. Unfortunately the author doesn’t seem willing to elaborate on things. Then again, little about the game is clear. For a start: who is the player? The background to the game is that someone called Annabel has gone missing (this is detailed in the remarkably clumsy introduction) and you have to find her, yet whether you're a police officer, a freelance detective or something else altogether is never indicated. Part of me suspects even the author doesn’t know.\n\nI didn’t last long with Where’s Annabel? Mainly because it was just so bad I was on the verge of quitting before I’d even finished reading the introduction, but also because of the remarkably small amount of commands it understands and the frequent bugs. Not to mention some of the worst guess the verb problems I've ever come across. A good example of this would be:\n\nYou're given a photograph of Annabel. Now with a photograph, the logical thing to do would be to SHOW it to people, right? Ah, but the game doesn’t understand the SHOW command. It does understand GIVE funnily enough but won’t let me give it away because I need to keep hold of it. USE PHOTOGRAPH when speaking to an NPC called Baggie produces an unhelpful message that I can’t use it here. At this I got stumped and started typing in silly things just to see if I could hit upon the solution by sheer luck. And I did. The command required?\n\nUSE PHOTOGRAPH ON BAGGIE\n\nAh, of course. What an amazingly obvious command. USE PHOTOGRAPH ON BAGGIE is so much better than SHOW PHOTOGRAPH.\n\nOkay, enough with the sarcasm and enough with the game. Avoid this one like the stinker it is. (1 out of 10)\n\nSo onto the next one – Nami Adventure¬ – one of the first ever games written with Quest 4. As this was a brand new text adventure system, I wasn’t really sure what to expect other than it being an improved version of the old Quest. Improved? Well, in theory… \n\nAt first glance, the interface appears the same as the old version. The side panels are still in place (although why they're even there in the first place beats me as they add absolutely nothing to any of the Quest games I've played), the text entry line is still minimal and… that’s about it. Whatever other changes have taken place aren't immediately apparent, with the only obvious difference being that some of the buttons now have a nicer box around them than before.\n\nAs for the game…\n\nOh dear god.\n\nFor some reason that probably seemed like a good idea to the writer, but sure doesn’t to this poor player, the game clears the screen after every single command. Yes, every single one. So if you examine an item, the screen clears. If you try to open something, the screen clears. In fact, even if you make a typo, the screen clears just to tell you it doesn’t understand what you mean. Now while I quite like screen clearing for moving between locations – it keeps the interface looking nice and tidy – for every command it’s just the worst idea possible. Seriously. By the time I quit the game, and it wasn’t long believe me, over half the commands I’d typed were LOOK just so I could see where I was.\n\nUnfortunately, this made playing the game a real chore. Location descriptions are as painfully brief as they generally are in Quest games, usually a line or two at most, and Quest has still got the peculiar habit of preceding room descriptions with a list of the items that you can see in bold type. Funnily enough, one of these items is the player character, though why the writer felt the need to list the PC as one of the items in the room is beyond me.\n\nWhat bit I played of the game didn’t impress me one bit. Yet again, it seemed to be a Quest game written by someone without a clue what they were doing, hadn’t been tested, didn’t have any clear storyline and, burdened by the screen clearing after every command, was just more trouble than it was worth. (1 out of 10)\n\nI then moved on to the final game, Something ‘Bout A Hex, which certainly had a better blurb than the previous games but which crashed with an error message whenever I tried to play it. After some experimentation, it seems that this is another Quest 4 game but the error message never indicated this and so I’d blindly assumed it was still the older version. But I fired it up in the new Quest 4 and tried it. Hey presto! It worked!\n\nTo begin with, it didn’t seem too bad. The first location had an actual honest to god description which was more than a few lines long. It even listed a huge array of items. Wa-hey! Something to examine, I thought. Unfortunately not… as while there might be items listed in the room description, the writer hasn’t bothered providing descriptions for any that I could find. A sample from my transcript went:\n\n&gt; X MANTLE\nI CAN'T SEE THAT HERE.\n\n&gt; X PISTON\nI CAN'T SEE THAT HERE.\n\n&gt; X FISHTANK\nI CAN'T SEE THAT HERE.\n\n&gt; X FIREPLACE\nI CAN'T SEE THAT HERE.\n\n&gt; X DRIED ROSE\nI CAN'T SEE THAT HERE.\n\nEtc…\n\nIf one of those had been missed, I’d probably just chalk it down to simple carelessness and leave it at that. If two had been missed, I’d wonder if the writer needed to get himself a better set of testers. But with all of them missed… well, if this game even knows what a tester looks like, I’d be very surprised.\n\n(As a side note, Quest now has a transcript command. I figured this out pretty much hit and miss as it doesn’t detail it anywhere in the game and the WHAT’S NEW section under the HELP options button doesn’t work. On the down side, the transcript is a remarkably poor one as it doesn’t display any of the text generated by your commands, only the commands themselves, rendering its use as a transcript tool pretty much non-existent. You also don’t receive any confirmation when starting or stopping a transcript and no indication of where the file has been saved. You're not even able to name the transcript which is another failing.)\n\nLeaving the first location presented me with a slight problem: namely that I couldn’t return. The exit had, apparently, gone missing. Other locations presented other problems. One had a door which couldn’t be opened as the OPEN command wasn’t recognised (up to version 4 and Quest still doesn’t understand many of the basic IF commands that every other system has had for years); another had a desk which I needed to GO TO DESK before I could do anything with it (although even when standing right next to it I was told I CAN’T SEE THAT HERE when attempting to examine it). Many locations lacked anything more than a line telling you where you were and the exits, so any attempts at depth the game might have been going for were quickly lost.\n\nIn fact, there were so many things wrong with the game that I was itching to quit it before five minutes had even gone by. For a start, there's no storyline. The intro hints at something about time travel and a hex, which sounded vaguely interesting for a few moments, but the game begins with you pottering around your apartment and won’t let you leave because… well, it doesn’t say why. Most of the locations are sparsely implemented (and that’s being kind) with nothing at all to do in the majority of them. Interaction is mainly done via the side panels and involves you clicking one thing then another. Which is a pain. I’d quite like to see Quest lose the side panels altogether or for them to at least be a little more user friendly. Or for someone to write a Quest game that doesn’t require their use at all.\n\nIt might seem a little harsh to give yet another rating of 1 out of 10 for this, but there's nothing about it I could recommend so that’s the rating I'm going to give it. (1 out of 10)",
      "EditableFormat": "bbcode",
      "HTML": "For what it's worth, here are my reviews. Sorry they're not very complimentary, but I'd be hard pressed to find a thing about any of the games that was actually worth complimenting.  <!-- s:cry: --><img src=\"{SMILIES_PATH}/icon_cry.gif\" alt=\":cry:\" title=\"Crying or Very Sad\" /><!-- s:cry: --> <br/><br/><br/>Quest 4 recently came out so when I saw a number of new games had been uploaded to the main site, I decided to try them out and see what the new version had to offer. Unfortunately, two of the games are written with the previous version of Quest so whatever jazzy new features version 4 brings with it won’t matter much to them. Oh well, I’d downloaded them so figured I might as well give them a bash and see what was what…<br/><br/>The first one I tried was Escape From The House which gave the indication from the very start of being just as bad as every other Quest game that I’d played. The introduction was:<br/><br/>You need to find a way out of this house<br/><br/>Hardly inspires you to play any further, does it? From there it went from bad to worse. The first location description is littered with spelling mistakes, grammatical errors and weird capitalisation. At the end of it, I'm advised<br/><br/>There exit Norh take you to the Small Hall<br/><br/>And this is at the very start of the game where people are most likely to quit if they don’t see anything very favourable! Now I can understand being new to the scene and not really knowing what things are standard as far as text adventures are concerned, but even the newest newbie of them all should realise that terrible spelling at the very start of their game doesn’t give a good first impression.<br/><br/>Playing a little further, I noticed Escape From The House suffered from the usual array of faults which seem to blight almost every Quest game I've ever played. There's a desk with a drawer in it, but the OPEN command isn't recognised; another location has a lavish table that can’t be referred to as TABLE or LAVISH TABLE but only as DINING TABLE; many items mentioned in room descriptions can’t be examined and those that can have short, uninspiring descriptions often littered with spelling mistakes; there are items that should be readable but the READ command isn't understood… (1 out of 10)<br/><br/>I went on to another game by the same author – Where’s Annabel? ¬– not really expecting much and, yes, not really getting much either.<br/><br/>This one had an introduction at least, though the author’s spelling and grammar haven't improved much since Escape From The House. Nor has his ability to know where capitals are and are not needed. And he’s still a long, long way from writing something even vaguely playable…<br/><br/>Quest has the strange habit of displaying the items (both ones you can pick up and immovable ones) in bold type before the main body of the text in the room description, which is a bad idea to say the least and compounded here by the author then going on to repeat most of what you have already been told. So the first room description reads:<br/><br/>You are in the main Garden.<br/>There is a closed Well, some Yellow Flowers, some White Flowers, some Red Flowers and some Blue Flowers here.<br/>You can go west.<br/>You are standing in a small garden.  There is a large well here and it is overgrown with colourful flowers<br/><br/>As I've already been told there's a well and some flowers here, is it really necessary to incorporate them into the room description as well?<br/><br/>What age the game is in set I couldn’t say. At one time you are given gold coins, which led me to assume it was way back in the Dark Ages, but at the same time you're given a photograph so it’s clearly not a medieval game. Unfortunately the author doesn’t seem willing to elaborate on things. Then again, little about the game is clear. For a start: who is the player? The background to the game is that someone called Annabel has gone missing (this is detailed in the remarkably clumsy introduction) and you have to find her, yet whether you're a police officer, a freelance detective or something else altogether is never indicated. Part of me suspects even the author doesn’t know.<br/><br/>I didn’t last long with Where’s Annabel? Mainly because it was just so bad I was on the verge of quitting before I’d even finished reading the introduction, but also because of the remarkably small amount of commands it understands and the frequent bugs. Not to mention some of the worst guess the verb problems I've ever come across. A good example of this would be:<br/><br/>You're given a photograph of Annabel. Now with a photograph, the logical thing to do would be to SHOW it to people, right? Ah, but the game doesn’t understand the SHOW command. It does understand GIVE funnily enough but won’t let me give it away because I need to keep hold of it. USE PHOTOGRAPH when speaking to an NPC called Baggie produces an unhelpful message that I can’t use it here. At this I got stumped and started typing in silly things just to see if I could hit upon the solution by sheer luck. And I did. The command required?<br/><br/>USE PHOTOGRAPH ON BAGGIE<br/><br/>Ah, of course. What an amazingly obvious command. USE PHOTOGRAPH ON BAGGIE is so much better than SHOW PHOTOGRAPH.<br/><br/>Okay, enough with the sarcasm and enough with the game. Avoid this one like the stinker it is. (1 out of 10)<br/><br/>So onto the next one – Nami Adventure¬ – one of the first ever games written with Quest 4. As this was a brand new text adventure system, I wasn’t really sure what to expect other than it being an improved version of the old Quest. Improved? Well, in theory… <br/><br/>At first glance, the interface appears the same as the old version. The side panels are still in place (although why they're even there in the first place beats me as they add absolutely nothing to any of the Quest games I've played), the text entry line is still minimal and… that’s about it. Whatever other changes have taken place aren't immediately apparent, with the only obvious difference being that some of the buttons now have a nicer box around them than before.<br/><br/>As for the game…<br/><br/>Oh dear god.<br/><br/>For some reason that probably seemed like a good idea to the writer, but sure doesn’t to this poor player, the game clears the screen after every single command. Yes, every single one. So if you examine an item, the screen clears. If you try to open something, the screen clears. In fact, even if you make a typo, the screen clears just to tell you it doesn’t understand what you mean. Now while I quite like screen clearing for moving between locations – it keeps the interface looking nice and tidy – for every command it’s just the worst idea possible. Seriously. By the time I quit the game, and it wasn’t long believe me, over half the commands I’d typed were LOOK just so I could see where I was.<br/><br/>Unfortunately, this made playing the game a real chore. Location descriptions are as painfully brief as they generally are in Quest games, usually a line or two at most, and Quest has still got the peculiar habit of preceding room descriptions with a list of the items that you can see in bold type. Funnily enough, one of these items is the player character, though why the writer felt the need to list the PC as one of the items in the room is beyond me.<br/><br/>What bit I played of the game didn’t impress me one bit. Yet again, it seemed to be a Quest game written by someone without a clue what they were doing, hadn’t been tested, didn’t have any clear storyline and, burdened by the screen clearing after every command, was just more trouble than it was worth. (1 out of 10)<br/><br/>I then moved on to the final game, Something ‘Bout A Hex, which certainly had a better blurb than the previous games but which crashed with an error message whenever I tried to play it. After some experimentation, it seems that this is another Quest 4 game but the error message never indicated this and so I’d blindly assumed it was still the older version. But I fired it up in the new Quest 4 and tried it. Hey presto! It worked!<br/><br/>To begin with, it didn’t seem too bad. The first location had an actual honest to god description which was more than a few lines long. It even listed a huge array of items. Wa-hey! Something to examine, I thought. Unfortunately not… as while there might be items listed in the room description, the writer hasn’t bothered providing descriptions for any that I could find. A sample from my transcript went:<br/><br/>&gt; X MANTLE<br/>I CAN'T SEE THAT HERE.<br/><br/>&gt; X PISTON<br/>I CAN'T SEE THAT HERE.<br/><br/>&gt; X FISHTANK<br/>I CAN'T SEE THAT HERE.<br/><br/>&gt; X FIREPLACE<br/>I CAN'T SEE THAT HERE.<br/><br/>&gt; X DRIED ROSE<br/>I CAN'T SEE THAT HERE.<br/><br/>Etc…<br/><br/>If one of those had been missed, I’d probably just chalk it down to simple carelessness and leave it at that. If two had been missed, I’d wonder if the writer needed to get himself a better set of testers. But with all of them missed… well, if this game even knows what a tester looks like, I’d be very surprised.<br/><br/>(As a side note, Quest now has a transcript command. I figured this out pretty much hit and miss as it doesn’t detail it anywhere in the game and the WHAT’S NEW section under the HELP options button doesn’t work. On the down side, the transcript is a remarkably poor one as it doesn’t display any of the text generated by your commands, only the commands themselves, rendering its use as a transcript tool pretty much non-existent. You also don’t receive any confirmation when starting or stopping a transcript and no indication of where the file has been saved. You're not even able to name the transcript which is another failing.)<br/><br/>Leaving the first location presented me with a slight problem: namely that I couldn’t return. The exit had, apparently, gone missing. Other locations presented other problems. One had a door which couldn’t be opened as the OPEN command wasn’t recognised (up to version 4 and Quest still doesn’t understand many of the basic IF commands that every other system has had for years); another had a desk which I needed to GO TO DESK before I could do anything with it (although even when standing right next to it I was told I CAN’T SEE THAT HERE when attempting to examine it). Many locations lacked anything more than a line telling you where you were and the exits, so any attempts at depth the game might have been going for were quickly lost.<br/><br/>In fact, there were so many things wrong with the game that I was itching to quit it before five minutes had even gone by. For a start, there's no storyline. The intro hints at something about time travel and a hex, which sounded vaguely interesting for a few moments, but the game begins with you pottering around your apartment and won’t let you leave because… well, it doesn’t say why. Most of the locations are sparsely implemented (and that’s being kind) with nothing at all to do in the majority of them. Interaction is mainly done via the side panels and involves you clicking one thing then another. Which is a pain. I’d quite like to see Quest lose the side panels altogether or for them to at least be a little more user friendly. Or for someone to write a Quest game that doesn’t require their use at all.<br/><br/>It might seem a little harsh to give yet another rating of 1 out of 10 for this, but there's nothing about it I could recommend so that’s the rating I'm going to give it. (1 out of 10)",
      "PostDate": "2007-02-07T19:07:24+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12594",
      "UserId": 0,
      "Username": "Freak",
      "UserAvatar": null,
      "UserGravatar": "325ed9ac125e00c9937be0d3aea0916d",
      "EditableText": "Expectations vary.  With a Scott Adams game, I generally don't expect any item to be implemented unless it's listed separately; with Quest, I generally expect interactions to be done with take / drop / give / use / speak to, and only on items listed in the sidebar, unless I have good reason to believe otherwise.\n\n(If that expectation is broken at some point, say by requiring interaction with an object not listed or some unusual verb, then my standards will quickly change unless given good reason not to.",
      "EditableFormat": "bbcode",
      "HTML": "Expectations vary.  With a Scott Adams game, I generally don't expect any item to be implemented unless it's listed separately; with Quest, I generally expect interactions to be done with take / drop / give / use / speak to, and only on items listed in the sidebar, unless I have good reason to believe otherwise.<br/><br/>(If that expectation is broken at some point, say by requiring interaction with an object not listed or some unusual verb, then my standards will quickly change unless given good reason not to.",
      "PostDate": "2007-02-07T19:30:39+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12595",
      "UserId": 0,
      "Username": "Alex",
      "UserAvatar": null,
      "UserGravatar": "188b72c5e13327f4fde3989dca7d7d53",
      "EditableText": "[quote:1xr4ewyg]\n(As a side note, Quest now has a transcript command. I figured this out pretty much hit and miss as it doesn’t detail it anywhere in the game and the WHAT’S NEW section under the HELP options button doesn’t work. On the down side, the transcript is a remarkably poor one as it doesn’t display any of the text generated by your commands, only the commands themselves, rendering its use as a transcript tool pretty much non-existent. You also don’t receive any confirmation when starting or stopping a transcript and no indication of where the file has been saved. You're not even able to name the transcript which is another failing.) \n[/quote:1xr4ewyg]\n\nTranscripts are a debug feature for game authors, rather than game players really. The information about them is here: <!-- m --><a class=\"postlink\" href=\"http://www.axeuk.com/quest/developer/documentation/debugging.htm\">http://www.axeuk.com/quest/developer/do ... ugging.htm</a><!-- m -->\n\nI don't know why your &quot;What's New&quot; link isn't working - it should open VERSIONS.TXT in your Program Files\\Quest folder. You may want to check if it's been moved or deleted somehow.\n\nIf you want to output [i:1xr4ewyg]all[/i:1xr4ewyg] text to a file, go to the Quest Options screen before starting a game, click the Logging tab and enable the &quot;Output all game text to a file&quot; option.\n\n[quote:1xr4ewyg]\nOne had a door which couldn’t be opened as the OPEN command wasn’t recognised (up to version 4 and Quest still doesn’t understand many of the basic IF commands that every other system has had for years); \n[/quote:1xr4ewyg]\n\nWhen you create a game in QDK 4.0, it will by default include the &quot;additional verbs&quot; library, which means Quest should give a sensible response to commands which are not implemented. It seems this particular game doesn't use that library though - that's up to the author to turn it off.\n\n&quot;Open&quot; is understood by Quest 4.0 as part of the container implementation - there's clearly something wrong with the game if it's not understood (maybe the author over-rode it with a verb - in which case they would have seen a warning).\n\n[quote:1xr4ewyg]\nI’d quite like to see Quest lose the side panels altogether or for them to at least be a little more user friendly. Or for someone to write a Quest game that doesn’t require their use at all. \n[/quote:1xr4ewyg]\n\nYou can turn them off by pressing the toggle button. And a game author can turn them off or disable them if they wish. A lot of people like them anyway. How do you think they could be made more user friendly?",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><p><br/>(As a side note, Quest now has a transcript command. I figured this out pretty much hit and miss as it doesn’t detail it anywhere in the game and the WHAT’S NEW section under the HELP options button doesn’t work. On the down side, the transcript is a remarkably poor one as it doesn’t display any of the text generated by your commands, only the commands themselves, rendering its use as a transcript tool pretty much non-existent. You also don’t receive any confirmation when starting or stopping a transcript and no indication of where the file has been saved. You're not even able to name the transcript which is another failing.) <br/></p></blockquote><br/><br/>Transcripts are a debug feature for game authors, rather than game players really. The information about them is here: <!-- m --><a class=\"postlink\" href=\"http://www.axeuk.com/quest/developer/documentation/debugging.htm\">http://www.axeuk.com/quest/developer/do ... ugging.htm</a><!-- m --><br/><br/>I don't know why your &quot;What's New&quot; link isn't working - it should open VERSIONS.TXT in your Program Files\\Quest folder. You may want to check if it's been moved or deleted somehow.<br/><br/>If you want to output <span style=\"font-style:italic;\">all</span> text to a file, go to the Quest Options screen before starting a game, click the Logging tab and enable the &quot;Output all game text to a file&quot; option.<br/><br/><blockquote><p><br/>One had a door which couldn’t be opened as the OPEN command wasn’t recognised (up to version 4 and Quest still doesn’t understand many of the basic IF commands that every other system has had for years); <br/></p></blockquote><br/><br/>When you create a game in QDK 4.0, it will by default include the &quot;additional verbs&quot; library, which means Quest should give a sensible response to commands which are not implemented. It seems this particular game doesn't use that library though - that's up to the author to turn it off.<br/><br/>&quot;Open&quot; is understood by Quest 4.0 as part of the container implementation - there's clearly something wrong with the game if it's not understood (maybe the author over-rode it with a verb - in which case they would have seen a warning).<br/><br/><blockquote><p><br/>I’d quite like to see Quest lose the side panels altogether or for them to at least be a little more user friendly. Or for someone to write a Quest game that doesn’t require their use at all. <br/></p></blockquote><br/><br/>You can turn them off by pressing the toggle button. And a game author can turn them off or disable them if they wish. A lot of people like them anyway. How do you think they could be made more user friendly?",
      "PostDate": "2007-02-07T22:19:28+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12596",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "[quote:24y993oe]Transcripts are a debug feature for game authors, rather than game players really. The information about them is here: <!-- m --><a class=\"postlink\" href=\"http://www.axeuk.com/quest/developer/documentation/debugging.htm\">http://www.axeuk.com/quest/developer/do ... ugging.htm</a><!-- m -->[/quote:24y993oe]\n\nFair enough, but shouldn’t it say this in the game somewhere? I doubt most of the people playing the game would be familiar with the above link. I know I wasn’t.\n\n[quote:24y993oe]I don't know why your &quot;What's New&quot; link isn't working - it should open VERSIONS.TXT in your Program Files\\Quest folder. You may want to check if it's been moved or deleted somehow.[/quote:24y993oe]\n\nVERSIONS.TXT is there but the link didn’t open this up. Nothing happened at all.\n\n[quote:24y993oe]If you want to output [i:24y993oe]all[/i:24y993oe] text to a file, go to the Quest Options screen before starting a game, click the Logging tab and enable the &quot;Output all game text to a file&quot; option.[/quote:24y993oe]\n\nThere's probably a perfectly good reason for doing it that way, but wouldn’t it make more sense to have this as the default action? Having it default to just listing the entered commands isn't much use to anyone.\n\n[quote:24y993oe]When you create a game in QDK 4.0, it will by default include the &quot;additional verbs&quot; library, which means Quest should give a sensible response to commands which are not implemented. It seems this particular game doesn't use that library though - that's up to the author to turn it off.[/quote:24y993oe]\n\nI’ll chalk that down to a newbie who doesn’t know what he’s doing then.\n\n[quote:24y993oe]You can turn them off by pressing the toggle button. And a game author can turn them off or disable them if they wish. A lot of people like them anyway. How do you think they could be made more user friendly?[/quote:24y993oe]\n\nI just don’t care for them at all to be honest. I think they promote laziness in authors. I also think they're problematic as some games are impossible to make progress through without accessing the panels yet turning them off doesn’t give you any indication of this. Plus they only cover a very limited set of commands which means any game that relies on them is going to be very limited in itself.",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><p>Transcripts are a debug feature for game authors, rather than game players really. The information about them is here: <!-- m --><a class=\"postlink\" href=\"http://www.axeuk.com/quest/developer/documentation/debugging.htm\">http://www.axeuk.com/quest/developer/do ... ugging.htm</a><!-- m --></p></blockquote><br/><br/>Fair enough, but shouldn’t it say this in the game somewhere? I doubt most of the people playing the game would be familiar with the above link. I know I wasn’t.<br/><br/><blockquote><p>I don't know why your &quot;What's New&quot; link isn't working - it should open VERSIONS.TXT in your Program Files\\Quest folder. You may want to check if it's been moved or deleted somehow.</p></blockquote><br/><br/>VERSIONS.TXT is there but the link didn’t open this up. Nothing happened at all.<br/><br/><blockquote><p>If you want to output <span style=\"font-style:italic;\">all</span> text to a file, go to the Quest Options screen before starting a game, click the Logging tab and enable the &quot;Output all game text to a file&quot; option.</p></blockquote><br/><br/>There's probably a perfectly good reason for doing it that way, but wouldn’t it make more sense to have this as the default action? Having it default to just listing the entered commands isn't much use to anyone.<br/><br/><blockquote><p>When you create a game in QDK 4.0, it will by default include the &quot;additional verbs&quot; library, which means Quest should give a sensible response to commands which are not implemented. It seems this particular game doesn't use that library though - that's up to the author to turn it off.</p></blockquote><br/><br/>I’ll chalk that down to a newbie who doesn’t know what he’s doing then.<br/><br/><blockquote><p>You can turn them off by pressing the toggle button. And a game author can turn them off or disable them if they wish. A lot of people like them anyway. How do you think they could be made more user friendly?</p></blockquote><br/><br/>I just don’t care for them at all to be honest. I think they promote laziness in authors. I also think they're problematic as some games are impossible to make progress through without accessing the panels yet turning them off doesn’t give you any indication of this. Plus they only cover a very limited set of commands which means any game that relies on them is going to be very limited in itself.",
      "PostDate": "2007-02-08T12:02:49+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12599",
      "UserId": 0,
      "Username": "steve the gaming guy",
      "UserAvatar": null,
      "UserGravatar": "6577a0affcb6ea711c75baf052ffd08a",
      "EditableText": "It does me good to come in here every once in a while.  When I read davidw's posts, I am always guaranteed a good chuckle and little kick of inspiration to get back to finishing my current projects.\n\nMy best DW phrase, &quot;oh dear god&quot;.",
      "EditableFormat": "bbcode",
      "HTML": "It does me good to come in here every once in a while.  When I read davidw's posts, I am always guaranteed a good chuckle and little kick of inspiration to get back to finishing my current projects.<br/><br/>My best DW phrase, &quot;oh dear god&quot;.",
      "PostDate": "2007-02-08T20:24:47+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12605",
      "UserId": 0,
      "Username": "shrimptrawler",
      "UserAvatar": null,
      "UserGravatar": "055dc4bdc5ccc87858f75066199eb164",
      "EditableText": "I wanted to speak a little bit about my game &quot;Something 'Bout A Hex&quot;\n\nFirst, when the game loads, their is a note to players stating that this is a MOUSE-DRIVEN game. You have to use the panes on the right side to play the game. If you disabled the panes, the game will not make sense. Period. Thats just the way THIS game is. If you don't like the panes, don't play the game - I agree - it would be a waste of time.  \n\nThe game is based on a short-story written in 2004. It has been adapted to appear in quest 4.0 as an adventure game, and a loose adaptation at best. I realize that gameplayers have tendencies in how they approach games, but I am not familiar with the game-playing community. I developed the game to present the story &quot;Something 'bout A Hex&quot; with as little ambiguity as possible. Most of the puzzles are EXTREMELY easy. \n\nIt is actually more of a story, less of a game.\n\nBased on this, I am curious to know if anyone has tried to play the game by JUST USING the mouse and the side panes. It would help me out in developing future games, or rather, translating already written short stories into text adventure games.",
      "EditableFormat": "bbcode",
      "HTML": "I wanted to speak a little bit about my game &quot;Something 'Bout A Hex&quot;<br/><br/>First, when the game loads, their is a note to players stating that this is a MOUSE-DRIVEN game. You have to use the panes on the right side to play the game. If you disabled the panes, the game will not make sense. Period. Thats just the way THIS game is. If you don't like the panes, don't play the game - I agree - it would be a waste of time.  <br/><br/>The game is based on a short-story written in 2004. It has been adapted to appear in quest 4.0 as an adventure game, and a loose adaptation at best. I realize that gameplayers have tendencies in how they approach games, but I am not familiar with the game-playing community. I developed the game to present the story &quot;Something 'bout A Hex&quot; with as little ambiguity as possible. Most of the puzzles are EXTREMELY easy. <br/><br/>It is actually more of a story, less of a game.<br/><br/>Based on this, I am curious to know if anyone has tried to play the game by JUST USING the mouse and the side panes. It would help me out in developing future games, or rather, translating already written short stories into text adventure games.",
      "PostDate": "2007-02-09T22:44:32+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12606",
      "UserId": 0,
      "Username": "shrimptrawler",
      "UserAvatar": null,
      "UserGravatar": "055dc4bdc5ccc87858f75066199eb164",
      "EditableText": "[quote=&quot;davidw&quot;:fogxjc65]\nI[i:fogxjc65] then moved on to the final game, Something ‘Bout A Hex, which certainly had a better blurb than the previous games but which crashed with an error message whenever I tried to play it. After some experimentation, it seems that this is another Quest 4 game but the error message never indicated this and so I’d blindly assumed it was still the older version. But I fired it up in the new Quest 4 and tried it. Hey presto! It worked!\n\nTo begin with, it didn’t seem too bad. The first location had an actual honest to god description which was more than a few lines long. It even listed a huge array of items. Wa-hey! Something to examine, I thought. Unfortunately not… as while there might be items listed in the room description, the writer hasn’t bothered providing descriptions for any that I could find. A sample from my transcript went:\n\n&gt; X MANTLE\nI CAN'T SEE THAT HERE.\n\n&gt; X PISTON\nI CAN'T SEE THAT HERE.\n\n&gt; X FISHTANK\nI CAN'T SEE THAT HERE.\n\n&gt; X FIREPLACE\nI CAN'T SEE THAT HERE.\n\n&gt; X DRIED ROSE\nI CAN'T SEE THAT HERE.\n\nEtc…[/i:fogxjc65]\n\nThese objects become available later in the story. They are simply placed here to give the player something to think about.\n\n[i:fogxjc65]If one of those had been missed, I’d probably just chalk it down to simple carelessness and leave it at that. If two had been missed, I’d wonder if the writer needed to get himself a better set of testers. But with all of them missed… well, if this game even knows what a tester looks like, I’d be very surprised.\n\n(As a side note, Quest now has a transcript command. I figured this out pretty much hit and miss as it doesn’t detail it anywhere in the game and the WHAT’S NEW section under the HELP options button doesn’t work. On the down side, the transcript is a remarkably poor one as it doesn’t display any of the text generated by your commands, only the commands themselves, rendering its use as a transcript tool pretty much non-existent. You also don’t receive any confirmation when starting or stopping a transcript and no indication of where the file has been saved. You're not even able to name the transcript which is another failing.)\n\nLeaving the first location presented me with a slight problem: namely that I couldn’t return. [/i:fogxjc65]\n\nYou are not meant to return to that location until later in the game. The location disappears...there is no other significance to that at this time.\n\n\n[i:fogxjc65]The exit had, apparently, gone missing. Other locations presented other problems. One had a door which couldn’t be opened as the OPEN command wasn’t recognised (up to version 4 and Quest still doesn’t understand many of the basic IF commands that every other system has had for years); another had a desk which I needed to GO TO DESK before I could do anything with it (although even when standing right next to it I was told I CAN’T SEE THAT HERE when attempting to examine it). Many locations lacked anything more than a line telling you where you were and the exits, so any attempts at depth the game might have been going for were quickly lost.\n\nIn fact, there were so many things wrong with the game that I was itching to quit it before five minutes had even gone by. For a start, there's no storyline. The intro hints at something about time travel and a hex, which sounded vaguely interesting for a few moments, but the game begins with you pottering around your apartment and won’t let you leave because… well, it doesn’t say why. Most of the locations are sparsely implemented (and that’s being kind) with nothing at all to do in the majority of them. Interaction is mainly done via the side panels and involves you clicking one thing then another. Which is a pain. I’d quite like to see Quest lose the side panels altogether or for them to at least be a little more user friendly. Or for someone to write a Quest game that doesn’t require their use at all.[/i:fogxjc65]\n\nRegarding the opening door and going to the desk, it is as simple as moving the mouse to the desk or the door. I wrote the game without the OPEN verb so I could exclusively keep it a mouse-driven game. The point was to stay true to that approach throughout the game so that you wouldn't have to type anything in. I had to compromise alot in limiting myself to just the LOOK USE TAKE verbs, but their is still a logic in place.\n\nI'm not typing this response to open a discussion of the merits of the mouse and the side panes, but to illustrate the important NOTE TO PLAYERS that i placed in the intro for my game. I am sorry that playing it by  typing in commands on the keyboard makes it seem so rotten, but that is the unfortuante by-product of developing a mouse-driven game.\n\nIt might seem a little harsh to give yet another rating of 1 out of 10 for this, but there's nothing about it I could recommend so that’s the rating I'm going to give it. (1 out of 10)[/quote:fogxjc65]",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><cite>davidw wrote:</cite><br/>I<span style=\"font-style:italic;\"> then moved on to the final game, Something ‘Bout A Hex, which certainly had a better blurb than the previous games but which crashed with an error message whenever I tried to play it. After some experimentation, it seems that this is another Quest 4 game but the error message never indicated this and so I’d blindly assumed it was still the older version. But I fired it up in the new Quest 4 and tried it. Hey presto! It worked!<br/><br/>To begin with, it didn’t seem too bad. The first location had an actual honest to god description which was more than a few lines long. It even listed a huge array of items. Wa-hey! Something to examine, I thought. Unfortunately not… as while there might be items listed in the room description, the writer hasn’t bothered providing descriptions for any that I could find. A sample from my transcript went:<br/><br/>&gt; X MANTLE<br/>I CAN'T SEE THAT HERE.<br/><br/>&gt; X PISTON<br/>I CAN'T SEE THAT HERE.<br/><br/>&gt; X FISHTANK<br/>I CAN'T SEE THAT HERE.<br/><br/>&gt; X FIREPLACE<br/>I CAN'T SEE THAT HERE.<br/><br/>&gt; X DRIED ROSE<br/>I CAN'T SEE THAT HERE.<br/><br/>Etc…</span><br/><br/>These objects become available later in the story. They are simply placed here to give the player something to think about.<br/><br/><span style=\"font-style:italic;\">If one of those had been missed, I’d probably just chalk it down to simple carelessness and leave it at that. If two had been missed, I’d wonder if the writer needed to get himself a better set of testers. But with all of them missed… well, if this game even knows what a tester looks like, I’d be very surprised.<br/><br/>(As a side note, Quest now has a transcript command. I figured this out pretty much hit and miss as it doesn’t detail it anywhere in the game and the WHAT’S NEW section under the HELP options button doesn’t work. On the down side, the transcript is a remarkably poor one as it doesn’t display any of the text generated by your commands, only the commands themselves, rendering its use as a transcript tool pretty much non-existent. You also don’t receive any confirmation when starting or stopping a transcript and no indication of where the file has been saved. You're not even able to name the transcript which is another failing.)<br/><br/>Leaving the first location presented me with a slight problem: namely that I couldn’t return. </span><br/><br/>You are not meant to return to that location until later in the game. The location disappears...there is no other significance to that at this time.<br/><br/><br/><span style=\"font-style:italic;\">The exit had, apparently, gone missing. Other locations presented other problems. One had a door which couldn’t be opened as the OPEN command wasn’t recognised (up to version 4 and Quest still doesn’t understand many of the basic IF commands that every other system has had for years); another had a desk which I needed to GO TO DESK before I could do anything with it (although even when standing right next to it I was told I CAN’T SEE THAT HERE when attempting to examine it). Many locations lacked anything more than a line telling you where you were and the exits, so any attempts at depth the game might have been going for were quickly lost.<br/><br/>In fact, there were so many things wrong with the game that I was itching to quit it before five minutes had even gone by. For a start, there's no storyline. The intro hints at something about time travel and a hex, which sounded vaguely interesting for a few moments, but the game begins with you pottering around your apartment and won’t let you leave because… well, it doesn’t say why. Most of the locations are sparsely implemented (and that’s being kind) with nothing at all to do in the majority of them. Interaction is mainly done via the side panels and involves you clicking one thing then another. Which is a pain. I’d quite like to see Quest lose the side panels altogether or for them to at least be a little more user friendly. Or for someone to write a Quest game that doesn’t require their use at all.</span><br/><br/>Regarding the opening door and going to the desk, it is as simple as moving the mouse to the desk or the door. I wrote the game without the OPEN verb so I could exclusively keep it a mouse-driven game. The point was to stay true to that approach throughout the game so that you wouldn't have to type anything in. I had to compromise alot in limiting myself to just the LOOK USE TAKE verbs, but their is still a logic in place.<br/><br/>I'm not typing this response to open a discussion of the merits of the mouse and the side panes, but to illustrate the important NOTE TO PLAYERS that i placed in the intro for my game. I am sorry that playing it by  typing in commands on the keyboard makes it seem so rotten, but that is the unfortuante by-product of developing a mouse-driven game.<br/><br/>It might seem a little harsh to give yet another rating of 1 out of 10 for this, but there's nothing about it I could recommend so that’s the rating I'm going to give it. (1 out of 10)</blockquote>",
      "PostDate": "2007-02-09T22:57:39+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12607",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "[quote=&quot;shrimptrawler&quot;:1ieible6]\nThese objects become available later in the story. They are simply placed here to give the player something to think about.[/quote:1ieible6]\n\na) Wouldn't it have been a better idea to tell the player that at the time?\n\nb) Do you seriously think it's a good idea to include a number of items in the room description but not include a description for any of them?\n\n[quote=&quot;shrimptrawler&quot;:1ieible6]\nYou are not meant to return to that location until later in the game. The location disappears...there is no other significance to that at this time.[/quote:1ieible6]\n\nAnd how the player is supposed to be aware of this?\n\n[quote=&quot;shrimptrawler&quot;:1ieible6]I'm not typing this response to open a discussion of the merits of the mouse and the side panes, but to illustrate the important NOTE TO PLAYERS that i placed in the intro for my game. I am sorry that playing it by  typing in commands on the keyboard makes it seem so rotten, but that is the unfortuante by-product of developing a mouse-driven game.[/quote:1ieible6]\n\nI hate to say this but Quest is aimed primarily at writing text adventures and not mouse-driven games. If you're planning to write mouse-driven games, you're probably using the wrong software.",
      "EditableFormat": "bbcode",
      "HTML": "<blockquote><cite>shrimptrawler wrote:</cite><br/>These objects become available later in the story. They are simply placed here to give the player something to think about.</blockquote><br/><br/>a) Wouldn't it have been a better idea to tell the player that at the time?<br/><br/>b) Do you seriously think it's a good idea to include a number of items in the room description but not include a description for any of them?<br/><br/><blockquote><cite>shrimptrawler wrote:</cite><br/>You are not meant to return to that location until later in the game. The location disappears...there is no other significance to that at this time.</blockquote><br/><br/>And how the player is supposed to be aware of this?<br/><br/><blockquote><cite>shrimptrawler wrote:</cite>I'm not typing this response to open a discussion of the merits of the mouse and the side panes, but to illustrate the important NOTE TO PLAYERS that i placed in the intro for my game. I am sorry that playing it by  typing in commands on the keyboard makes it seem so rotten, but that is the unfortuante by-product of developing a mouse-driven game.</blockquote><br/><br/>I hate to say this but Quest is aimed primarily at writing text adventures and not mouse-driven games. If you're planning to write mouse-driven games, you're probably using the wrong software.",
      "PostDate": "2007-02-10T00:01:26+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12608",
      "UserId": 0,
      "Username": "shrimptrawler",
      "UserAvatar": null,
      "UserGravatar": "055dc4bdc5ccc87858f75066199eb164",
      "EditableText": "Thank you for your reply. All your points are very good, and as being new to the gaming community, I'll do my best to address them all.\n[i:3r8ff36y]\n[i][quote=&quot;davidw&quot;:3r8ff36y][quote=&quot;shrimptrawler&quot;:3r8ff36y]\nThese objects become available later in the story. They are simply placed here to give the player something to think about.[/quote:3r8ff36y]\n\na) Wouldn't it have been a better idea to tell the player that at the time?[/i:3r8ff36y][/i]\n\nThe idea here is that there is no significance to look at these objects at this time. The motorcycle piston, the dried rose, the snow globe...why AREN'T they listed in the panes as objects? Well, because your character has seen these objects on display in this room hundreds of times already. My method was to help establish a familiarity with the room that you are in. Much like your own living room, do you look at, and examine every object that is present all the time? The point is : you have looked up at the snow globe on the mantel hundreds of times...I wouldn't put it into the game unless at some point you needed to look at it. Just push it into your memory. You may/may not look at it later. But if you were playing without the panes in use, it must have been awfully frustrating to play. I apologize for not making it more clear in the introduction that you DO NEED to use the mouse and the panes to have any chance of getting through the game.\n\nb[i:3r8ff36y]) Do you seriously think it's a good idea to include a number of items in the room description but not include a description for any of them?[/i:3r8ff36y]\n[quote=&quot;shrimptrawler&quot;:3r8ff36y]\nYou are not meant to return to that location until later in the game. The location disappears...there is no other significance to that at this time.[/quote:3r8ff36y]\n\nAnd how the player is supposed to be aware of this?\n\n[quote=&quot;shrimptrawler&quot;:3r8ff36y]I'm not typing this response to open a discussion of the merits of the mouse and the side panes, but to illustrate the important NOTE TO PLAYERS that i placed in the intro for my game. I am sorry that playing it by  typing in commands on the keyboard makes it seem so rotten, but that is the unfortuante by-product of developing a mouse-driven game.[/quote:3r8ff36y]\n\n[i:3r8ff36y]I hate to say this but Quest is aimed primarily at writing text adventures and not mouse-driven games. If you're planning to write mouse-driven games, you're probably using the wrong software.[/quote:3r8ff36y][/i:3r8ff36y]\n\n\nBut quest has created software where you can create a game that only uses mouse commands! Early in the writing process, I asked Alex about the EXAMINE verb not being present in quest 4.0 versus quest 3.53...the EXAMINE verb was removed...because of this, I modified my game and removed all instances of the EXAMINE verb. \n\nWhy?\n\nBecause in quest 4.0 the user would have to type in &quot;examine dried rose&quot;...and that would compromise my idea of being a mouse only game.\nAgain, I'm not trying to form an opinion on the pros and cons of writing text adventure games that use the keyboard, the mouse, or both. My next game may be a game where the panes are disabled and you have to type in ALL commands. But for the purposes of &quot;Something 'Bout A Hex&quot; the goal was simply to use the mouse.\n\nI like the QDK software. I found a lot of ways of taking a very minimal amount of verbs and making a story with depth. You wrote earlier of a lack of object descriptions. As you go further in the game, you will discover a lot of text block descriptions, menus, timers, that enrich the storytelling process.\n\nI'd like to end this reply by restating that &quot;Something 'bout A Hex&quot; was a short story written 3 years ago, and I wrote an adapted version to be presented here in quest. Is it a game or is it a story? My attempt was for it to be a little bit of both.",
      "EditableFormat": "bbcode",
      "HTML": "Thank you for your reply. All your points are very good, and as being new to the gaming community, I'll do my best to address them all.<br/><span style=\"font-style:italic;\"><br/>[i]<blockquote><cite>davidw wrote:</cite><blockquote><p><b>&quot;shrimptrawler&quot;</b></p><p><br/>These objects become available later in the story. They are simply placed here to give the player something to think about.</blockquote><br/><br/>a) Wouldn't it have been a better idea to tell the player that at the time?</span>[/i]<br/><br/>The idea here is that there is no significance to look at these objects at this time. The motorcycle piston, the dried rose, the snow globe...why AREN'T they listed in the panes as objects? Well, because your character has seen these objects on display in this room hundreds of times already. My method was to help establish a familiarity with the room that you are in. Much like your own living room, do you look at, and examine every object that is present all the time? The point is : you have looked up at the snow globe on the mantel hundreds of times...I wouldn't put it into the game unless at some point you needed to look at it. Just push it into your memory. You may/may not look at it later. But if you were playing without the panes in use, it must have been awfully frustrating to play. I apologize for not making it more clear in the introduction that you DO NEED to use the mouse and the panes to have any chance of getting through the game.<br/><br/>b<span style=\"font-style:italic;\">) Do you seriously think it's a good idea to include a number of items in the room description but not include a description for any of them?</span><br/><blockquote><cite>shrimptrawler wrote:</cite><br/>You are not meant to return to that location until later in the game. The location disappears...there is no other significance to that at this time.</blockquote><br/><br/>And how the player is supposed to be aware of this?<br/><br/><blockquote><cite>shrimptrawler wrote:</cite>I'm not typing this response to open a discussion of the merits of the mouse and the side panes, but to illustrate the important NOTE TO PLAYERS that i placed in the intro for my game. I am sorry that playing it by  typing in commands on the keyboard makes it seem so rotten, but that is the unfortuante by-product of developing a mouse-driven game.</blockquote><br/><br/><span style=\"font-style:italic;\">I hate to say this but Quest is aimed primarily at writing text adventures and not mouse-driven games. If you're planning to write mouse-driven games, you're probably using the wrong software.</p></blockquote></span><br/><br/><br/>But quest has created software where you can create a game that only uses mouse commands! Early in the writing process, I asked Alex about the EXAMINE verb not being present in quest 4.0 versus quest 3.53...the EXAMINE verb was removed...because of this, I modified my game and removed all instances of the EXAMINE verb. <br/><br/>Why?<br/><br/>Because in quest 4.0 the user would have to type in &quot;examine dried rose&quot;...and that would compromise my idea of being a mouse only game.<br/>Again, I'm not trying to form an opinion on the pros and cons of writing text adventure games that use the keyboard, the mouse, or both. My next game may be a game where the panes are disabled and you have to type in ALL commands. But for the purposes of &quot;Something 'Bout A Hex&quot; the goal was simply to use the mouse.<br/><br/>I like the QDK software. I found a lot of ways of taking a very minimal amount of verbs and making a story with depth. You wrote earlier of a lack of object descriptions. As you go further in the game, you will discover a lot of text block descriptions, menus, timers, that enrich the storytelling process.<br/><br/>I'd like to end this reply by restating that &quot;Something 'bout A Hex&quot; was a short story written 3 years ago, and I wrote an adapted version to be presented here in quest. Is it a game or is it a story? My attempt was for it to be a little bit of both.",
      "PostDate": "2007-02-10T02:09:58+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12785",
      "UserId": 0,
      "Username": "davidw",
      "UserAvatar": null,
      "UserGravatar": "5d9c9199ac213c3e7284cd76a2262c4a",
      "EditableText": "And so to the fifth and final game – Steve Lingle’s King’s Quest V – which I decided to make a more determined effort to get on with than the other games. Why? Well, he’s written two previous games with Quest and they're far and away the best Quest games I've ever played. (Of course, considering the competition he’s up against…)\r\n\r\nThe introduction was lengthy and a bit flawed in the grammar department what with a fair number of errors showing up (the game lists several testers, though unfortunately none of them seem to know a good proofread when they see one) and some awful colour schemes. Some of the dialogue is in red, some in blue, and with the game’s main text being my preferred choice of white, this makes the whole thing seem more than a little gaudy. But a few changes from the top menu, a restart (Quest apparently can’t change something as basic as the font colour without restarting), and I was away.\r\n\r\nThe ever unwelcome side panel (grrr!) is better used here than in most games, but the usual flaws are present, too. The first location lists three items that can be examined – a well, a small pond and some chap called Cedric – yet there is also a town and a house that you can look at as well via the old-fashioned idea of typing in commands. I can well imagine this kind of thing being highly problematic in that if you rely on only what is displayed in the side panel (as seems to be the general idea with Quest), you wouldn’t be aware there were other things that could be examined. This could well lead to you missing something vital to completing the game. On the other hand, if you hide the side panel and the item you need to examine is only referred to there and not in the text itself (as has been the case a time or two before in various games) then you're potentially rendering the game unfinishable.\r\n\r\nThere's an added problem in that not everything mentioned in the side panel can be examined, though it’s often not until you’ve typed in several different things trying to garner a response that you become aware of this. The town location refers to a barrel, a wagon, a silver coin (apparently lying around in the middle of town though only the player has the wherewithal to pick it up) and three shops, yet none of the shops can be examined. Why? Well, according to the panel they're places and not objects and apparently places can’t be examined. Hmmm… \r\n\r\nParser problems abound. Normally I'm not too fussed over the whole parser debate, but Quest’s parser, and its many flaws, seem to affect every game written with it. For example, Cedric, the named NPC in the first location, cannot be referred to as HIM but, strangely enough, as IT. Even more bizarre, the sequence X CEDRIC followed by X HIM produces \r\n\r\nI don't know what 'him' you are referring to.\r\nI don't know what 'him' you are referring to.\r\nI can't see that here.\r\n\r\nOn top of that, we have parser inflexibility. GO WELL isn't an acceptable command apparently, but something like GO TO THE WELL is considered fine. Surely Quest can check a simple command like that, realise it’s the same as GO WELL and process it accordingly? Then there are the usual problems with perfectly ordinary words not being understood, or with commands displaying an error message if not followed by a noun. So TALK on its own will produce the standard Quest error message, yet TALK TO [NPC] will work fine. (The problem here is that if you tried TALK on its own and got an error message, you might well assume the command didn’t work in the game and not try it again.) Oh yes, Quest’s parser leaves a lot to be desired and has the potential to turn even a good game into something almost unplayable. Then there are the downright bizarre problems. When standing outside an inn, I attempted to GO TO THE INN and was told I couldn’t go there.\r\n\r\nBut enough with the flaws of the system. What about the game itself?\r\n\r\nIt’s certainly better written than the average Quest game, though suffers from a poor grasp of grammar for the most part. From time to time, the game switches from first person (referring to the player as YOU) to third person (referring to the player as GRAHAM) which is a little jarring to say the least. There doesn’t seem to be any real consistency to this and instead it appears to be down more to simple carelessness than anything else.\r\n\r\nInstant deaths abound, never a favourite of mine, and here there are far too many of them. The first game (this is the sequel incidentally) featured this theme as well, and no matter how many times someone can espouse on just why it’s a good idea to have the player killed instantly and without warning, every time it happens to me I find myself wishing they just wouldn’t bother. Why not a simple warning that the player might die? Why not put the player in peril but give them the opportunity to get out in one piece? Why not injure the player or take away score points for mistakes? Killing them every few moves is just a pain.  With Quest lacking the vital UNDO feature, dying means clicking on the restore option in the right hand panel in order to go back to your previous saved game position. (Ah, but what if you’ve decided to play the game with the side panel turned off? Well, then you're up a certain creek without a certain implement because the command entry line becomes disabled when you die, thus putting you in a very sticky position indeed.) With the sheer number of instant deaths on show here, this can become very tiring very quickly. \r\n\r\nThe game compensates for this to some degree by including a feature that is every bit as annoying here as it was in the first game: namely a message flashing up on screen from time to time warning you to save your game. As with the first game, this seems like a sound idea in theory but when it happens every single time you go a certain way, it quickly becomes a pain. \r\n\r\nIn style, King’s Quest V  is a very retro game. There are no long, flowery descriptions of locations, no details beyond the very basics, the aforementioned instant deaths and, sigh, several timers that don’t really add anything to the game but a fervent wish that the author hadn’t felt the need to include them. Wandering around the desert (a remarkably empty set of locations all virtually identical to each other), I died every four to five moves unless I could find an oasis and drink from it. For some reason, I couldn’t seem to find a way to take any of the water with me (the player apparently lives in a world where glasses, bottles and the like do not exist) so this made exploring the desert an arduous and frustrating task. I’d find an oasis then walk around it for a bit until I got a message telling me the heat was getting to me, then run back to the oasis, have a drink, and explore a bit further. Sometimes I’d make it back in one piece. Often I wouldn’t. By the time I had the desert sufficiently explored, I think I’d died half a dozen times and spent more time than I care to mention wondering just why the author had included such an ultimately annoying puzzle in his game.\r\n\r\nAlarmingly few commands seem to be covered and sometimes you need to try something else entirely just to get the game to accept the command you want. For example, I can’t BUY SLED (buy is another word Quest still doesn’t have in its vocabulary), yet talking to the toy shop owner begins a conversation where I try to buy the sled. \r\n\r\nI spent quite a bit longer on King’s Quest V than I normally do with Quest games, hoping that despite its flaws there was a decent game here, but in the end the sheer number of bugs, the frequent problems with the perspective switching from first to third person, the poor standard of testing and, yes, the usual hassles of playing any kind of game with Quest, made me decide I’d be better off playing something else instead. Overall, it’s probably a better game than the first one, but it ends up with a lesser score because whereas I once felt Quest had potential as a text adventure system, I now suspect it doesn’t; as a result I find myself disliking each subsequent game written with it a bit more than the one before. Maybe it is possible to write a genuinely decent game with Quest, but it’s not something I’d bet money on and I’ve pretty much given up any kind of hope of it happening within my lifetime.\r\n\r\nWhile not the unplayable mess that most Quest games are, King’s Quest V is far too flawed for me to ever recommend it to anyone and while it’s probably the most accomplished Quest game written to date, by the standards of any other system it would be ranked as poor indeed. (3 out of 10)",
      "EditableFormat": "bbcode",
      "HTML": "And so to the fifth and final game – Steve Lingle’s King’s Quest V – which I decided to make a more determined effort to get on with than the other games. Why? Well, he’s written two previous games with Quest and they're far and away the best Quest games I've ever played. (Of course, considering the competition he’s up against…)<br/><br/>The introduction was lengthy and a bit flawed in the grammar department what with a fair number of errors showing up (the game lists several testers, though unfortunately none of them seem to know a good proofread when they see one) and some awful colour schemes. Some of the dialogue is in red, some in blue, and with the game’s main text being my preferred choice of white, this makes the whole thing seem more than a little gaudy. But a few changes from the top menu, a restart (Quest apparently can’t change something as basic as the font colour without restarting), and I was away.<br/><br/>The ever unwelcome side panel (grrr!) is better used here than in most games, but the usual flaws are present, too. The first location lists three items that can be examined – a well, a small pond and some chap called Cedric – yet there is also a town and a house that you can look at as well via the old-fashioned idea of typing in commands. I can well imagine this kind of thing being highly problematic in that if you rely on only what is displayed in the side panel (as seems to be the general idea with Quest), you wouldn’t be aware there were other things that could be examined. This could well lead to you missing something vital to completing the game. On the other hand, if you hide the side panel and the item you need to examine is only referred to there and not in the text itself (as has been the case a time or two before in various games) then you're potentially rendering the game unfinishable.<br/><br/>There's an added problem in that not everything mentioned in the side panel can be examined, though it’s often not until you’ve typed in several different things trying to garner a response that you become aware of this. The town location refers to a barrel, a wagon, a silver coin (apparently lying around in the middle of town though only the player has the wherewithal to pick it up) and three shops, yet none of the shops can be examined. Why? Well, according to the panel they're places and not objects and apparently places can’t be examined. Hmmm… <br/><br/>Parser problems abound. Normally I'm not too fussed over the whole parser debate, but Quest’s parser, and its many flaws, seem to affect every game written with it. For example, Cedric, the named NPC in the first location, cannot be referred to as HIM but, strangely enough, as IT. Even more bizarre, the sequence X CEDRIC followed by X HIM produces <br/><br/>I don't know what 'him' you are referring to.<br/>I don't know what 'him' you are referring to.<br/>I can't see that here.<br/><br/>On top of that, we have parser inflexibility. GO WELL isn't an acceptable command apparently, but something like GO TO THE WELL is considered fine. Surely Quest can check a simple command like that, realise it’s the same as GO WELL and process it accordingly? Then there are the usual problems with perfectly ordinary words not being understood, or with commands displaying an error message if not followed by a noun. So TALK on its own will produce the standard Quest error message, yet TALK TO [NPC] will work fine. (The problem here is that if you tried TALK on its own and got an error message, you might well assume the command didn’t work in the game and not try it again.) Oh yes, Quest’s parser leaves a lot to be desired and has the potential to turn even a good game into something almost unplayable. Then there are the downright bizarre problems. When standing outside an inn, I attempted to GO TO THE INN and was told I couldn’t go there.<br/><br/>But enough with the flaws of the system. What about the game itself?<br/><br/>It’s certainly better written than the average Quest game, though suffers from a poor grasp of grammar for the most part. From time to time, the game switches from first person (referring to the player as YOU) to third person (referring to the player as GRAHAM) which is a little jarring to say the least. There doesn’t seem to be any real consistency to this and instead it appears to be down more to simple carelessness than anything else.<br/><br/>Instant deaths abound, never a favourite of mine, and here there are far too many of them. The first game (this is the sequel incidentally) featured this theme as well, and no matter how many times someone can espouse on just why it’s a good idea to have the player killed instantly and without warning, every time it happens to me I find myself wishing they just wouldn’t bother. Why not a simple warning that the player might die? Why not put the player in peril but give them the opportunity to get out in one piece? Why not injure the player or take away score points for mistakes? Killing them every few moves is just a pain.  With Quest lacking the vital UNDO feature, dying means clicking on the restore option in the right hand panel in order to go back to your previous saved game position. (Ah, but what if you’ve decided to play the game with the side panel turned off? Well, then you're up a certain creek without a certain implement because the command entry line becomes disabled when you die, thus putting you in a very sticky position indeed.) With the sheer number of instant deaths on show here, this can become very tiring very quickly. <br/><br/>The game compensates for this to some degree by including a feature that is every bit as annoying here as it was in the first game: namely a message flashing up on screen from time to time warning you to save your game. As with the first game, this seems like a sound idea in theory but when it happens every single time you go a certain way, it quickly becomes a pain. <br/><br/>In style, King’s Quest V  is a very retro game. There are no long, flowery descriptions of locations, no details beyond the very basics, the aforementioned instant deaths and, sigh, several timers that don’t really add anything to the game but a fervent wish that the author hadn’t felt the need to include them. Wandering around the desert (a remarkably empty set of locations all virtually identical to each other), I died every four to five moves unless I could find an oasis and drink from it. For some reason, I couldn’t seem to find a way to take any of the water with me (the player apparently lives in a world where glasses, bottles and the like do not exist) so this made exploring the desert an arduous and frustrating task. I’d find an oasis then walk around it for a bit until I got a message telling me the heat was getting to me, then run back to the oasis, have a drink, and explore a bit further. Sometimes I’d make it back in one piece. Often I wouldn’t. By the time I had the desert sufficiently explored, I think I’d died half a dozen times and spent more time than I care to mention wondering just why the author had included such an ultimately annoying puzzle in his game.<br/><br/>Alarmingly few commands seem to be covered and sometimes you need to try something else entirely just to get the game to accept the command you want. For example, I can’t BUY SLED (buy is another word Quest still doesn’t have in its vocabulary), yet talking to the toy shop owner begins a conversation where I try to buy the sled. <br/><br/>I spent quite a bit longer on King’s Quest V than I normally do with Quest games, hoping that despite its flaws there was a decent game here, but in the end the sheer number of bugs, the frequent problems with the perspective switching from first to third person, the poor standard of testing and, yes, the usual hassles of playing any kind of game with Quest, made me decide I’d be better off playing something else instead. Overall, it’s probably a better game than the first one, but it ends up with a lesser score because whereas I once felt Quest had potential as a text adventure system, I now suspect it doesn’t; as a result I find myself disliking each subsequent game written with it a bit more than the one before. Maybe it is possible to write a genuinely decent game with Quest, but it’s not something I’d bet money on and I’ve pretty much given up any kind of hope of it happening within my lifetime.<br/><br/>While not the unplayable mess that most Quest games are, King’s Quest V is far too flawed for me to ever recommend it to anyone and while it’s probably the most accomplished Quest game written to date, by the standards of any other system it would be ranked as poor indeed. (3 out of 10)",
      "PostDate": "2007-02-22T13:31:04+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12786",
      "UserId": 0,
      "Username": "Alex",
      "UserAvatar": null,
      "UserGravatar": "188b72c5e13327f4fde3989dca7d7d53",
      "EditableText": "It's worth pointing out that this game is written in Quest 3, not Quest 4, and as such doesn't feature things like the built-in additional verbs (&quot;buy&quot; etc.)",
      "EditableFormat": "bbcode",
      "HTML": "It's worth pointing out that this game is written in Quest 3, not Quest 4, and as such doesn't feature things like the built-in additional verbs (&quot;buy&quot; etc.)",
      "PostDate": "2007-02-22T14:12:49+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12788",
      "UserId": 0,
      "Username": "Freak",
      "UserAvatar": null,
      "UserGravatar": "325ed9ac125e00c9937be0d3aea0916d",
      "EditableText": "Part of the problem with KQ5 is that it's a port of an old Sierra game (IIRC, their first all-mouse game); according to Wikipedia it's from 1990.",
      "EditableFormat": "bbcode",
      "HTML": "Part of the problem with KQ5 is that it's a port of an old Sierra game (IIRC, their first all-mouse game); according to Wikipedia it's from 1990.",
      "PostDate": "2007-02-22T15:58:40+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12790",
      "UserId": 0,
      "Username": "paul_one",
      "UserAvatar": null,
      "UserGravatar": "fef8a1875028f4300bb683f29c432894",
      "EditableText": "Erm, the examine him/it problem may be because the object cedric doesn't have an &quot;it/he/she&quot; defined in it.. in which case 'it' would be defaulted in?",
      "EditableFormat": "bbcode",
      "HTML": "Erm, the examine him/it problem may be because the object cedric doesn't have an &quot;it/he/she&quot; defined in it.. in which case 'it' would be defaulted in?",
      "PostDate": "2007-02-22T17:36:02+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12794",
      "UserId": 0,
      "Username": "Alex",
      "UserAvatar": null,
      "UserGravatar": "188b72c5e13327f4fde3989dca7d7d53",
      "EditableText": "Yes that's probably correct.\r\n\r\nThat sort of thing was a slight pain in QDK 3, but if Steve had used QDK 4 he would just need to select &quot;Male character&quot; from the &quot;type&quot; drop-down for the object.",
      "EditableFormat": "bbcode",
      "HTML": "Yes that's probably correct.<br/><br/>That sort of thing was a slight pain in QDK 3, but if Steve had used QDK 4 he would just need to select &quot;Male character&quot; from the &quot;type&quot; drop-down for the object.",
      "PostDate": "2007-02-22T18:12:13+00:00",
      "LastEditDate": null
    },
    {
      "PostId": "12805",
      "UserId": 0,
      "Username": "steve the gaming guy",
      "UserAvatar": null,
      "UserGravatar": "6577a0affcb6ea711c75baf052ffd08a",
      "EditableText": "Ok....I'll respond.  lol.... \r\n\r\nSee the KQ5 thread...",
      "EditableFormat": "bbcode",
      "HTML": "Ok....I'll respond.  lol.... <br/><br/>See the KQ5 thread...",
      "PostDate": "2007-02-22T20:41:24+00:00",
      "LastEditDate": null
    }
  ]
}
